TableTest = {
    "groups": {
        "bAP_211": {
            "Numerator": {
                "Monday": [
                    [5, "Лабораторные занятия Прикладное имитационное моделирование ", "15:15:00", "16:50:00", " Кузнецов М. В. ", "202/2", 0],
                    [6, "Лабораторные занятия Прикладное имитационное моделирование ", "17:00:00", "18:35:00", " Кузнецов М. В. ", "202/2", 0]
                ],
                "Tuesday": [],
                "Wednesday": [
                    [2, "Лабораторные занятия Автоматизация конструкторского и технологического проектирования ", "9:45:00", "11:20:00", " Пачевский Д. Е. ", "210/2", 0],
                    [3, "Лабораторные занятия Автоматизация конструкторского и технологического проектирования ", "11:30:00", "13:05:00", " Пачевский Д. Е. ", "210/2", 1],
                    [3, "Лабораторные занятия Системы искусственного интеллекта ", "11:30:00", "13:05:00", " Собенина О. В. ", "213/2", 2],
                    [4, "Лабораторные занятия Коммутация и маршрутизация в компьютерных сетях ", "13:30:00", "15:05:00", " Попов А. В. ", "213/2", 1],
                    [4, "Лабораторные занятия Инструментальные средства моделирования сложных систем ", "13:30:00", "15:05:00", " Короленко В. В. ", "210/2", 2],
                    [5, "Лабораторные занятия Коммутация и маршрутизация в компьютерных сетях ", "15:15:00", "16:50:00", " Попов А. В. ", "213/2", 1],
                    [5, "Лабораторные занятия Инструментальные средства моделирования сложных систем ", "15:15:00", "16:50:00", " Короленко В. В. ", "210/2", 2]
                ],
                "Thursday": [
                    [3, "Лекционные занятия Автоматизация конструкторского и технологического проектирования ", "11:30:00", "13:05:00", " Пачевский Д. Е. ", "105/2", 0],
                    [4, "Лекционные занятия Прикладное имитационное моделирование ", "13:30:00", "15:05:00", " Кузнецов М. В. ", "210/2", 0],
                    [5, "Лабораторные занятия Системы искусственного интеллекта ", "15:15:00", "16:50:00", " Горбунов В. Г. ", "215/2", 1],
                    [5, "Лабораторные занятия Прикладное имитационное моделирование ", "15:15:00", "16:50:00", " Кузнецов М. В. ", "202/2", 2],
                    [6, "Лабораторные занятия Прикладное имитационное моделирование ", "17:00:00", "18:35:00", " Кузнецов М. В. ", "202/2", 0]
                ],
                "Friday": [
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Пак А. А. ", "202/2", 0],
                    [4, "Лекционные занятия Коммутация и маршрутизация в компьютерных сетях ", "13:30:00", "15:05:00", " Попов А. В. ", "210/2", 0],
                    [5, "Лабораторные занятия Коммутация и маршрутизация в компьютерных сетях ", "15:15:00", "16:50:00", " Попов А. В. ", "213/2", 0],
                    [6, "Лабораторные занятия Коммутация и маршрутизация в компьютерных сетях ", "17:00:00", "18:35:00", " Попов А. В. ", "213/2", 0]
                ],
                "Saturday": [
                    [1, "Лабораторные занятия Автоматизация конструкторского и технологического проектирования ", "8:00:00", "9:35:00", " Пачевская Е. А. ", "215/2", 0],
                    [2, "Лабораторные занятия Автоматизация конструкторского и технологического проектирования ", "9:45:00", "11:20:00", " Пачевская Е. А. ", "215/2", 0],
                    [3, "Лекционные занятия Инструментальные средства моделирования сложных систем ", "11:30:00", "13:05:00", " Короленко В. В. ", "307/2", 0],
                    [4, "Лекционные занятия Системы искусственного интеллекта ", "13:30:00", "15:05:00", " Собенина О. В. ", "307/2", 0],
                    [5, "Лабораторные занятия Инструментальные средства моделирования сложных систем ", "15:15:00", "16:50:00", " Короленко В. В.  Короленко В. В. ", "208/2", 0],
                    [6, "Лабораторные занятия Инструментальные средства моделирования сложных систем ", "17:00:00", "18:35:00", " Короленко В. В.  Короленко В. В. ", "208/2", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [5, "Лабораторные занятия Прикладное имитационное моделирование ", "15:15:00", "16:50:00", " Кузнецов М. В. ", "202/2", 0],
                    [6, "Лабораторные занятия Прикладное имитационное моделирование ", "17:00:00", "18:35:00", " Кузнецов М. В. ", "202/2", 0]
                ],
                "Tuesday": [
                    [3, "Лекционные занятия Системы искусственного интеллекта ", "11:30:00", "13:05:00", " Собенина О. В. ", "303/2", 0],
                    [4, "Практические занятия Системы искусственного интеллекта ", "13:30:00", "15:05:00", " Собенина О. В. ", "303/2", 0],
                    [5, "Лабораторные занятия Автоматизация конструкторского и технологического проектирования ", "15:15:00", "16:50:00", " Пачевский Д. Е. ", "213/2", 0],
                    [6, "Лабораторные занятия Автоматизация конструкторского и технологического проектирования ", "17:00:00", "18:35:00", " Пачевский Д. Е. ", "213/2", 0]
                ],
                "Wednesday": [
                    [2, "Лабораторные занятия Системы искусственного интеллекта ", "9:45:00", "11:20:00", " Собенина О. В. ", "210/2", 0],
                    [3, "Лабораторные занятия Системы искусственного интеллекта ", "11:30:00", "13:05:00", " Собенина О. В. ", "210/2", 0],
                    [4, "Лабораторные занятия Системы искусственного интеллекта ", "13:30:00", "15:05:00", " Горбунов В. Г. ", "210/2", 1],
                    [4, "Лабораторные занятия Коммутация и маршрутизация в компьютерных сетях ", "13:30:00", "15:05:00", " Попов А. В. ", "213/2", 2],
                    [5, "Лабораторные занятия Системы искусственного интеллекта ", "15:15:00", "16:50:00", " Горбунов В. Г. ", "210/2", 1],
                    [5, "Лабораторные занятия Коммутация и маршрутизация в компьютерных сетях ", "15:15:00", "16:50:00", " Попов А. В. ", "213/2", 2]
                ],
                "Thursday": [
                    [3, "Лекционные занятия Автоматизация конструкторского и технологического проектирования ", "11:30:00", "13:05:00", " Пачевский Д. Е. ", "311/2", 0],
                    [4, "Лекционные занятия Прикладное имитационное моделирование ", "13:30:00", "15:05:00", " Кузнецов М. В. ", "210/2", 0],
                    [5, "Лабораторные занятия Прикладное имитационное моделирование ", "15:15:00", "16:50:00", " Кузнецов М. В. ", "202/2", 1],
                    [5, "Лабораторные занятия Автоматизация конструкторского и технологического проектирования ", "15:15:00", "16:50:00", " Пачевская Е. А. ", "215/2", 2],
                    [6, "Лабораторные занятия Прикладное имитационное моделирование ", "17:00:00", "18:35:00", " Кузнецов М. В. ", "202/2", 1],
                    [6, "Лабораторные занятия Автоматизация конструкторского и технологического проектирования ", "17:00:00", "18:35:00", " Пачевская Е. А. ", "215/2", 2]
                ],
                "Friday": [
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Пак А. А. ", "202/2", 0],
                    [4, "Лекционные занятия Коммутация и маршрутизация в компьютерных сетях ", "13:30:00", "15:05:00", " Попов А. В. ", "210/2", 0],
                    [5, "Лабораторные занятия Коммутация и маршрутизация в компьютерных сетях ", "15:15:00", "16:50:00", " Попов А. В. ", "213/2", 0],
                    [6, "Лабораторные занятия Коммутация и маршрутизация в компьютерных сетях ", "17:00:00", "18:35:00", " Попов А. В. ", "213/2", 0]
                ],
                "Saturday": []
            }
        },
        "bAP_221": {
            "Numerator": {
                "Monday": [
                    [3, "Лекционные занятия Оптимизация в САПР ", "11:30:00", "13:05:00", " Собенина О. В. ", "210/2", 0],
                    [4, "Лабораторные занятия Оптимизация в САПР ", "13:30:00", "15:05:00", " Собенина О. В. ", "210/2", 1],
                    [4, "Лабораторные занятия Автоматизированные робототехнические комплексы ", "13:30:00", "15:05:00", " Мануковский А. Ю. ", "202/2", 2],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Груза М. С. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Лекционные занятия Профессиональная этика ", "17:00:00", "18:35:00", " Дорохина Р. В. ", "3113", 0]
                ],
                "Tuesday": [
                    [2, "Лабораторные занятия Программирование производственных систем ", "9:45:00", "11:20:00", " Ветохин В. В. ", "202/2", 0],
                    [3, "Лабораторные занятия Программирование производственных систем ", "11:30:00", "13:05:00", " Ветохин В. В. ", "202/2", 0],
                    [4, "Практические занятия Проектная деятельность ", "13:30:00", "15:05:00", " Бредихин А. В. ", "213/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Профессиональная этика ", "15:15:00", "16:50:00", " Дорохина Р. В. ", "5313", 0]
                ],
                "Wednesday": [
                    [3, "Лабораторные занятия Основы системного анализа ", "11:30:00", "13:05:00", " Пак А. А. ", "215/2", 0],
                    [4, "Лекционные занятия Основы системного анализа ", "13:30:00", "15:05:00", " Пак А. А. ", "215/2", 0],
                    [5, "Лекционные занятия Программирование производственных систем ", "15:15:00", "16:50:00", " Ветохин В. В. ", "206/2", 0],
                    [6, "Лабораторные занятия Архитектура и инжиниринг бизнес-систем ", "17:00:00", "18:35:00", " Бредихин А. В. ", "213/2", 1],
                    [6, "Лабораторные занятия Программирование производственных систем ", "17:00:00", "18:35:00", " Ветохин В. В. ", "202/2", 2]
                ],
                "Thursday": [
                    [3, "Практические занятия Технологическое предпринимательство ", "11:30:00", "13:05:00", " Бредихин А. В. ", "312/2", 0],
                    [4, "Лекционные занятия Архитектура и инжиниринг бизнес-систем ", "13:30:00", "15:05:00", " Бредихин А. В. ", "111/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Груза М. С. ", "0000", 0]
                ],
                "Friday": [],
                "Saturday": [
                    [1, "Лабораторные занятия Оптимизация в САПР ", "8:00:00", "9:35:00", " Собенина О. В. ", "210/2", 0],
                    [2, "Лабораторные занятия Оптимизация в САПР ", "9:45:00", "11:20:00", " Собенина О. В. ", "210/2", 0],
                    [3, "Лабораторные занятия Основы системного анализа ", "11:30:00", "13:05:00", " Пак А. А. ", "210/2", 0],
                    [4, "Лабораторные занятия Основы системного анализа ", "13:30:00", "15:05:00", " Пак А. А. ", "210/2", 0],
                    [5, "Лабораторные занятия Архитектура и инжиниринг бизнес-систем ", "15:15:00", "16:50:00", " Бредихин А. В. ", "213/2", 0],
                    [6, "Лабораторные занятия Архитектура и инжиниринг бизнес-систем ", "17:00:00", "18:35:00", " Бредихин А. В. ", "213/2", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [2, "Лекционные занятия Автоматизированные робототехнические комплексы ", "9:45:00", "11:20:00", " Мануковский А. Ю. ", "202/2", 0],
                    [3, "Лекционные занятия Оптимизация в САПР ", "11:30:00", "13:05:00", " Собенина О. В. ", "210/2", 0],
                    [4, "Лабораторные занятия Автоматизированные робототехнические комплексы ", "13:30:00", "15:05:00", " Мануковский А. Ю. ", "202/2", 1],
                    [4, "Лабораторные занятия Оптимизация в САПР ", "13:30:00", "15:05:00", " Собенина О. В. ", "210/2", 2],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Груза М. С. ", "0000", 0]
                ],
                "Tuesday": [
                    [2, "Лабораторные занятия Программирование производственных систем ", "9:45:00", "11:20:00", " Ветохин В. В. ", "202/2", 0],
                    [3, "Лабораторные занятия Программирование производственных систем ", "11:30:00", "13:05:00", " Ветохин В. В. ", "202/2", 0],
                    [4, "Практические занятия Проектная деятельность ", "13:30:00", "15:05:00", " Бредихин А. В. ", "213/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Профессиональная этика ", "15:15:00", "16:50:00", " Дорохина Р. В. ", "5313", 0]
                ],
                "Wednesday": [
                    [3, "Лабораторные занятия Основы системного анализа ", "11:30:00", "13:05:00", " Пак А. А. ", "215/2", 0],
                    [4, "Лекционные занятия Основы системного анализа ", "13:30:00", "15:05:00", " Пак А. А. ", "215/2", 0],
                    [5, "Лекционные занятия Программирование производственных систем ", "15:15:00", "16:50:00", " Ветохин В. В. ", "206/2", 0],
                    [6, "Лабораторные занятия Программирование производственных систем ", "17:00:00", "18:35:00", " Ветохин В. В. ", "202/2", 1],
                    [6, "Лабораторные занятия Архитектура и инжиниринг бизнес-систем ", "17:00:00", "18:35:00", " Бредихин А. В. ", "213/2", 2]
                ],
                "Thursday": [
                    [3, "Лекционные занятия Технологическое предпринимательство ", "11:30:00", "13:05:00", " Бредихин А. В. ", "312/2", 0],
                    [4, "Лекционные занятия Архитектура и инжиниринг бизнес-систем ", "13:30:00", "15:05:00", " Бредихин А. В. ", "111/2", 0]
                ],
                "Friday": [],
                "Saturday": [
                    [1, "Лабораторные занятия Оптимизация в САПР ", "8:00:00", "9:35:00", " Собенина О. В. ", "210/2", 0],
                    [2, "Лабораторные занятия Оптимизация в САПР ", "9:45:00", "11:20:00", " Собенина О. В. ", "210/2", 0],
                    [3, "Лабораторные занятия Основы системного анализа ", "11:30:00", "13:05:00", " Пак А. А. ", "210/2", 0],
                    [4, "Лабораторные занятия Основы системного анализа ", "13:30:00", "15:05:00", " Пак А. А. ", "210/2", 0],
                    [5, "Лабораторные занятия Архитектура и инжиниринг бизнес-систем ", "15:15:00", "16:50:00", " Бредихин А. В. ", "213/2", 0],
                    [6, "Лабораторные занятия Архитектура и инжиниринг бизнес-систем ", "17:00:00", "18:35:00", " Бредихин А. В. ", "213/2", 0]
                ]
            }
        },
        "bID_211": {
            "Numerator": {
                "Monday": [
                    [3, "Лекционные занятия Web-дизайн ", "11:30:00", "13:05:00", " Суворов А. П. ", "206/2", 0],
                    [4, "Лекционные занятия Технологии сетевого дизайна и программное обеспечение ", "13:30:00", "15:05:00", " Рябинина О. А. ", "205б/2", 0],
                    [5, "Лабораторные занятия Информационные технологии в инженерных расчетах ", "15:15:00", "16:50:00", " Норман А. В. ", "205б/2", 1],
                    [5, "Лабораторные занятия Web-дизайн ", "15:15:00", "16:50:00", " Суворов А. П.  Никоноров А. В. ", "205а/2", 2],
                    [6, "Лабораторные занятия Информационные технологии в инженерных расчетах ", "17:00:00", "18:35:00", " Норман А. В. ", "205б/2", 1],
                    [6, "Лабораторные занятия Web-дизайн ", "17:00:00", "18:35:00", " Суворов А. П.  Никоноров А. В. ", "205а/2", 2],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Лапинская И. П. ", "6252", 0]
                ],
                "Tuesday": [
                    [1, "Лабораторные занятия Аддитивные технологии ", "8:00:00", "9:35:00", " Свиридов Д. А. ", "205б/2", 0],
                    [2, "Лабораторные занятия Аддитивные технологии ", "9:45:00", "11:20:00", " Свиридов Д. А. ", "205б/2", 0]
                ],
                "Wednesday": [],
                "Thursday": [
                    [3, "Лекционные занятия Аддитивные технологии ", "11:30:00", "13:05:00", " Свиридов Д. А. ", "114/2", 0],
                    [4, "Лекционные занятия Информационные технологии в инженерных расчетах ", "13:30:00", "15:05:00", " Норман А. В. ", "114/2", 0],
                    [5, "Лабораторные занятия Средства подготовки технической и эксплуатационной документации ", "15:15:00", "16:50:00", " Свиридов Д. А. ", "205б/2", 1],
                    [5, "Лабораторные занятия Информационные технологии в инженерных расчетах ", "15:15:00", "16:50:00", " Норман А. В. ", "205а/2", 2],
                    [6, "Лабораторные занятия Средства подготовки технической и эксплуатационной документации ", "17:00:00", "18:35:00", " Свиридов Д. А. ", "205б/2", 1],
                    [6, "Лабораторные занятия Информационные технологии в инженерных расчетах ", "17:00:00", "18:35:00", " Норман А. В. ", "205а/2", 2]
                ],
                "Friday": [
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Норман А. В. ", "204/2", 0],
                    [4, "Практические занятия Проектная деятельность ", "13:30:00", "15:05:00", " Норман А. В. ", "204/2", 0],
                    [5, "Лабораторные занятия Компьютерная обработка изображений ", "15:15:00", "16:50:00", " Суворов А. П.  Никоноров А. В. ", "205а/2", 1],
                    [5, "Лабораторные занятия Средства подготовки технической и эксплуатационной документации ", "15:15:00", "16:50:00", " Свиридов Д. А. ", "205б/2", 2],
                    [6, "Лабораторные занятия Компьютерная обработка изображений ", "17:00:00", "18:35:00", " Суворов А. П.  Никоноров А. В. ", "205а/2", 1],
                    [6, "Лабораторные занятия Средства подготовки технической и эксплуатационной документации ", "17:00:00", "18:35:00", " Свиридов Д. А. ", "205б/2", 2]
                ],
                "Saturday": [
                    [3, "Лабораторные занятия Инструментальные средства визуальной коммуникации и прикладной дизайн ", "11:30:00", "13:05:00", " Суворов А. П. ", "205б/2", 0],
                    [4, "Лекционные занятия Инструментальные средства визуальной коммуникации и прикладной дизайн ", "13:30:00", "15:05:00", " Суворов А. П. ", "206/2", 0],
                    [5, "Лекционные занятия Компьютерная обработка изображений ", "15:15:00", "16:50:00", " Суворов А. П. ", "206/2", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [2, "Лекционные занятия Web-дизайн ", "9:45:00", "11:20:00", " Суворов А. П. ", "206/2", 0],
                    [3, "Лекционные занятия Технологии сетевого дизайна и программное обеспечение ", "11:30:00", "13:05:00", " Рябинина О. А. ", "206/2", 0],
                    [4, "Лабораторные занятия Web-дизайн ", "13:30:00", "15:05:00", " Суворов А. П.  Никоноров А. В. ", "205а/2", 0],
                    [5, "Лабораторные занятия Web-дизайн ", "15:15:00", "16:50:00", " Суворов А. П.  Никоноров А. В. ", "205а/2", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Лапинская И. П. ", "6252", 0]
                ],
                "Tuesday": [],
                "Wednesday": [],
                "Thursday": [
                    [3, "Лекционные занятия Аддитивные технологии ", "11:30:00", "13:05:00", " Свиридов Д. А. ", "114/2", 0],
                    [4, "Лекционные занятия Информационные технологии в инженерных расчетах ", "13:30:00", "15:05:00", " Норман А. В. ", "114/2", 0],
                    [5, "Лабораторные занятия Аддитивные технологии ", "15:15:00", "16:50:00", " Свиридов Д. А. ", "205б/2", 0],
                    [6, "Лабораторные занятия Аддитивные технологии ", "17:00:00", "18:35:00", " Свиридов Д. А. ", "205б/2", 0]
                ],
                "Friday": [
                    [3, "Лабораторные занятия Технологии сетевого дизайна и программное обеспечение ", "11:30:00", "13:05:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 0],
                    [4, "Лабораторные занятия Технологии сетевого дизайна и программное обеспечение ", "13:30:00", "15:05:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 0],
                    [5, "Лабораторные занятия Технологии сетевого дизайна и программное обеспечение ", "15:15:00", "16:50:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 1],
                    [5, "Лабораторные занятия Компьютерная обработка изображений ", "15:15:00", "16:50:00", " Суворов А. П.  Никоноров А. В. ", "205б/2", 2],
                    [6, "Лабораторные занятия Технологии сетевого дизайна и программное обеспечение ", "17:00:00", "18:35:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 1],
                    [6, "Лабораторные занятия Компьютерная обработка изображений ", "17:00:00", "18:35:00", " Суворов А. П.  Никоноров А. В. ", "205б/2", 2]
                ],
                "Saturday": [
                    [3, "Лабораторные занятия Инструментальные средства визуальной коммуникации и прикладной дизайн ", "11:30:00", "13:05:00", " Суворов А. П. ", "205б/2", 0],
                    [4, "Лекционные занятия Компьютерная обработка изображений ", "13:30:00", "15:05:00", " Суворов А. П. ", "206/2", 0],
                    [5, "Лекционные занятия Средства подготовки технической и эксплуатационной документации ", "15:15:00", "16:50:00", " Свиридов Д. А. ", "206/2", 0]
                ]
            }
        },
        "bID_221": {
            "Numerator": {
                "Monday": [
                    [2, "Лабораторные занятия Научные основы геометрии и графики ", "9:45:00", "11:20:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 0],
                    [3, "Лабораторные занятия Научные основы геометрии и графики ", "11:30:00", "13:05:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 0],
                    [4, "Лекционные занятия Научные основы геометрии и графики ", "13:30:00", "15:05:00", " Золототрубова Ю. С. ", "310/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Абиев З. А. ", "0000", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Абиев З. А. ", "0000", 0]
                ],
                "Tuesday": [
                    [2, "Практические занятия Проектная деятельность ", "9:45:00", "11:20:00", " Норман А. В. ", "206/2", 0],
                    [3, "Практические занятия Профессиональная этика ", "11:30:00", "13:05:00", " Коваль Л. В. ", "307/2", 1],
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Норман А. В. ", "204/2", 2],
                    [4, "Лекционные занятия Композиция ", "13:30:00", "15:05:00", " Семыкин В. Н. ", "114/2", 0],
                    [5, "Лабораторные занятия Дизайн промышленных изделий и конструкций ", "15:15:00", "16:50:00", " Кузовкин А. В.  Семыкин В. Н. ", "205а/2", 0],
                    [6, "Лабораторные занятия Дизайн промышленных изделий и конструкций ", "17:00:00", "18:35:00", " Кузовкин А. В.  Семыкин В. Н. ", "205а/2", 0]
                ],
                "Wednesday": [
                    [1, "Лабораторные занятия Композиция ", "8:00:00", "9:35:00", " Семыкин В. Н. ", "205а/2", 0],
                    [2, "Лабораторные занятия Композиция ", "9:45:00", "11:20:00", " Семыкин В. Н. ", "205а/2", 0],
                    [3, "Лабораторные занятия Создание графических образов ", "11:30:00", "13:05:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 0],
                    [4, "Лабораторные занятия Создание графических образов ", "13:30:00", "15:05:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 0],
                    [5, "Практические занятия Профессиональная этика ", "15:15:00", "16:50:00", " Коваль Л. В. ", "116/2", 0]
                ],
                "Thursday": [
                    [3, "Лекционные занятия Технологическое предпринимательство ", "11:30:00", "13:05:00", " Наролина Т. С. ", "310/2", 0],
                    [4, "Лекционные занятия Дизайн промышленных изделий и конструкций ", "13:30:00", "15:05:00", " Кузовкин А. В. ", "301/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Абиев З. А. ", "0000", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Абиев З. А. ", "0000", 0]
                ],
                "Friday": [],
                "Saturday": [
                    [1, "Лабораторные занятия Дизайн в промышленности ", "8:00:00", "9:35:00", " Рябинина О. А. ", "205а/2", 1],
                    [1, "Лабораторные занятия Научные основы геометрии и графики ", "8:00:00", "9:35:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 2],
                    [2, "Лабораторные занятия Дизайн в промышленности ", "9:45:00", "11:20:00", " Рябинина О. А. ", "205а/2", 1],
                    [2, "Лабораторные занятия Научные основы геометрии и графики ", "9:45:00", "11:20:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 2],
                    [3, "Лекционные занятия Дизайн в промышленности ", "11:30:00", "13:05:00", " Рябинина О. А. ", "310/2", 0],
                    [4, "Лабораторные занятия Создание графических образов ", "13:30:00", "15:05:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 0],
                    [5, "Лабораторные занятия Создание графических образов ", "15:15:00", "16:50:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Вохминцева А. В. ", "6258", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Вохминцева А. В. ", "6258", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [2, "Лабораторные занятия Композиция ", "9:45:00", "11:20:00", " Семыкин В. Н. ", "205б/2", 0],
                    [3, "Лабораторные занятия Композиция ", "11:30:00", "13:05:00", " Семыкин В. Н. ", "205б/2", 0],
                    [4, "Лекционные занятия Научные основы геометрии и графики ", "13:30:00", "15:05:00", " Золототрубова Ю. С. ", "204/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Абиев З. А. ", "0000", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Абиев З. А. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Лекционные занятия Профессиональная этика ", "17:00:00", "18:35:00", " Коваль Л. В. ", "3117", 0]
                ],
                "Tuesday": [
                    [2, "Практические занятия Проектная деятельность ", "9:45:00", "11:20:00", " Норман А. В. ", "303/2", 0],
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Норман А. В. ", "204/2", 1],
                    [3, "Практические занятия Технологическое предпринимательство ", "11:30:00", "13:05:00", " Наролина Т. С. ", "301/2", 2],
                    [4, "Лекционные занятия Композиция ", "13:30:00", "15:05:00", " Семыкин В. Н. ", "114/2", 0],
                    [5, "Лабораторные занятия Композиция ", "15:15:00", "16:50:00", " Семыкин В. Н. ", "205а/2", 0],
                    [6, "Лабораторные занятия Композиция ", "17:00:00", "18:35:00", " Семыкин В. Н. ", "205а/2", 0]
                ],
                "Wednesday": [
                    [1, "Лабораторные занятия Дизайн промышленных изделий и конструкций ", "8:00:00", "9:35:00", " Кузовкин А. В.  Семыкин В. Н. ", "205б/2", 0],
                    [2, "Лабораторные занятия Дизайн промышленных изделий и конструкций ", "9:45:00", "11:20:00", " Кузовкин А. В.  Семыкин В. Н. ", "205б/2", 0],
                    [3, "Лабораторные занятия Дизайн промышленных изделий и конструкций ", "11:30:00", "13:05:00", " Кузовкин А. В.  Семыкин В. Н. ", "205б/2", 1],
                    [3, "Лабораторные занятия Дизайн в промышленности ", "11:30:00", "13:05:00", " Рябинина О. А. ", "205а/2", 2],
                    [4, "Лабораторные занятия Дизайн промышленных изделий и конструкций ", "13:30:00", "15:05:00", " Кузовкин А. В.  Семыкин В. Н. ", "205б/2", 1],
                    [4, "Лабораторные занятия Дизайн в промышленности ", "13:30:00", "15:05:00", " Рябинина О. А. ", "205а/2", 2],
                    [5, "Практические занятия Технологическое предпринимательство ", "15:15:00", "16:50:00", " Наролина Т. С. ", "116/2", 1],
                    [5, "Практические занятия Профессиональная этика ", "15:15:00", "16:50:00", " Коваль Л. В. ", "307/2", 2],
                    [6, "Практические занятия Профессиональная этика ", "17:00:00", "18:35:00", " Коваль Л. В. ", "307/2", 0]
                ],
                "Thursday": [
                    [3, "Лекционные занятия Создание графических образов ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "310/2", 0],
                    [4, "Лекционные занятия Дизайн промышленных изделий и конструкций ", "13:30:00", "15:05:00", " Кузовкин А. В. ", "301/2", 0]
                ],
                "Friday": [],
                "Saturday": [
                    [1, "Лабораторные занятия Дизайн в промышленности ", "8:00:00", "9:35:00", " Рябинина О. А. ", "205а/2", 1],
                    [1, "Лабораторные занятия Научные основы геометрии и графики ", "8:00:00", "9:35:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 2],
                    [2, "Лабораторные занятия Дизайн в промышленности ", "9:45:00", "11:20:00", " Рябинина О. А. ", "205а/2", 1],
                    [2, "Лабораторные занятия Научные основы геометрии и графики ", "9:45:00", "11:20:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 2],
                    [3, "Лекционные занятия Дизайн в промышленности ", "11:30:00", "13:05:00", " Рябинина О. А. ", "310/2", 0],
                    [4, "Лабораторные занятия Создание графических образов ", "13:30:00", "15:05:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 0],
                    [5, "Лабораторные занятия Создание графических образов ", "15:15:00", "16:50:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Вохминцева А. В. ", "6258", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Вохминцева А. В. ", "6258", 0]
                ]
            }
        },
        "bIST_231": {
            "Numerator": {
                "Monday": [
                    [1, "Лекционные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Суворов А. П. ", "312/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Иванов Д. В. ", "312/2", 0],
                    [3, "с 12:00 -до 13:35  Лабораторные занятия Информатика ", "11:30:00", "13:05:00", " Ефимова О. Е. ", "1407", 0]
                ],
                "Tuesday": [
                    [2, "Лабораторные занятия Базы данных ", "9:45:00", "11:20:00", " Иванов Д. В. ", "405/2", 0],
                    [3, "Лабораторные занятия Архитектура информационных систем ", "11:30:00", "13:05:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 0],
                    [4, "Лабораторные занятия Архитектура информационных систем ", "13:30:00", "15:05:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 0]
                ],
                "Wednesday": [
                    [3, "Лекционные занятия Математика ", "11:30:00", "13:05:00", " Надеина Т. А. ", "311/2", 0],
                    [4, "с 14:20 -до 15:55  Лекционные занятия Информатика ", "13:30:00", "15:05:00", " Ефимова О. Е. ", "3117", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Туманцев К. В. ", "0000", 0]
                ],
                "Thursday": [],
                "Friday": [
                    [1, "Лабораторные занятия Программирование на платформе .NET Framework ", "8:00:00", "9:35:00", " Воробьев Э. И. ", "403/2", 1],
                    [1, "Лабораторные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 2],
                    [2, "Лабораторные занятия Программирование на платформе .NET Framework ", "9:45:00", "11:20:00", " Воробьев Э. И. ", "403/2", 1],
                    [2, "Лабораторные занятия Архитектура информационных систем ", "9:45:00", "11:20:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 2],
                    [3, "Лабораторные занятия Программирование на платформе .NET Framework ", "11:30:00", "13:05:00", " Воробьев Э. И. ", "403/2", 0]
                ],
                "Saturday": [
                    [2, "Практические занятия Математика ", "9:45:00", "11:20:00", " Катрахова А. А. ", "114/2", 0],
                    [3, "Лекционные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "311/2", 0],
                    [4, "Лекционные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Иванов Д. В. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Туманцев К. В. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [1, "Лекционные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Суворов А. П. ", "312/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Иванов Д. В. ", "312/2", 0],
                    [3, "Лабораторные занятия Базы данных ", "11:30:00", "13:05:00", " Иванов Д. В. ", "405/2", 0],
                    [4, "с 14:20 -до 15:55  Лабораторные занятия Информатика ", "13:30:00", "15:05:00", " Ефимова О. Е. ", "1407", 0]
                ],
                "Tuesday": [
                    [1, "Практические занятия Философия ", "8:00:00", "9:35:00", " Назаренко К. С. ", "301/2", 0],
                    [2, "Практические занятия Экономика ", "9:45:00", "11:20:00", " Наролина Т. С. ", "206/2", 0]
                ],
                "Wednesday": [
                    [3, "Лекционные занятия Философия ", "11:30:00", "13:05:00", " Назаренко К. С. ", "311/2", 0],
                    [4, "Лекционные занятия Экономика ", "13:30:00", "15:05:00", " Наролина Т. С. ", "312/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Туманцев К. В. ", "0000", 0]
                ],
                "Thursday": [],
                "Friday": [
                    [1, "Лабораторные занятия Компьютерная геометрия и графика ", "8:00:00", "9:35:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 1],
                    [1, "Лабораторные занятия Программирование на платформе .NET Framework ", "8:00:00", "9:35:00", " Воробьев Э. И. ", "403/2", 2],
                    [2, "Лабораторные занятия Компьютерная геометрия и графика ", "9:45:00", "11:20:00", " Семыкин В. Н.  Золототрубова Ю. С. ", "205б/2", 1],
                    [2, "Лабораторные занятия Программирование на платформе .NET Framework ", "9:45:00", "11:20:00", " Воробьев Э. И. ", "403/2", 2],
                    [3, "Лабораторные занятия Программирование на платформе .NET Framework ", "11:30:00", "13:05:00", " Воробьев Э. И. ", "403/2", 1],
                    [3, "Лабораторные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С.  Семыкин В. Н. ", "205б/2", 2],
                    [4, "Лабораторные занятия Компьютерная геометрия и графика ", "13:30:00", "15:05:00", " Золототрубова Ю. С.  Семыкин В. Н. ", "205б/2", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ],
                "Saturday": [
                    [2, "Практические занятия Математика ", "9:45:00", "11:20:00", " Катрахова А. А. ", "114/2", 0],
                    [3, "Лекционные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "311/2", 0],
                    [4, "Лекционные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Иванов Д. В. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Туманцев К. В. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            }
        },
        "bIST_232": {
            "Numerator": {
                "Monday": [
                    [1, "Лекционные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Суворов А. П. ", "312/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Иванов Д. В. ", "312/2", 0],
                    [3, "Лабораторные занятия Программирование на платформе .NET Framework ", "11:30:00", "13:05:00", " Воробьев Э. И. ", "403/2", 1],
                    [3, "Лабораторные занятия Базы данных ", "11:30:00", "13:05:00", " Иванов Д. В. ", "405/2", 2],
                    [4, "Лабораторные занятия Базы данных ", "13:30:00", "15:05:00", " Иванов Д. В. ", "405/2", 1],
                    [4, "с 14:20 -до 15:55  Лабораторные занятия Информатика ", "13:30:00", "15:05:00", " Ефимова О. Е. ", "1407", 2]
                ],
                "Tuesday": [],
                "Wednesday": [
                    [2, "Практические занятия Математика ", "9:45:00", "11:20:00", " Трегубова Т. В. ", "206/2", 0],
                    [3, "Лекционные занятия Математика ", "11:30:00", "13:05:00", " Надеина Т. А. ", "311/2", 0],
                    [4, "с 14:20 -до 15:55  Лекционные занятия Информатика ", "13:30:00", "15:05:00", " Ефимова О. Е. ", "3117", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Абиев З. А. ", "0000", 0]
                ],
                "Thursday": [
                    [1, "Лабораторные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 0],
                    [2, "Лабораторные занятия Архитектура информационных систем ", "9:45:00", "11:20:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 0],
                    [3, "Лабораторные занятия Программирование на платформе .NET Framework ", "11:30:00", "13:05:00", " Воробьев Э. И. ", "403/2", 0],
                    [4, "Лабораторные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Воробьев Э. И. ", "403/2", 0]
                ],
                "Friday": [
                    [1, "Лабораторные занятия Компьютерная геометрия и графика ", "8:00:00", "9:35:00", " Золототрубова Ю. С. ", "205б/2", 0],
                    [2, "Лабораторные занятия Компьютерная геометрия и графика ", "9:45:00", "11:20:00", " Золототрубова Ю. С. ", "205б/2", 0],
                    [3, "Лабораторные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "205б/2", 0],
                    [4, "Лабораторные занятия Компьютерная геометрия и графика ", "13:30:00", "15:05:00", " Золототрубова Ю. С. ", "205б/2", 0]
                ],
                "Saturday": [
                    [3, "Лекционные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "311/2", 0],
                    [4, "Лекционные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Иванов Д. В. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Абиев З. А. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [1, "Лекционные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Суворов А. П. ", "312/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Иванов Д. В. ", "312/2", 0],
                    [3, "с 12:00 -до 13:35  Лабораторные занятия Информатика ", "11:30:00", "13:05:00", " Ефимова О. Е. ", "1407", 1],
                    [3, "Лабораторные занятия Программирование на платформе .NET Framework ", "11:30:00", "13:05:00", " Воробьев Э. И. ", "403/2", 2]
                ],
                "Tuesday": [
                    [1, "Практические занятия Экономика ", "8:00:00", "9:35:00", " Наролина Т. С. ", "206/2", 0],
                    [2, "Практические занятия Философия ", "9:45:00", "11:20:00", " Назаренко К. С. ", "301/2", 0]
                ],
                "Wednesday": [
                    [2, "Практические занятия Математика ", "9:45:00", "11:20:00", " Трегубова Т. В. ", "206/2", 0],
                    [3, "Лекционные занятия Философия ", "11:30:00", "13:05:00", " Назаренко К. С. ", "311/2", 0],
                    [4, "Лекционные занятия Экономика ", "13:30:00", "15:05:00", " Наролина Т. С. ", "312/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Абиев З. А. ", "0000", 0]
                ],
                "Thursday": [
                    [3, "Лабораторные занятия Программирование на платформе .NET Framework ", "11:30:00", "13:05:00", " Воробьев Э. И. ", "403/2", 0],
                    [4, "Лабораторные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Воробьев Э. И. ", "403/2", 0],
                    [5, "Лабораторные занятия Архитектура информационных систем ", "15:15:00", "16:50:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 0],
                    [6, "Лабораторные занятия Архитектура информационных систем ", "17:00:00", "18:35:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 0]
                ],
                "Friday": [
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ],
                "Saturday": [
                    [3, "Лекционные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "311/2", 0],
                    [4, "Лекционные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Иванов Д. В. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Абиев З. А. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            }
        },
        "bIST_233": {
            "Numerator": {
                "Monday": [
                    [1, "Лекционные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Суворов А. П. ", "312/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Иванов Д. В. ", "312/2", 0]
                ],
                "Tuesday": [
                    [3, "Лабораторные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "205б/2", 0],
                    [4, "Лабораторные занятия Компьютерная геометрия и графика ", "13:30:00", "15:05:00", " Золототрубова Ю. С. ", "205б/2", 1],
                    [4, "Лабораторные занятия Базы данных ", "13:30:00", "15:05:00", " Иванов Д. В. ", "405/2", 2],
                    [5, "с 16:05 -до 17:40  Лабораторные занятия Информатика ", "15:15:00", "16:50:00", " Ефимова О. Е. ", "1407", 1],
                    [5, "Лабораторные занятия Программирование на платформе .NET Framework ", "15:15:00", "16:50:00", " Воробьев Э. И. ", "403/2", 2],
                    [5, "Лабораторные занятия Базы данных ", "15:15:00", "16:50:00", " Иванов Д. В. ", "405/2", 3],
                    [6, "с 17:50 -до 19:25  Лабораторные занятия Информатика ", "17:00:00", "18:35:00", " Ефимова О. Е. ", "1407", 0]
                ],
                "Wednesday": [
                    [3, "Лекционные занятия Математика ", "11:30:00", "13:05:00", " Надеина Т. А. ", "311/2", 0],
                    [4, "с 14:20 -до 15:55  Лекционные занятия Информатика ", "13:30:00", "15:05:00", " Ефимова О. Е. ", "3117", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Мужаровская М. Н. ", "0000", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Мужаровская М. Н. ", "0000", 0]
                ],
                "Thursday": [
                    [1, "Лабораторные занятия Программирование на платформе .NET Framework ", "8:00:00", "9:35:00", " Воробьев Э. И. ", "403/2", 1],
                    [1, "Лабораторные занятия Компьютерная геометрия и графика ", "8:00:00", "9:35:00", " Золототрубова Ю. С. ", "205б/2", 2],
                    [2, "Лабораторные занятия Программирование на платформе .NET Framework ", "9:45:00", "11:20:00", " Воробьев Э. И. ", "403/2", 1],
                    [2, "Лабораторные занятия Компьютерная геометрия и графика ", "9:45:00", "11:20:00", " Золототрубова Ю. С. ", "205б/2", 2]
                ],
                "Friday": [
                    [3, "Лабораторные занятия Архитектура информационных систем ", "11:30:00", "13:05:00", " Рябинина О. А. ", "205а/2", 0],
                    [4, "Лабораторные занятия Архитектура информационных систем ", "13:30:00", "15:05:00", " Рябинина О. А. ", "205а/2", 0],
                    [5, "Практические занятия Экономика ", "15:15:00", "16:50:00", " Наролина Т. С. ", "307/2", 1],
                    [5, "Практические занятия Математика ", "15:15:00", "16:50:00", " Трегубова Т. В. ", "110/2", 2],
                    [6, "Практические занятия Математика ", "17:00:00", "18:35:00", " Трегубова Т. В. ", "110/2", 1],
                    [6, "Практические занятия Экономика ", "17:00:00", "18:35:00", " Наролина Т. С. ", "307/2", 2]
                ],
                "Saturday": [
                    [3, "Лекционные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "311/2", 0],
                    [4, "Лекционные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Иванов Д. В. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Мужаровская М. Н. ", "0000", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Мужаровская М. Н. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [1, "Лекционные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Суворов А. П. ", "312/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Иванов Д. В. ", "312/2", 0]
                ],
                "Tuesday": [
                    [2, "Лабораторные занятия Базы данных ", "9:45:00", "11:20:00", " Иванов Д. В. ", "405/2", 0],
                    [3, "Лабораторные занятия Архитектура информационных систем ", "11:30:00", "13:05:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 1],
                    [3, "Лабораторные занятия Программирование на платформе .NET Framework ", "11:30:00", "13:05:00", " Воробьев Э. И. ", "403/2", 2],
                    [4, "Лабораторные занятия Архитектура информационных систем ", "13:30:00", "15:05:00", " Рябинина О. А.  Левин Д. Ю. ", "205а/2", 1],
                    [4, "Лабораторные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Воробьев Э. И. ", "403/2", 2],
                    [4, "Лабораторные занятия Компьютерная геометрия и графика ", "13:30:00", "15:05:00", " Золототрубова Ю. С. ", "205б/2", 3],
                    [5, "Лабораторные занятия Программирование на платформе .NET Framework ", "15:15:00", "16:50:00", " Воробьев Э. И. ", "403/2", 1],
                    [5, "с 16:05 -до 17:40  Лабораторные занятия Информатика ", "15:15:00", "16:50:00", " Ефимова О. Е. ", "1407", 2],
                    [5, "Лабораторные занятия Компьютерная геометрия и графика ", "15:15:00", "16:50:00", " Золототрубова Ю. С. ", "205б/2", 3],
                    [6, "Лабораторные занятия Программирование на платформе .NET Framework ", "17:00:00", "18:35:00", " Воробьев Э. И. ", "403/2", 0]
                ],
                "Wednesday": [
                    [3, "Лекционные занятия Философия ", "11:30:00", "13:05:00", " Назаренко К. С. ", "311/2", 0],
                    [4, "Лекционные занятия Экономика ", "13:30:00", "15:05:00", " Наролина Т. С. ", "312/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Мужаровская М. Н. ", "0000", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Мужаровская М. Н. ", "0000", 0]
                ],
                "Thursday": [
                    [1, "Лабораторные занятия Программирование на платформе .NET Framework ", "8:00:00", "9:35:00", " Воробьев Э. И. ", "403/2", 0],
                    [2, "Лабораторные занятия Программирование на платформе .NET Framework ", "9:45:00", "11:20:00", " Воробьев Э. И. ", "403/2", 0],
                    [3, "Лабораторные занятия Архитектура информационных систем ", "11:30:00", "13:05:00", " Рябинина О. А. ", "205б/2", 0],
                    [4, "Лабораторные занятия Архитектура информационных систем ", "13:30:00", "15:05:00", " Рябинина О. А. ", "205б/2", 0]
                ],
                "Friday": [
                    [4, "Практические занятия Математика ", "13:30:00", "15:05:00", " Трегубова Т. В. ", "110/2", 1],
                    [4, "Практические занятия Философия ", "13:30:00", "15:05:00", " Назаренко К. С. ", "206/2", 2],
                    [5, "Практические занятия Философия ", "15:15:00", "16:50:00", " Назаренко К. С. ", "307/2", 1],
                    [5, "Практические занятия Математика ", "15:15:00", "16:50:00", " Трегубова Т. В. ", "110/2", 2],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ],
                "Saturday": [
                    [3, "Лекционные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "311/2", 0],
                    [4, "Лекционные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Иванов Д. В. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Мужаровская М. Н. ", "0000", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Мужаровская М. Н. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            }
        },
        "bIST_234": {
            "Numerator": {
                "Monday": [
                    [1, "Лекционные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Суворов А. П. ", "312/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Иванов Д. В. ", "312/2", 0],
                    [3, "Практические занятия Математика ", "11:30:00", "13:05:00", " Трегубова Т. В. ", "221/1", 0]
                ],
                "Tuesday": [
                    [1, "Лабораторные занятия Базы данных ", "8:00:00", "9:35:00", " Иванов Д. В. ", "405/2", 1],
                    [1, "Лабораторные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Рябинина О. А. ", "205а/2", 2],
                    [2, "Лабораторные занятия Программирование на платформе .NET Framework ", "9:45:00", "11:20:00", " Тишуков Б. Н. ", "403/2", 1],
                    [2, "Лабораторные занятия Архитектура информационных систем ", "9:45:00", "11:20:00", " Рябинина О. А. ", "205а/2", 2],
                    [3, "с 12:00 -до 13:35  Лабораторные занятия Информатика ", "11:30:00", "13:05:00", " Ефимова О. Е. ", "1407", 1],
                    [3, "Лабораторные занятия Базы данных ", "11:30:00", "13:05:00", " Иванов Д. В. ", "405/2", 2]
                ],
                "Wednesday": [
                    [3, "Лекционные занятия Математика ", "11:30:00", "13:05:00", " Надеина Т. А. ", "311/2", 0],
                    [4, "с 14:20 -до 15:55  Лекционные занятия Информатика ", "13:30:00", "15:05:00", " Ефимова О. Е. ", "3117", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Лукин А. А. ", "0000", 0]
                ],
                "Thursday": [
                    [1, "Лабораторные занятия Программирование на платформе .NET Framework ", "8:00:00", "9:35:00", " Тишуков Б. Н. ", "405/2", 0],
                    [2, "Лабораторные занятия Программирование на платформе .NET Framework ", "9:45:00", "11:20:00", " Тишуков Б. Н. ", "405/2", 0],
                    [3, "Лабораторные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "205б/2", 0],
                    [4, "Лабораторные занятия Компьютерная геометрия и графика ", "13:30:00", "15:05:00", " Золототрубова Ю. С. ", "205б/2", 0]
                ],
                "Friday": [],
                "Saturday": [
                    [3, "Лекционные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "311/2", 0],
                    [4, "Лекционные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Иванов Д. В. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Лукин А. А. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [1, "Лекционные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Суворов А. П. ", "312/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Иванов Д. В. ", "312/2", 0]
                ],
                "Tuesday": [
                    [1, "Лабораторные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Рябинина О. А. ", "205а/2", 0],
                    [2, "Лабораторные занятия Архитектура информационных систем ", "9:45:00", "11:20:00", " Рябинина О. А. ", "205а/2", 1],
                    [2, "Лабораторные занятия Программирование на платформе .NET Framework ", "9:45:00", "11:20:00", " Тишуков Б. Н. ", "403/2", 2],
                    [3, "с 12:00 -до 13:35  Лабораторные занятия Информатика ", "11:30:00", "13:05:00", " Ефимова О. Е. ", "1407", 0]
                ],
                "Wednesday": [
                    [3, "Лекционные занятия Философия ", "11:30:00", "13:05:00", " Назаренко К. С. ", "311/2", 0],
                    [4, "с 14:20 -до 15:55  Лекционные занятия Экономика ", "13:30:00", "15:05:00", " Попов В. Г. ", "2247", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Лукин А. А. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Экономика ", "17:00:00", "18:35:00", " Попов В. Г. ", "2212", 0]
                ],
                "Thursday": [
                    [1, "Лабораторные занятия Программирование на платформе .NET Framework ", "8:00:00", "9:35:00", " Тишуков Б. Н. ", "405/2", 1],
                    [1, "Лабораторные занятия Компьютерная геометрия и графика ", "8:00:00", "9:35:00", " Золототрубова Ю. С. ", "205б/2", 2],
                    [2, "Лабораторные занятия Программирование на платформе .NET Framework ", "9:45:00", "11:20:00", " Тишуков Б. Н. ", "405/2", 1],
                    [2, "Лабораторные занятия Компьютерная геометрия и графика ", "9:45:00", "11:20:00", " Золототрубова Ю. С. ", "205б/2", 2],
                    [3, "Практические занятия Философия ", "11:30:00", "13:05:00", " Назаренко К. С. ", "218/1", 0],
                    [4, "Практические занятия Математика ", "13:30:00", "15:05:00", " Трегубова Т. В. ", "323/1", 0]
                ],
                "Friday": [
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ],
                "Saturday": [
                    [3, "Лекционные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "311/2", 0],
                    [4, "Лекционные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Иванов Д. В. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Лукин А. А. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            }
        },
        "bIST_235": {
            "Numerator": {
                "Monday": [
                    [1, "Лекционные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Суворов А. П. ", "312/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Иванов Д. В. ", "312/2", 0]
                ],
                "Tuesday": [
                    [3, "Лабораторные занятия Программирование на платформе .NET Framework ", "11:30:00", "13:05:00", " Тишуков Б. Н. ", "403/2", 0],
                    [4, "с 14:20 -до 15:55  Лабораторные занятия Информатика ", "13:30:00", "15:05:00", " Ефимова О. Е. ", "1407", 1],
                    [4, "Лабораторные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Тишуков Б. Н. ", "403/2", 2],
                    [5, "Лабораторные занятия Компьютерная геометрия и графика ", "15:15:00", "16:50:00", " Золототрубова Ю. С. ", "205б/2", 0],
                    [6, "Лабораторные занятия Компьютерная геометрия и графика ", "17:00:00", "18:35:00", " Золототрубова Ю. С. ", "205б/2", 0]
                ],
                "Wednesday": [
                    [3, "Лекционные занятия Математика ", "11:30:00", "13:05:00", " Надеина Т. А. ", "311/2", 0],
                    [4, "с 14:20 -до 15:55  Лекционные занятия Информатика ", "13:30:00", "15:05:00", " Ефимова О. Е. ", "3117", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Кутузова И. А. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Экономика ", "17:00:00", "18:35:00", " Попов В. Г. ", "2212", 0]
                ],
                "Thursday": [
                    [2, "Практические занятия Математика ", "9:45:00", "11:20:00", " Катрахова А. А. ", "114/2", 0],
                    [3, "Лабораторные занятия Архитектура информационных систем ", "11:30:00", "13:05:00", " Рябинина О. А. ", "205а/2", 1],
                    [3, "Лабораторные занятия Программирование на платформе .NET Framework ", "11:30:00", "13:05:00", " Тишуков Б. Н. ", "405/2", 2],
                    [4, "Лабораторные занятия Архитектура информационных систем ", "13:30:00", "15:05:00", " Рябинина О. А. ", "205а/2", 1],
                    [4, "Лабораторные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Тишуков Б. Н. ", "405/2", 2]
                ],
                "Friday": [],
                "Saturday": [
                    [3, "Лекционные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "311/2", 0],
                    [4, "Лекционные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Иванов Д. В. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Кутузова И. А. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [1, "Лекционные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Суворов А. П. ", "312/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Иванов Д. В. ", "312/2", 0]
                ],
                "Tuesday": [
                    [1, "Лабораторные занятия Базы данных ", "8:00:00", "9:35:00", " Иванов Д. В. ", "405/2", 0],
                    [2, "Лабораторные занятия Компьютерная геометрия и графика ", "9:45:00", "11:20:00", " Золототрубова Ю. С. ", "205б/2", 0],
                    [3, "Лабораторные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "205б/2", 1],
                    [3, "Лабораторные занятия Базы данных ", "11:30:00", "13:05:00", " Иванов Д. В. ", "405/2", 2],
                    [4, "с 14:20 -до 15:55  Лабораторные занятия Информатика ", "13:30:00", "15:05:00", " Ефимова О. Е. ", "1407", 0]
                ],
                "Wednesday": [
                    [2, "Практические занятия Философия ", "9:45:00", "11:20:00", " Назаренко К. С. ", "301/2", 0],
                    [3, "Лекционные занятия Философия ", "11:30:00", "13:05:00", " Назаренко К. С. ", "311/2", 0],
                    [4, "с 14:20 -до 15:55  Лекционные занятия Экономика ", "13:30:00", "15:05:00", " Попов В. Г. ", "2247", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Кутузова И. А. ", "0000", 0]
                ],
                "Thursday": [
                    [2, "Практические занятия Математика ", "9:45:00", "11:20:00", " Катрахова А. А. ", "114/2", 0],
                    [3, "Лабораторные занятия Программирование на платформе .NET Framework ", "11:30:00", "13:05:00", " Тишуков Б. Н. ", "405/2", 0],
                    [4, "Лабораторные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Тишуков Б. Н. ", "405/2", 0]
                ],
                "Friday": [
                    [1, "Лабораторные занятия Архитектура информационных систем ", "8:00:00", "9:35:00", " Рябинина О. А. ", "205а/2", 0],
                    [2, "Лабораторные занятия Архитектура информационных систем ", "9:45:00", "11:20:00", " Рябинина О. А. ", "205а/2", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ],
                "Saturday": [
                    [3, "Лекционные занятия Компьютерная геометрия и графика ", "11:30:00", "13:05:00", " Золототрубова Ю. С. ", "311/2", 0],
                    [4, "Лекционные занятия Программирование на платформе .NET Framework ", "13:30:00", "15:05:00", " Иванов Д. В. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Кутузова И. А. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            }
        },
        "bITS_211": {
            "Numerator": {
                "Monday": [
                    [5, "с 16:05 -до 17:40  Лекционные занятия Системы искусственного интеллекта ", "15:15:00", "16:50:00", " Гусев П. Ю. ", "2245", 0],
                    [6, "с 17:50 -до 19:25  Лекционные занятия Конфигурирование в системе 1С: ", "17:00:00", "18:35:00", " Коржова М. Е. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Лапинская И. П. ", "6252", 0]
                ],
                "Tuesday": [
                    [5, "Лабораторные занятия Информационная безопасность и защита информации ", "15:15:00", "16:50:00", " Питолин А. В. ", "409/2", 0],
                    [6, "Лабораторные занятия Информационная безопасность и защита информации ", "17:00:00", "18:35:00", " Питолин А. В. ", "409/2", 0]
                ],
                "Wednesday": [],
                "Thursday": [
                    [2, "Лабораторные занятия Управление проектами ", "9:45:00", "11:20:00", " Питолин А. В. ", "409/2", 1],
                    [2, "Лабораторные занятия Управление данными в организации ", "9:45:00", "11:20:00", " Кострова В. Н. ", "406/2", 2],
                    [3, "Лабораторные занятия Управление проектами ", "11:30:00", "13:05:00", " Питолин А. В. ", "409/2", 1],
                    [3, "Лабораторные занятия Управление данными в организации ", "11:30:00", "13:05:00", " Кострова В. Н. ", "406/2", 2],
                    [4, "Лабораторные занятия Технологии обработки больших данных ", "13:30:00", "15:05:00", " Белецкая С. Ю. ", "406/2", 0],
                    [5, "Лабораторные занятия Технологии обработки больших данных ", "15:15:00", "16:50:00", " Белецкая С. Ю. ", "406/2", 0]
                ],
                "Friday": [
                    [3, "Лекционные занятия Управление проектами ", "11:30:00", "13:05:00", " Питолин А. В. ", "409/2", 0],
                    [4, "Лекционные занятия Информационная безопасность и защита информации ", "13:30:00", "15:05:00", " Питолин А. В. ", "409/2", 0],
                    [5, "Лабораторные занятия Технологии обработки больших данных ", "15:15:00", "16:50:00", " Белецкая С. Ю. ", "406/2", 1],
                    [5, "Лабораторные занятия Системы искусственного интеллекта ", "15:15:00", "16:50:00", " Гусев П. Ю. ", "407/2", 2],
                    [6, "Лекционные занятия Методы машинного обучения ", "17:00:00", "18:35:00", " Литвиненко Ю. В. ", "407/2", 0]
                ],
                "Saturday": [
                    [2, "Практические занятия Проектная деятельность ", "9:45:00", "11:20:00", " Рындин Н. А. ", "307/2", 0],
                    [3, "Лекционные занятия Разработка приложений для мобильных устройств ", "11:30:00", "13:05:00", " Воробьев Э. И. ", "403/2", 0],
                    [4, "Лабораторные занятия Разработка приложений для мобильных устройств ", "13:30:00", "15:05:00", " Воробьев Э. И. ", "403/2", 1],
                    [4, "Лабораторные занятия Методы машинного обучения ", "13:30:00", "15:05:00", " Литвиненко Ю. В. ", "409/2", 2],
                    [5, "Лабораторные занятия Разработка приложений для мобильных устройств ", "15:15:00", "16:50:00", " Воробьев Э. И. ", "403/2", 1],
                    [5, "Лабораторные занятия Методы машинного обучения ", "15:15:00", "16:50:00", " Литвиненко Ю. В. ", "409/2", 2]
                ]
            },
            "Denominator": {
                "Monday": [
                    [1, "с 08:30 -до 10:05  Лабораторные занятия Конфигурирование в системе 1С: ", "8:00:00", "9:35:00", " Коржова М. Е. ", "1415", 0],
                    [2, "с 10:15 -до 11:50  Лабораторные занятия Конфигурирование в системе 1С: ", "9:45:00", "11:20:00", " Коржова М. Е. ", "1415", 0],
                    [3, "с 12:00 -до 13:35  Лабораторные занятия Конфигурирование в системе 1С: ", "11:30:00", "13:05:00", " Коржова М. Е. ", "1415", 0],
                    [4, "с 14:20 -до 15:55  Лабораторные занятия Конфигурирование в системе 1С: ", "13:30:00", "15:05:00", " Коржова М. Е. ", "1415", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Лапинская И. П. ", "6252", 0]
                ],
                "Tuesday": [
                    [5, "Лабораторные занятия Информационная безопасность и защита информации ", "15:15:00", "16:50:00", " Питолин А. В. ", "409/2", 0],
                    [6, "Лабораторные занятия Информационная безопасность и защита информации ", "17:00:00", "18:35:00", " Питолин А. В. ", "409/2", 0]
                ],
                "Wednesday": [],
                "Thursday": [
                    [2, "Лабораторные занятия Управление данными в организации ", "9:45:00", "11:20:00", " Кострова В. Н. ", "406/2", 1],
                    [2, "Лабораторные занятия Управление проектами ", "9:45:00", "11:20:00", " Питолин А. В. ", "409/2", 2],
                    [3, "Лабораторные занятия Управление данными в организации ", "11:30:00", "13:05:00", " Кострова В. Н. ", "406/2", 1],
                    [3, "Лабораторные занятия Управление проектами ", "11:30:00", "13:05:00", " Питолин А. В. ", "409/2", 2],
                    [4, "Лабораторные занятия Технологии обработки больших данных ", "13:30:00", "15:05:00", " Белецкая С. Ю. ", "406/2", 0],
                    [5, "Лабораторные занятия Технологии обработки больших данных ", "15:15:00", "16:50:00", " Белецкая С. Ю. ", "406/2", 0]
                ],
                "Friday": [
                    [3, "Лекционные занятия Управление данными в организации ", "11:30:00", "13:05:00", " Кострова В. Н. ", "407/2", 0],
                    [4, "Практические занятия Системы искусственного интеллекта ", "13:30:00", "15:05:00", " Гусев П. Ю. ", "407/2", 0],
                    [5, "Лабораторные занятия Системы искусственного интеллекта ", "15:15:00", "16:50:00", " Гусев П. Ю. ", "407/2", 1],
                    [5, "Лабораторные занятия Технологии обработки больших данных ", "15:15:00", "16:50:00", " Белецкая С. Ю. ", "406/2", 2],
                    [6, "Лекционные занятия Технологии обработки больших данных ", "17:00:00", "18:35:00", " Белецкая С. Ю. ", "406/2", 0]
                ],
                "Saturday": [
                    [2, "Практические занятия Проектная деятельность ", "9:45:00", "11:20:00", " Рындин Н. А. ", "307/2", 0],
                    [3, "Лекционные занятия Разработка приложений для мобильных устройств ", "11:30:00", "13:05:00", " Воробьев Э. И. ", "403/2", 0],
                    [4, "Лабораторные занятия Методы машинного обучения ", "13:30:00", "15:05:00", " Литвиненко Ю. В. ", "409/2", 1],
                    [4, "Лабораторные занятия Разработка приложений для мобильных устройств ", "13:30:00", "15:05:00", " Воробьев Э. И. ", "403/2", 2],
                    [5, "Лабораторные занятия Методы машинного обучения ", "15:15:00", "16:50:00", " Литвиненко Ю. В. ", "409/2", 1],
                    [5, "Лабораторные занятия Разработка приложений для мобильных устройств ", "15:15:00", "16:50:00", " Воробьев Э. И. ", "403/2", 2]
                ]
            }
        },
        "bITS_221": {
            "Numerator": {
                "Monday": [
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Веркин С. С. ", "407/2", 0],
                    [4, "Лекционные занятия Методы оптимизации ", "13:30:00", "15:05:00", " Белецкая С. Ю. ", "301/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Чернышев Д. И. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Лекционные занятия Прототипирование в IT проектах ", "17:00:00", "18:35:00", " Гусев П. Ю. ", "2247", 0]
                ],
                "Tuesday": [
                    [1, "Лабораторные занятия Методы оптимизации ", "8:00:00", "9:35:00", " Белецкая С. Ю. ", "406/2", 1],
                    [1, "Лабораторные занятия Технологии разработки Enterprise решений ", "8:00:00", "9:35:00", " Королев Е. Н. ", "407/2", 2],
                    [2, "Лабораторные занятия Методы оптимизации ", "9:45:00", "11:20:00", " Белецкая С. Ю. ", "406/2", 1],
                    [2, "Лабораторные занятия Технологии разработки Enterprise решений ", "9:45:00", "11:20:00", " Королев Е. Н. ", "407/2", 2],
                    [3, "Лекционные занятия Технологии разработки Enterprise решений ", "11:30:00", "13:05:00", " Королев Е. Н. ", "301/2", 0],
                    [4, "Лекционные занятия Цифровая трансформация организации ", "13:30:00", "15:05:00", " Кострова В. Н. ", "407/2", 0]
                ],
                "Wednesday": [
                    [3, "Лабораторные занятия Цифровая трансформация организации ", "11:30:00", "13:05:00", " Кострова В. Н. ", "409/2", 1],
                    [3, "Лабораторные занятия Прототипирование в IT проектах ", "11:30:00", "13:05:00", " Гусев П. Ю. ", "407/2", 2],
                    [4, "Лабораторные занятия Цифровая трансформация организации ", "13:30:00", "15:05:00", " Кострова В. Н. ", "409/2", 1],
                    [4, "Лабораторные занятия Прототипирование в IT проектах ", "13:30:00", "15:05:00", " Гусев П. Ю. ", "407/2", 2],
                    [5, "Практические занятия Технологическое предпринимательство ", "15:15:00", "16:50:00", " Наролина Т. С. ", "112/2", 0],
                    [6, "Практические занятия Профессиональная этика ", "17:00:00", "18:35:00", " Коваль Л. В. ", "116/2", 0]
                ],
                "Thursday": [
                    [3, "Лекционные занятия Технологическое предпринимательство ", "11:30:00", "13:05:00", " Наролина Т. С. ", "310/2", 0],
                    [4, "Лекционные занятия Маркетинг и продвижение продукта ", "13:30:00", "15:05:00", " Наролина Т. С. ", "310/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Чернышев Д. И. ", "0000", 0]
                ],
                "Friday": [],
                "Saturday": [
                    [1, "Практические занятия Основы устройства и принципов работы БПЛА ", "8:00:00", "9:35:00", " Тикунов А. В. ", "235/3", 0],
                    [2, "Практические занятия Основы устройства и принципов работы БПЛА ", "9:45:00", "11:20:00", " Тикунов А. В. ", "235/3", 0],
                    [3, "Лекционные занятия Основы устройства и принципов работы БПЛА ", "11:30:00", "13:05:00", " Тикунов А. В. ", "235/3", 0],
                    [4, "Лекционные занятия Язык программирования Python для анализа данных ", "13:30:00", "15:05:00", " Белецкая С. Ю.  Белецкая С. Ю. ", "406/2", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Веркин С. С. ", "407/2", 0],
                    [4, "Лекционные занятия Методы оптимизации ", "13:30:00", "15:05:00", " Белецкая С. Ю. ", "301/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Чернышев Д. И. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Лекционные занятия Профессиональная этика ", "17:00:00", "18:35:00", " Коваль Л. В. ", "3117", 0]
                ],
                "Tuesday": [
                    [1, "Лабораторные занятия Технологии разработки Enterprise решений ", "8:00:00", "9:35:00", " Королев Е. Н. ", "407/2", 1],
                    [1, "Лабораторные занятия Методы оптимизации ", "8:00:00", "9:35:00", " Белецкая С. Ю. ", "406/2", 2],
                    [2, "Лабораторные занятия Технологии разработки Enterprise решений ", "9:45:00", "11:20:00", " Королев Е. Н. ", "407/2", 1],
                    [2, "Лабораторные занятия Методы оптимизации ", "9:45:00", "11:20:00", " Белецкая С. Ю. ", "406/2", 2],
                    [3, "Лекционные занятия Технологии разработки Enterprise решений ", "11:30:00", "13:05:00", " Королев Е. Н. ", "312/2", 0],
                    [4, "Лекционные занятия Цифровая трансформация организации ", "13:30:00", "15:05:00", " Кострова В. Н. ", "407/2", 0]
                ],
                "Wednesday": [
                    [3, "Лабораторные занятия Прототипирование в IT проектах ", "11:30:00", "13:05:00", " Гусев П. Ю. ", "407/2", 1],
                    [3, "Лабораторные занятия Цифровая трансформация организации ", "11:30:00", "13:05:00", " Кострова В. Н. ", "409/2", 2],
                    [4, "Лабораторные занятия Прототипирование в IT проектах ", "13:30:00", "15:05:00", " Гусев П. Ю. ", "407/2", 1],
                    [4, "Лабораторные занятия Цифровая трансформация организации ", "13:30:00", "15:05:00", " Кострова В. Н. ", "409/2", 2]
                ],
                "Thursday": [
                    [3, "Практические занятия Профессиональная этика ", "11:30:00", "13:05:00", " Коваль Л. В. ", "111/2", 0],
                    [4, "Лекционные занятия Маркетинг и продвижение продукта ", "13:30:00", "15:05:00", " Наролина Т. С. ", "312/2", 0]
                ],
                "Friday": [],
                "Saturday": [
                    [1, "Практические занятия Маркетинг и продвижение продукта ", "8:00:00", "9:35:00", " Наролина Т. С. ", "333/3", 1],
                    [1, "Практические занятия Основы устройства и принципов работы БПЛА ", "8:00:00", "9:35:00", " Тикунов А. В. ", "235/3", 2],
                    [2, "Практические занятия Маркетинг и продвижение продукта ", "9:45:00", "11:20:00", " Наролина Т. С. ", "333/3", 1],
                    [2, "Практические занятия Основы устройства и принципов работы БПЛА ", "9:45:00", "11:20:00", " Тикунов А. В. ", "235/3", 2],
                    [3, "Лекционные занятия Основы устройства и принципов работы БПЛА ", "11:30:00", "13:05:00", " Тикунов А. В. ", "235/3", 0],
                    [4, "Лекционные занятия Язык программирования Python для анализа данных ", "13:30:00", "15:05:00", " Белецкая С. Ю.  Белецкая С. Ю. ", "406/2", 0],
                    [5, "Лабораторные занятия Язык программирования Python для анализа данных ", "15:15:00", "16:50:00", " Белецкая С. Ю. ", "406/2", 0],
                    [6, "Лабораторные занятия Язык программирования Python для анализа данных ", "17:00:00", "18:35:00", " Белецкая С. Ю. ", "406/2", 0]
                ]
            }
        },
        "bITS_222": {
            "Numerator": {
                "Monday": [
                    [4, "Лекционные занятия Методы оптимизации ", "13:30:00", "15:05:00", " Белецкая С. Ю. ", "301/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Лукин А. А. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Лекционные занятия Прототипирование в IT проектах ", "17:00:00", "18:35:00", " Гусев П. Ю. ", "2247", 0]
                ],
                "Tuesday": [
                    [3, "Лекционные занятия Технологии разработки Enterprise решений ", "11:30:00", "13:05:00", " Королев Е. Н. ", "301/2", 0],
                    [4, "Лекционные занятия Цифровая трансформация организации ", "13:30:00", "15:05:00", " Кострова В. Н. ", "407/2", 0],
                    [5, "Лабораторные занятия Технологии разработки Enterprise решений ", "15:15:00", "16:50:00", " Королев Е. Н. ", "406/2", 1],
                    [5, "Лабораторные занятия Методы оптимизации ", "15:15:00", "16:50:00", " Белецкая С. Ю. ", "407/2", 2],
                    [6, "Лабораторные занятия Технологии разработки Enterprise решений ", "17:00:00", "18:35:00", " Королев Е. Н. ", "406/2", 1],
                    [6, "Лабораторные занятия Методы оптимизации ", "17:00:00", "18:35:00", " Белецкая С. Ю. ", "407/2", 2]
                ],
                "Wednesday": [
                    [1, "Лабораторные занятия Прототипирование в IT проектах ", "8:00:00", "9:35:00", " Гусев П. Ю. ", "407/2", 1],
                    [1, "Лабораторные занятия Цифровая трансформация организации ", "8:00:00", "9:35:00", " Кострова В. Н. ", "406/2", 2],
                    [2, "Лабораторные занятия Прототипирование в IT проектах ", "9:45:00", "11:20:00", " Гусев П. Ю. ", "407/2", 1],
                    [2, "Лабораторные занятия Цифровая трансформация организации ", "9:45:00", "11:20:00", " Кострова В. Н. ", "406/2", 2],
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Веркин С. С. ", "403/2", 0],
                    [4, "Практические занятия Профессиональная этика ", "13:30:00", "15:05:00", " Коваль Л. В. ", "307/2", 0]
                ],
                "Thursday": [
                    [3, "Лекционные занятия Технологическое предпринимательство ", "11:30:00", "13:05:00", " Наролина Т. С. ", "310/2", 0],
                    [4, "Лекционные занятия Маркетинг и продвижение продукта ", "13:30:00", "15:05:00", " Наролина Т. С. ", "310/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Лукин А. А. ", "0000", 0]
                ],
                "Friday": [],
                "Saturday": [
                    [1, "Практические занятия Маркетинг и продвижение продукта ", "8:00:00", "9:35:00", " Наролина Т. С. ", "333/3", 0],
                    [2, "Практические занятия Маркетинг и продвижение продукта ", "9:45:00", "11:20:00", " Наролина Т. С. ", "333/3", 0],
                    [4, "Лекционные занятия Язык программирования Python для анализа данных ", "13:30:00", "15:05:00", " Белецкая С. Ю.  Белецкая С. Ю. ", "406/2", 0],
                    [5, "Лабораторные занятия Язык программирования Python для анализа данных ", "15:15:00", "16:50:00", " Белецкая С. Ю. ", "406/2", 0],
                    [6, "Лабораторные занятия Язык программирования Python для анализа данных ", "17:00:00", "18:35:00", " Белецкая С. Ю. ", "406/2", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [4, "Лекционные занятия Методы оптимизации ", "13:30:00", "15:05:00", " Белецкая С. Ю. ", "301/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Лукин А. А. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Лекционные занятия Профессиональная этика ", "17:00:00", "18:35:00", " Коваль Л. В. ", "3117", 0]
                ],
                "Tuesday": [
                    [3, "Лекционные занятия Технологии разработки Enterprise решений ", "11:30:00", "13:05:00", " Королев Е. Н. ", "312/2", 0],
                    [4, "Лекционные занятия Цифровая трансформация организации ", "13:30:00", "15:05:00", " Кострова В. Н. ", "407/2", 0],
                    [5, "Лабораторные занятия Методы оптимизации ", "15:15:00", "16:50:00", " Белецкая С. Ю. ", "405/2", 1],
                    [5, "Лабораторные занятия Технологии разработки Enterprise решений ", "15:15:00", "16:50:00", " Королев Е. Н. ", "406/2", 2],
                    [6, "Лабораторные занятия Методы оптимизации ", "17:00:00", "18:35:00", " Белецкая С. Ю. ", "405/2", 1],
                    [6, "Лабораторные занятия Технологии разработки Enterprise решений ", "17:00:00", "18:35:00", " Королев Е. Н. ", "406/2", 2]
                ],
                "Wednesday": [
                    [1, "Лабораторные занятия Цифровая трансформация организации ", "8:00:00", "9:35:00", " Кострова В. Н. ", "406/2", 1],
                    [1, "Лабораторные занятия Прототипирование в IT проектах ", "8:00:00", "9:35:00", " Гусев П. Ю. ", "407/2", 2],
                    [2, "Лабораторные занятия Цифровая трансформация организации ", "9:45:00", "11:20:00", " Кострова В. Н. ", "406/2", 1],
                    [2, "Лабораторные занятия Прототипирование в IT проектах ", "9:45:00", "11:20:00", " Гусев П. Ю. ", "407/2", 2],
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Веркин С. С. ", "403/2", 0],
                    [4, "Практические занятия Профессиональная этика ", "13:30:00", "15:05:00", " Коваль Л. В. ", "307/2", 0]
                ],
                "Thursday": [
                    [3, "Практические занятия Технологическое предпринимательство ", "11:30:00", "13:05:00", " Наролина Т. С. ", "307/2", 0],
                    [4, "Лекционные занятия Маркетинг и продвижение продукта ", "13:30:00", "15:05:00", " Наролина Т. С. ", "312/2", 0]
                ],
                "Friday": [],
                "Saturday": [
                    [4, "Лекционные занятия Язык программирования Python для анализа данных ", "13:30:00", "15:05:00", " Белецкая С. Ю.  Белецкая С. Ю. ", "406/2", 0]
                ]
            }
        },
        "bIVT_231": {
            "Numerator": {
                "Monday": [
                    [1, "Лабораторные занятия Базы данных ", "8:00:00", "9:35:00", " Жихорев А. В. ", "215/2", 1],
                    [1, "Лабораторные занятия Информатика ", "8:00:00", "9:35:00", " Пачевская Е. А. ", "208/2", 2],
                    [1, "Лабораторные занятия CAD-системы ", "8:00:00", "9:35:00", " Мануковский А. Ю. ", "202/2", 3],
                    [2, "Лабораторные занятия Информатика ", "9:45:00", "11:20:00", " Пачевская Е. А. ", "208/2", 1],
                    [2, "Лабораторные занятия Базы данных ", "9:45:00", "11:20:00", " Жихорев А. В. ", "215/2", 2],
                    [2, "Лабораторные занятия CAD-системы ", "9:45:00", "11:20:00", " Мануковский А. Ю. ", "202/2", 3],
                    [3, "Лекционные занятия CAD-системы ", "11:30:00", "13:05:00", " Мануковский А. Ю. ", "312/2", 0],
                    [4, "Лекционные занятия Математика ", "13:30:00", "15:05:00", " Надеина Т. А. ", "312/2", 0]
                ],
                "Tuesday": [
                    [4, "Лабораторные занятия CAD-системы ", "13:30:00", "15:05:00", " Мануковский А. Ю. ", "202/2", 1],
                    [4, "Лабораторные занятия Дискретная математика ", "13:30:00", "15:05:00", " Пак А. А. ", "210/2", 2],
                    [5, "Лабораторные занятия CAD-системы ", "15:15:00", "16:50:00", " Мануковский А. Ю. ", "202/2", 1],
                    [5, "Лабораторные занятия Дискретная математика ", "15:15:00", "16:50:00", " Пак А. А. ", "210/2", 2]
                ],
                "Wednesday": [
                    [2, "Практические занятия Математика ", "9:45:00", "11:20:00", " Надеина Т. А. ", "110/2", 0],
                    [3, "Лекционные занятия Среды визуального программирования ", "11:30:00", "13:05:00", " Сукачев А. И. ", "312/2", 0],
                    [4, "с 14:20 -до 15:55  Лекционные занятия Экономика ", "13:30:00", "15:05:00", " Давыдова Т. Е. ", "2247", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Вялых Н. Н. ", "0000", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Вялых Н. Н. ", "0000", 0]
                ],
                "Thursday": [
                    [1, "Лекционные занятия Дискретная математика ", "8:00:00", "9:35:00", " Собенина О. В. ", "311/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Филимонова А. А. ", "311/2", 0],
                    [3, "Лабораторные занятия Среды визуального программирования ", "11:30:00", "13:05:00", " . . . ", "215/2", 1],
                    [3, "Лабораторные занятия Дискретная математика ", "11:30:00", "13:05:00", " Пак А. А. ", "213/2", 2],
                    [4, "Лабораторные занятия Среды визуального программирования ", "13:30:00", "15:05:00", " . . . ", "215/2", 1],
                    [4, "Лабораторные занятия Дискретная математика ", "13:30:00", "15:05:00", " Пак А. А. ", "213/2", 2]
                ],
                "Friday": [
                    [2, "Лабораторные занятия Среды визуального программирования ", "9:45:00", "11:20:00", " . . . ", "215/2", 1],
                    [2, "Практические занятия Математика ", "9:45:00", "11:20:00", " Надеина Т. А. ", "110/2", 2],
                    [3, "Практические занятия Философия ", "11:30:00", "13:05:00", " Назаренко К. С. ", "114/2", 1],
                    [3, "Практические занятия Экономика ", "11:30:00", "13:05:00", " Давыдова Т. Е. ", "116/2", 2],
                    [4, "Практические занятия Экономика ", "13:30:00", "15:05:00", " Давыдова Т. Е. ", "206/2", 1],
                    [4, "Практические занятия Философия ", "13:30:00", "15:05:00", " Назаренко К. С. ", "114/2", 2],
                    [5, "Практические занятия Математика ", "15:15:00", "16:50:00", " Надеина Т. А. ", "302/2", 0]
                ],
                "Saturday": [
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Вялых Н. Н. ", "0000", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Вялых Н. Н. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [1, "Лабораторные занятия Среды визуального программирования ", "8:00:00", "9:35:00", " Троценко А. С. ", "215/2", 0],
                    [2, "Лабораторные занятия Базы данных ", "9:45:00", "11:20:00", " Жихорев А. В. ", "215/2", 0],
                    [3, "Лекционные занятия CAD-системы ", "11:30:00", "13:05:00", " Мануковский А. Ю. ", "312/2", 0],
                    [4, "Лекционные занятия Информатика ", "13:30:00", "15:05:00", " Пачевский Д. Е. ", "312/2", 0],
                    [5, "Лабораторные занятия Информатика ", "15:15:00", "16:50:00", " Пачевская Е. А. ", "208/2", 0]
                ],
                "Tuesday": [
                    [4, "Лабораторные занятия Дискретная математика ", "13:30:00", "15:05:00", " Пак А. А. ", "210/2", 1],
                    [4, "Лабораторные занятия CAD-системы ", "13:30:00", "15:05:00", " Мануковский А. Ю. ", "202/2", 2],
                    [5, "Лабораторные занятия Дискретная математика ", "15:15:00", "16:50:00", " Пак А. А. ", "210/2", 1],
                    [5, "Лабораторные занятия CAD-системы ", "15:15:00", "16:50:00", " Мануковский А. Ю. ", "202/2", 2]
                ],
                "Wednesday": [
                    [2, "Практические занятия Математика ", "9:45:00", "11:20:00", " Надеина Т. А. ", "110/2", 0],
                    [3, "Лекционные занятия Среды визуального программирования ", "11:30:00", "13:05:00", " Сукачев А. И. ", "312/2", 0],
                    [4, "Лекционные занятия Философия ", "13:30:00", "15:05:00", " Назаренко К. С. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Вялых Н. Н. ", "0000", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Вялых Н. Н. ", "0000", 0]
                ],
                "Thursday": [
                    [1, "Лекционные занятия Дискретная математика ", "8:00:00", "9:35:00", " Собенина О. В. ", "311/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Филимонова А. А. ", "311/2", 0],
                    [3, "Лабораторные занятия Среды визуального программирования ", "11:30:00", "13:05:00", " . . . ", "213/2", 0]
                ],
                "Friday": [
                    [1, "Лабораторные занятия Среды визуального программирования ", "8:00:00", "9:35:00", " . . . ", "215/2", 0],
                    [2, "Лабораторные занятия Среды визуального программирования ", "9:45:00", "11:20:00", " . . . ", "215/2", 0],
                    [3, "Лабораторные занятия Среды визуального программирования ", "11:30:00", "13:05:00", " . . . ", "215/2", 0],
                    [4, "Лабораторные занятия Среды визуального программирования ", "13:30:00", "15:05:00", " . . . ", "215/2", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ],
                "Saturday": [
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Вялых Н. Н. ", "0000", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Вялых Н. Н. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            }
        },
        "bIVT_232": {
            "Numerator": {
                "Monday": [
                    [3, "Лекционные занятия CAD-системы ", "11:30:00", "13:05:00", " Мануковский А. Ю. ", "312/2", 0],
                    [4, "Лекционные занятия Математика ", "13:30:00", "15:05:00", " Надеина Т. А. ", "312/2", 0],
                    [5, "Лабораторные занятия Базы данных ", "15:15:00", "16:50:00", " Филимонова А. А. ", "215/2", 0]
                ],
                "Tuesday": [],
                "Wednesday": [
                    [3, "Лекционные занятия Среды визуального программирования ", "11:30:00", "13:05:00", " Сукачев А. И. ", "312/2", 0],
                    [4, "с 14:20 -до 15:55  Лекционные занятия Экономика ", "13:30:00", "15:05:00", " Давыдова Т. Е. ", "2247", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Зиземская Н. И. ", "0000", 0]
                ],
                "Thursday": [
                    [1, "Лекционные занятия Дискретная математика ", "8:00:00", "9:35:00", " Собенина О. В. ", "311/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Филимонова А. А. ", "311/2", 0],
                    [3, "Лабораторные занятия CAD-системы ", "11:30:00", "13:05:00", " Жихорев А. В. ", "202/2", 1],
                    [3, "Лабораторные занятия Информатика ", "11:30:00", "13:05:00", " Пачевская Е. А. ", "210/2", 2],
                    [4, "Лабораторные занятия CAD-системы ", "13:30:00", "15:05:00", " Жихорев А. В. ", "202/2", 0]
                ],
                "Friday": [
                    [1, "Лабораторные занятия Среды визуального программирования ", "8:00:00", "9:35:00", " Сокольников В. В. ", "213/2", 0],
                    [2, "Лабораторные занятия Дискретная математика ", "9:45:00", "11:20:00", " Собенина О. В. ", "210/2", 1],
                    [2, "Лабораторные занятия Среды визуального программирования ", "9:45:00", "11:20:00", " Сокольников В. В. ", "213/2", 2],
                    [3, "Лабораторные занятия Дискретная математика ", "11:30:00", "13:05:00", " Собенина О. В. ", "210/2", 1],
                    [3, "Лабораторные занятия Среды визуального программирования ", "11:30:00", "13:05:00", " Сокольников В. В. ", "213/2", 2],
                    [4, "Практические занятия Математика ", "13:30:00", "15:05:00", " Надеина Т. А. ", "110/2", 0]
                ],
                "Saturday": [
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Зиземская Н. И. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [3, "Лекционные занятия CAD-системы ", "11:30:00", "13:05:00", " Мануковский А. Ю. ", "312/2", 0],
                    [4, "Лекционные занятия Информатика ", "13:30:00", "15:05:00", " Пачевский Д. Е. ", "312/2", 0],
                    [5, "Лабораторные занятия Базы данных ", "15:15:00", "16:50:00", " Филимонова А. А. ", "215/2", 0]
                ],
                "Tuesday": [
                    [2, "Практические занятия Экономика ", "9:45:00", "11:20:00", " Давыдова Т. Е. ", "311/2", 0],
                    [3, "Практические занятия Философия ", "11:30:00", "13:05:00", " Назаренко К. С. ", "206/2", 0]
                ],
                "Wednesday": [
                    [3, "Лекционные занятия Среды визуального программирования ", "11:30:00", "13:05:00", " Сукачев А. И. ", "312/2", 0],
                    [4, "Лекционные занятия Философия ", "13:30:00", "15:05:00", " Назаренко К. С. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Зиземская Н. И. ", "0000", 0]
                ],
                "Thursday": [
                    [1, "Лекционные занятия Дискретная математика ", "8:00:00", "9:35:00", " Собенина О. В. ", "311/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Филимонова А. А. ", "311/2", 0],
                    [3, "Лабораторные занятия Информатика ", "11:30:00", "13:05:00", " Пачевская Е. А. ", "210/2", 1],
                    [3, "Лабораторные занятия CAD-системы ", "11:30:00", "13:05:00", " Мануковский А. Ю.  Жихорев А. В. ", "202/2", 2],
                    [4, "Лабораторные занятия CAD-системы ", "13:30:00", "15:05:00", " Мануковский А. Ю.  Жихорев А. В. ", "202/2", 0]
                ],
                "Friday": [
                    [1, "Практические занятия Математика ", "8:00:00", "9:35:00", " Надеина Т. А. ", "110/2", 1],
                    [1, "Лабораторные занятия Среды визуального программирования ", "8:00:00", "9:35:00", " Сокольников В. В. ", "213/2", 2],
                    [2, "Лабораторные занятия Среды визуального программирования ", "9:45:00", "11:20:00", " Сокольников В. В. ", "213/2", 1],
                    [2, "Лабораторные занятия Дискретная математика ", "9:45:00", "11:20:00", " Собенина О. В. ", "210/2", 2],
                    [3, "Лабораторные занятия Среды визуального программирования ", "11:30:00", "13:05:00", " Сокольников В. В. ", "213/2", 1],
                    [3, "Лабораторные занятия Дискретная математика ", "11:30:00", "13:05:00", " Собенина О. В. ", "210/2", 2],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ],
                "Saturday": [
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Зиземская Н. И. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            }
        },
        "bIVT_233": {
            "Numerator": {
                "Monday": [
                    [3, "Лекционные занятия CAD-системы ", "11:30:00", "13:05:00", " Мануковский А. Ю. ", "312/2", 0],
                    [4, "Лекционные занятия Математика ", "13:30:00", "15:05:00", " Надеина Т. А. ", "312/2", 0]
                ],
                "Tuesday": [
                    [1, "Лабораторные занятия Среды визуального программирования ", "8:00:00", "9:35:00", " Сокольников В. В. ", "215/2", 1],
                    [1, "Лабораторные занятия Дискретная математика ", "8:00:00", "9:35:00", " Собенина О. В. ", "210/2", 2],
                    [2, "Лабораторные занятия Среды визуального программирования ", "9:45:00", "11:20:00", " Сокольников В. В. ", "215/2", 1],
                    [2, "Лабораторные занятия Дискретная математика ", "9:45:00", "11:20:00", " Собенина О. В. ", "210/2", 2],
                    [3, "Лабораторные занятия Информатика ", "11:30:00", "13:05:00", " Пачевская Е. А. ", "210/2", 1],
                    [3, "Лабораторные занятия Базы данных ", "11:30:00", "13:05:00", " Филимонова А. А. ", "213/2", 2]
                ],
                "Wednesday": [
                    [3, "Лекционные занятия Среды визуального программирования ", "11:30:00", "13:05:00", " Сукачев А. И. ", "312/2", 0],
                    [4, "Лекционные занятия Экономика ", "13:30:00", "15:05:00", " Пургаева И. А. ", "310/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Груза М. С. ", "0000", 0]
                ],
                "Thursday": [
                    [1, "Лекционные занятия Дискретная математика ", "8:00:00", "9:35:00", " Собенина О. В. ", "311/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Филимонова А. А. ", "311/2", 0]
                ],
                "Friday": [
                    [2, "Практические занятия Экономика ", "9:45:00", "11:20:00", " Пургаева И. А. ", "114/2", 0],
                    [3, "Практические занятия Математика ", "11:30:00", "13:05:00", " Надеина Т. А. ", "110/2", 0],
                    [4, "Лабораторные занятия CAD-системы ", "13:30:00", "15:05:00", " Жихорев А. В. ", "202/2", 1],
                    [4, "Лабораторные занятия Среды визуального программирования ", "13:30:00", "15:05:00", " Сокольников В. В. ", "213/2", 2],
                    [5, "Лабораторные занятия CAD-системы ", "15:15:00", "16:50:00", " Жихорев А. В. ", "202/2", 0]
                ],
                "Saturday": [
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Груза М. С. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [3, "Лекционные занятия CAD-системы ", "11:30:00", "13:05:00", " Мануковский А. Ю. ", "312/2", 0],
                    [4, "Лекционные занятия Информатика ", "13:30:00", "15:05:00", " Пачевский Д. Е. ", "312/2", 0]
                ],
                "Tuesday": [
                    [1, "Лабораторные занятия Дискретная математика ", "8:00:00", "9:35:00", " Собенина О. В. ", "210/2", 1],
                    [1, "Лабораторные занятия Среды визуального программирования ", "8:00:00", "9:35:00", " Сокольников В. В. ", "215/2", 2],
                    [2, "Лабораторные занятия Дискретная математика ", "9:45:00", "11:20:00", " Собенина О. В. ", "210/2", 1],
                    [2, "Лабораторные занятия Среды визуального программирования ", "9:45:00", "11:20:00", " Сокольников В. В. ", "215/2", 2],
                    [3, "Лабораторные занятия Базы данных ", "11:30:00", "13:05:00", " Филимонова А. А. ", "213/2", 1],
                    [3, "Лабораторные занятия Информатика ", "11:30:00", "13:05:00", " Пачевская Е. А. ", "210/2", 2]
                ],
                "Wednesday": [
                    [3, "Лекционные занятия Среды визуального программирования ", "11:30:00", "13:05:00", " Сукачев А. И. ", "312/2", 0],
                    [4, "Лекционные занятия Философия ", "13:30:00", "15:05:00", " Назаренко К. С. ", "311/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Груза М. С. ", "0000", 0]
                ],
                "Thursday": [
                    [1, "Лекционные занятия Дискретная математика ", "8:00:00", "9:35:00", " Собенина О. В. ", "311/2", 0],
                    [2, "Лекционные занятия Базы данных ", "9:45:00", "11:20:00", " Филимонова А. А. ", "311/2", 0]
                ],
                "Friday": [
                    [2, "Практические занятия Математика ", "9:45:00", "11:20:00", " Надеина Т. А. ", "110/2", 0],
                    [3, "Практические занятия Философия ", "11:30:00", "13:05:00", " Назаренко К. С. ", "303/2", 0],
                    [4, "Лабораторные занятия Среды визуального программирования ", "13:30:00", "15:05:00", " Сокольников В. В. ", "213/2", 1],
                    [4, "Лабораторные занятия CAD-системы ", "13:30:00", "15:05:00", " Жихорев А. В. ", "202/2", 2],
                    [5, "Лабораторные занятия CAD-системы ", "15:15:00", "16:50:00", " Жихорев А. В. ", "202/2", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ],
                "Saturday": [
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Груза М. С. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Устинова Н. Н. ", "6252", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Устинова Н. Н. ", "6252", 0]
                ]
            }
        },
        "bPO_211": {
            "Numerator": {
                "Monday": [
                    [3, "Лекционные занятия Методы отладки и тестирования программных продуктов ", "11:30:00", "13:05:00", " Жихорев А. В. ", "202/2", 0],
                    [4, "Лекционные занятия Разработка приложений для мобильных устройств ", "13:30:00", "15:05:00", " Сокольников В. В. ", "307/2", 0],
                    [5, "Лабораторные занятия Разработка автоматизированных систем ", "15:15:00", "16:50:00", " Сокольников В. В. ", "210/2", 0],
                    [6, "Лабораторные занятия Разработка приложений для мобильных устройств ", "17:00:00", "18:35:00", " Сокольников В. В. ", "210/2", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Лапинская И. П. ", "6252", 0]
                ],
                "Tuesday": [
                    [4, "Лабораторные занятия Методы отладки и тестирования программных продуктов ", "13:30:00", "15:05:00", " Жихорев А. В. ", "215/2", 0],
                    [5, "Лабораторные занятия Методы отладки и тестирования программных продуктов ", "15:15:00", "16:50:00", " Жихорев А. В. ", "215/2", 0]
                ],
                "Wednesday": [],
                "Thursday": [
                    [1, "Лабораторные занятия Разработка клиент- серверных приложений ", "8:00:00", "9:35:00", " Пачевский Д. Е. ", "215/2", 1],
                    [1, "Лабораторные занятия Разработка автоматизированных систем ", "8:00:00", "9:35:00", " Сокольников В. В. ", "210/2", 2],
                    [2, "Лабораторные занятия Разработка клиент- серверных приложений ", "9:45:00", "11:20:00", " Пачевский Д. Е. ", "215/2", 1],
                    [2, "Лабораторные занятия Разработка автоматизированных систем ", "9:45:00", "11:20:00", " Сокольников В. В. ", "210/2", 2]
                ],
                "Friday": [
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Попов А. В. ", "208/2", 0],
                    [4, "Лекционные занятия Разработка клиент- серверных приложений ", "13:30:00", "15:05:00", " Пачевский Д. Е. ", "208/2", 0],
                    [5, "Лабораторные занятия Разработка клиент- серверных приложений ", "15:15:00", "16:50:00", " Пачевский Д. Е. ", "215/2", 0],
                    [6, "Лабораторные занятия Разработка клиент- серверных приложений ", "17:00:00", "18:35:00", " Пачевский Д. Е. ", "215/2", 0]
                ],
                "Saturday": [
                    [4, "Лабораторные занятия Методы обработки больших данных ", "13:30:00", "15:05:00", " Ягодкин А. С. ", "215/2", 0],
                    [5, "Лабораторные занятия Методы обработки больших данных ", "15:15:00", "16:50:00", " Ягодкин А. С. ", "215/2", 1],
                    [5, "Лабораторные занятия Разработка приложений для мобильных устройств ", "15:15:00", "16:50:00", " Сокольников В. В. ", "210/2", 2],
                    [6, "Лабораторные занятия Методы обработки больших данных ", "17:00:00", "18:35:00", " Ягодкин А. С. ", "215/2", 1],
                    [6, "Лабораторные занятия Разработка приложений для мобильных устройств ", "17:00:00", "18:35:00", " Сокольников В. В. ", "210/2", 2]
                ]
            },
            "Denominator": {
                "Monday": [
                    [3, "Лекционные занятия Методы отладки и тестирования программных продуктов ", "11:30:00", "13:05:00", " Жихорев А. В. ", "202/2", 0],
                    [4, "Лекционные занятия Разработка приложений для мобильных устройств ", "13:30:00", "15:05:00", " Сокольников В. В. ", "307/2", 0],
                    [5, "Лабораторные занятия Разработка автоматизированных систем ", "15:15:00", "16:50:00", " Сокольников В. В. ", "210/2", 0],
                    [6, "Лабораторные занятия Разработка приложений для мобильных устройств ", "17:00:00", "18:35:00", " Сокольников В. В. ", "210/2", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Лапинская И. П. ", "6252", 0]
                ],
                "Tuesday": [
                    [4, "Лабораторные занятия Методы отладки и тестирования программных продуктов ", "13:30:00", "15:05:00", " Жихорев А. В. ", "215/2", 0],
                    [5, "Лабораторные занятия Методы отладки и тестирования программных продуктов ", "15:15:00", "16:50:00", " Жихорев А. В. ", "215/2", 0]
                ],
                "Wednesday": [],
                "Thursday": [
                    [1, "Лабораторные занятия Разработка автоматизированных систем ", "8:00:00", "9:35:00", " Сокольников В. В. ", "210/2", 1],
                    [1, "Лабораторные занятия Разработка клиент- серверных приложений ", "8:00:00", "9:35:00", " Пачевский Д. Е. ", "215/2", 2],
                    [2, "Лабораторные занятия Разработка автоматизированных систем ", "9:45:00", "11:20:00", " Сокольников В. В. ", "210/2", 1],
                    [2, "Лабораторные занятия Разработка клиент- серверных приложений ", "9:45:00", "11:20:00", " Пачевский Д. Е. ", "215/2", 2],
                    [3, "Лекционные занятия Разработка автоматизированных систем ", "11:30:00", "13:05:00", " Сокольников В. В. ", "215/2", 0],
                    [4, "Лекционные занятия Методы обработки больших данных ", "13:30:00", "15:05:00", " Ягодкин А. С. ", "215/2", 0]
                ],
                "Friday": [
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Попов А. В. ", "208/2", 0],
                    [4, "Лекционные занятия Разработка клиент- серверных приложений ", "13:30:00", "15:05:00", " Пачевский Д. Е. ", "208/2", 0],
                    [5, "Лабораторные занятия Разработка клиент- серверных приложений ", "15:15:00", "16:50:00", " Пачевский Д. Е. ", "215/2", 0],
                    [6, "Лабораторные занятия Разработка клиент- серверных приложений ", "17:00:00", "18:35:00", " Пачевский Д. Е. ", "215/2", 0]
                ],
                "Saturday": [
                    [4, "Лабораторные занятия Методы обработки больших данных ", "13:30:00", "15:05:00", " Ягодкин А. С. ", "213/2", 0],
                    [5, "Лабораторные занятия Разработка приложений для мобильных устройств ", "15:15:00", "16:50:00", " Сокольников В. В. ", "210/2", 1],
                    [5, "Лабораторные занятия Методы обработки больших данных ", "15:15:00", "16:50:00", " Ягодкин А. С. ", "215/2", 2],
                    [6, "Лабораторные занятия Разработка приложений для мобильных устройств ", "17:00:00", "18:35:00", " Сокольников В. В. ", "210/2", 1],
                    [6, "Лабораторные занятия Методы обработки больших данных ", "17:00:00", "18:35:00", " Ягодкин А. С. ", "215/2", 2]
                ]
            }
        },
        "bRIS_211": {
            "Numerator": {
                "Monday": [
                    [1, "Лабораторные занятия Имитационное моделирование процессов и систем ", "8:00:00", "9:35:00", " Воробьев Э. И. ", "403/2", 0],
                    [2, "Лабораторные занятия Имитационное моделирование процессов и систем ", "9:45:00", "11:20:00", " Воробьев Э. И. ", "403/2", 1],
                    [2, "Лабораторные занятия Облачные технологии ", "9:45:00", "11:20:00", " Рындин Н. А. ", "409/2", 2],
                    [3, "Лабораторные занятия Цифровизация экономической деятельности ", "11:30:00", "13:05:00", " Кострова В. Н. ", "406/2", 1],
                    [3, "Лабораторные занятия Облачные технологии ", "11:30:00", "13:05:00", " Рындин Н. А. ", "409/2", 2],
                    [4, "Лабораторные занятия Цифровизация экономической деятельности ", "13:30:00", "15:05:00", " Кострова В. Н. ", "406/2", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Лапинская И. П. ", "6252", 0]
                ],
                "Tuesday": [],
                "Wednesday": [],
                "Thursday": [
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Рындин Н. А. ", "407/2", 0],
                    [4, "Лекционные занятия Информационная безопасность и защита информации ", "13:30:00", "15:05:00", " Питолин А. В. ", "409/2", 0],
                    [5, "Лабораторные занятия Системы искусственного интеллекта ", "15:15:00", "16:50:00", " Гусев П. Ю. ", "405/2", 1],
                    [5, "Лабораторные занятия Информационная безопасность и защита информации ", "15:15:00", "16:50:00", " Питолин А. В. ", "403/2", 2],
                    [6, "Лабораторные занятия Системы искусственного интеллекта ", "17:00:00", "18:35:00", " Гусев П. Ю. ", "405/2", 1],
                    [6, "Лабораторные занятия Информационная безопасность и защита информации ", "17:00:00", "18:35:00", " Питолин А. В. ", "403/2", 2]
                ],
                "Friday": [
                    [3, "Лекционные занятия Системы искусственного интеллекта ", "11:30:00", "13:05:00", " Гусев П. Ю. ", "405/2", 0],
                    [4, "Практические занятия Системы искусственного интеллекта ", "13:30:00", "15:05:00", " Гусев П. Ю. ", "405/2", 0],
                    [5, "Лабораторные занятия Управление проектами разработки информационных систем ", "15:15:00", "16:50:00", " Питолин А. В. ", "403/2", 0],
                    [6, "Лабораторные занятия Управление проектами разработки информационных систем ", "17:00:00", "18:35:00", " Питолин А. В. ", "403/2", 0]
                ],
                "Saturday": [
                    [1, "Лекционные занятия Методы машинного обучения ", "8:00:00", "9:35:00", " Литвиненко Ю. В. ", "206/2", 0],
                    [2, "Лабораторные занятия Методы машинного обучения ", "9:45:00", "11:20:00", " Литвиненко Ю. В. ", "409/2", 1],
                    [2, "Лабораторные занятия Объектно-ориентированные базы данных ", "9:45:00", "11:20:00", " Муха В. В. ", "405/2", 2],
                    [3, "Лабораторные занятия Методы машинного обучения ", "11:30:00", "13:05:00", " Литвиненко Ю. В. ", "409/2", 1],
                    [3, "Лабораторные занятия Объектно-ориентированные базы данных ", "11:30:00", "13:05:00", " Муха В. В. ", "405/2", 2],
                    [4, "Лекционные занятия Объектно-ориентированные базы данных ", "13:30:00", "15:05:00", " Муха В. В. ", "405/2", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [1, "Лабораторные занятия Облачные технологии ", "8:00:00", "9:35:00", " Рындин Н. А. ", "409/2", 1],
                    [1, "Лабораторные занятия Имитационное моделирование процессов и систем ", "8:00:00", "9:35:00", " Воробьев Э. И. ", "403/2", 2],
                    [2, "Лабораторные занятия Облачные технологии ", "9:45:00", "11:20:00", " Рындин Н. А. ", "409/2", 1],
                    [2, "Лабораторные занятия Имитационное моделирование процессов и систем ", "9:45:00", "11:20:00", " Воробьев Э. И. ", "403/2", 2],
                    [3, "Лекционные занятия Цифровизация экономической деятельности ", "11:30:00", "13:05:00", " Кострова В. Н. ", "409/2", 0],
                    [4, "Лекционные занятия Имитационное моделирование процессов и систем ", "13:30:00", "15:05:00", " Воробьев Э. И. ", "407/2", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Лапинская И. П. ", "6252", 0]
                ],
                "Tuesday": [],
                "Wednesday": [],
                "Thursday": [
                    [2, "Лекционные занятия Облачные технологии ", "9:45:00", "11:20:00", " Рындин Н. А. ", "204/2", 0],
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Рындин Н. А. ", "303/2", 0],
                    [4, "Лекционные занятия Информационная безопасность и защита информации ", "13:30:00", "15:05:00", " Питолин А. В. ", "409/2", 0],
                    [5, "Лабораторные занятия Информационная безопасность и защита информации ", "15:15:00", "16:50:00", " Питолин А. В. ", "403/2", 1],
                    [5, "Лабораторные занятия Системы искусственного интеллекта ", "15:15:00", "16:50:00", " Гусев П. Ю. ", "405/2", 2],
                    [6, "Лабораторные занятия Информационная безопасность и защита информации ", "17:00:00", "18:35:00", " Питолин А. В. ", "403/2", 1],
                    [6, "Лабораторные занятия Системы искусственного интеллекта ", "17:00:00", "18:35:00", " Гусев П. Ю. ", "405/2", 2]
                ],
                "Friday": [
                    [3, "Лекционные занятия Системы искусственного интеллекта ", "11:30:00", "13:05:00", " Гусев П. Ю. ", "405/2", 0],
                    [4, "Лекционные занятия Управление проектами разработки информационных систем ", "13:30:00", "15:05:00", " Питолин А. В. ", "409/2", 0],
                    [5, "Лабораторные занятия Управление проектами разработки информационных систем ", "15:15:00", "16:50:00", " Питолин А. В. ", "403/2", 0],
                    [6, "Лабораторные занятия Управление проектами разработки информационных систем ", "17:00:00", "18:35:00", " Питолин А. В. ", "403/2", 0]
                ],
                "Saturday": [
                    [1, "Лекционные занятия Методы машинного обучения ", "8:00:00", "9:35:00", " Литвиненко Ю. В. ", "206/2", 0],
                    [2, "Лабораторные занятия Объектно-ориентированные базы данных ", "9:45:00", "11:20:00", " Муха В. В. ", "405/2", 1],
                    [2, "Лабораторные занятия Методы машинного обучения ", "9:45:00", "11:20:00", " Литвиненко Ю. В. ", "409/2", 2],
                    [3, "Лабораторные занятия Объектно-ориентированные базы данных ", "11:30:00", "13:05:00", " Муха В. В. ", "405/2", 1],
                    [3, "Лабораторные занятия Методы машинного обучения ", "11:30:00", "13:05:00", " Литвиненко Ю. В. ", "409/2", 2]
                ]
            }
        },
        "bRIS_221": {
            "Numerator": {
                "Monday": [
                    [4, "Лекционные занятия Методы проектирования компьютерных графмческих объектов ", "13:30:00", "15:05:00", " Короткевич С. И. ", "409/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Чекалина Н. В. ", "0000", 0]
                ],
                "Tuesday": [
                    [2, "Лабораторные занятия Проектирование сетевой ифраструктуры ", "9:45:00", "11:20:00", " Веркин С. С. ", "409/2", 0],
                    [3, "Лабораторные занятия Математические методы и алгоритмы оптимизации ", "11:30:00", "13:05:00", " Белецкая С. Ю. ", "406/2", 1],
                    [3, "Лабораторные занятия Проектирование сетевой ифраструктуры ", "11:30:00", "13:05:00", " Веркин С. С. ", "409/2", 2],
                    [4, "Лабораторные занятия Математические методы и алгоритмы оптимизации ", "13:30:00", "15:05:00", " Белецкая С. Ю. ", "406/2", 1],
                    [4, "Лабораторные занятия Проектирование сетевой ифраструктуры ", "13:30:00", "15:05:00", " Веркин С. С. ", "409/2", 2],
                    [5, "Практические занятия Профессиональная этика ", "15:15:00", "16:50:00", " Коваль Л. В. ", "112/2", 0]
                ],
                "Wednesday": [
                    [5, "Лекционные занятия Программирование на языке Python ", "15:15:00", "16:50:00", " Белецкая С. Ю. ", "406/2", 0],
                    [6, "Лекционные занятия Математические методы и алгоритмы оптимизации ", "17:00:00", "18:35:00", " Белецкая С. Ю. ", "406/2", 0]
                ],
                "Thursday": [
                    [1, "Лабораторные занятия Методы проектирования компьютерных графмческих объектов ", "8:00:00", "9:35:00", " Короткевич С. И. ", "407/2", 0],
                    [2, "Лабораторные занятия Методы проектирования компьютерных графмческих объектов ", "9:45:00", "11:20:00", " Короткевич С. И. ", "407/2", 0],
                    [3, "Лекционные занятия Технологическое предпринимательство ", "11:30:00", "13:05:00", " Наролина Т. С. ", "310/2", 0],
                    [4, "Практические занятия Проектная деятельность ", "13:30:00", "15:05:00", " Веркин С. С. ", "407/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Чекалина Н. В. ", "0000", 0]
                ],
                "Friday": [
                    [1, "Лабораторные занятия Системный анализ в проектировании информационных систем ", "8:00:00", "9:35:00", " Кострова В. Н. ", "406/2", 0],
                    [2, "Лабораторные занятия Системный анализ в проектировании информационных систем ", "9:45:00", "11:20:00", " Кострова В. Н. ", "406/2", 0],
                    [3, "Лабораторные занятия Программирование на языке Python ", "11:30:00", "13:05:00", " Белецкая С. Ю. ", "406/2", 0],
                    [4, "Лабораторные занятия Программирование на языке Python ", "13:30:00", "15:05:00", " Белецкая С. Ю. ", "406/2", 0]
                ],
                "Saturday": [
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Вохминцева А. В. ", "6258", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Вохминцева А. В. ", "6258", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [4, "Лекционные занятия Системный анализ в проектировании информационных систем ", "13:30:00", "15:05:00", " Кострова В. Н. ", "409/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Чекалина Н. В. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Лекционные занятия Профессиональная этика ", "17:00:00", "18:35:00", " Коваль Л. В. ", "3117", 0]
                ],
                "Tuesday": [
                    [2, "Лабораторные занятия Проектирование сетевой ифраструктуры ", "9:45:00", "11:20:00", " Веркин С. С. ", "409/2", 0],
                    [3, "Лабораторные занятия Проектирование сетевой ифраструктуры ", "11:30:00", "13:05:00", " Веркин С. С. ", "409/2", 1],
                    [3, "Лабораторные занятия Математические методы и алгоритмы оптимизации ", "11:30:00", "13:05:00", " Белецкая С. Ю. ", "406/2", 2],
                    [4, "Лабораторные занятия Проектирование сетевой ифраструктуры ", "13:30:00", "15:05:00", " Веркин С. С. ", "409/2", 1],
                    [4, "Лабораторные занятия Математические методы и алгоритмы оптимизации ", "13:30:00", "15:05:00", " Белецкая С. Ю. ", "406/2", 2]
                ],
                "Wednesday": [
                    [4, "Лекционные занятия Программирование на языке Python ", "13:30:00", "15:05:00", " Белецкая С. Ю. ", "406/2", 0],
                    [5, "Лекционные занятия Математические методы и алгоритмы оптимизации ", "15:15:00", "16:50:00", " Белецкая С. Ю. ", "406/2", 0],
                    [6, "Практические занятия Технологическое предпринимательство ", "17:00:00", "18:35:00", " Наролина Т. С. ", "111/2", 0],
                    [7, "Практические занятия Профессиональная этика ", "18:40:00", "20:05:00", " Коваль Л. В. ", "307/2", 0]
                ],
                "Thursday": [
                    [1, "Лабораторные занятия Методы проектирования компьютерных графмческих объектов ", "8:00:00", "9:35:00", " Короткевич С. И. ", "407/2", 0],
                    [2, "Лабораторные занятия Методы проектирования компьютерных графмческих объектов ", "9:45:00", "11:20:00", " Короткевич С. И. ", "407/2", 0],
                    [3, "Лекционные занятия Проектирование сетевой ифраструктуры ", "11:30:00", "13:05:00", " Веркин С. С. ", "407/2", 0],
                    [4, "Практические занятия Проектная деятельность ", "13:30:00", "15:05:00", " Веркин С. С. ", "407/2", 0]
                ],
                "Friday": [
                    [1, "Лабораторные занятия Системный анализ в проектировании информационных систем ", "8:00:00", "9:35:00", " Кострова В. Н. ", "406/2", 0],
                    [2, "Лабораторные занятия Системный анализ в проектировании информационных систем ", "9:45:00", "11:20:00", " Кострова В. Н. ", "406/2", 0],
                    [3, "Лабораторные занятия Программирование на языке Python ", "11:30:00", "13:05:00", " Белецкая С. Ю. ", "406/2", 0],
                    [4, "Лабораторные занятия Программирование на языке Python ", "13:30:00", "15:05:00", " Белецкая С. Ю. ", "406/2", 0]
                ],
                "Saturday": [
                    [6, "с 17:50 -до 19:25  Практические занятия Русский язык как иностранный ", "17:00:00", "18:35:00", " Вохминцева А. В. ", "6258", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык как иностранный ", "18:40:00", "20:05:00", " Вохминцева А. В. ", "6258", 0]
                ]
            }
        },
        "BT_201": {
            "Numerator": {
                "Monday": [],
                "Tuesday": [
                    [5, "Лекционные занятия Техническая защита информации ", "15:15:00", "16:50:00", " Дешина А. Е. ", "407/5", 0],
                    [6, "Лекционные занятия Метрология и стандартизация в СПЦЗС ", "17:00:00", "18:35:00", " Дешина А. Е. ", "407/5", 0]
                ],
                "Wednesday": [
                    [1, "Лабораторные занятия Архитектура построения и средства защиты СПЦС ", "8:00:00", "9:35:00", " Дешина А. Е. ", "404/5", 1],
                    [1, "Лабораторные занятия Метрология и стандартизация в СПЦЗС ", "8:00:00", "9:35:00", " Петрова Е. С. ", "201/5", 2],
                    [2, "Лабораторные занятия Архитектура построения и средства защиты СПЦС ", "9:45:00", "11:20:00", " Дешина А. Е. ", "404/5", 1],
                    [2, "Лабораторные занятия Метрология и стандартизация в СПЦЗС ", "9:45:00", "11:20:00", " Петрова Е. С. ", "201/5", 2],
                    [3, "Лекционные занятия Системы позиционирования подвижных объектов ", "11:30:00", "13:05:00", " Дешина А. Е. ", "408/5", 0]
                ],
                "Thursday": [
                    [5, "Практические занятия Психология социального взаимодействия ", "15:15:00", "16:50:00", " Аристова И. В. ", "312/2", 0],
                    [6, "Лабораторные занятия Системы позиционирования подвижных объектов ", "17:00:00", "18:35:00", " Петрова Е. С. ", "201/5", 1],
                    [6, "Лабораторные занятия Техническая защита информации ", "17:00:00", "18:35:00", " Дешина А. Е. ", "402/5", 2],
                    [7, "Лабораторные занятия Системы позиционирования подвижных объектов ", "18:40:00", "20:05:00", " Петрова Е. С. ", "201/5", 1],
                    [7, "Лабораторные занятия Техническая защита информации ", "18:40:00", "20:05:00", " Дешина А. Е. ", "402/5", 2]
                ],
                "Friday": [
                    [6, "Практические занятия Криптографические методы защиты информации ", "17:00:00", "18:35:00", " Мокроусов А. Н. ", "407/5", 0],
                    [7, "Лекционные занятия Криптографические методы защиты информации ", "18:40:00", "20:05:00", " Радько Н. М. ", "407/5", 0]
                ],
                "Saturday": [
                    [3, "Лабораторные занятия Проектирование защищенных телекоммуникационных систем ", "11:30:00", "13:05:00", " Морозов В. О. ", "201/5", 0],
                    [4, "Лабораторные занятия Проектирование защищенных телекоммуникационных систем ", "13:30:00", "15:05:00", " Морозов В. О. ", "201/5", 0],
                    [5, "Лекционные занятия Проектирование защищенных телекоммуникационных систем ", "15:15:00", "16:50:00", " Исаев О. В. ", "406/5", 0]
                ]
            },
            "Denominator": {
                "Monday": [],
                "Tuesday": [
                    [5, "Лекционные занятия Техническая защита информации ", "15:15:00", "16:50:00", " Дешина А. Е. ", "407/5", 0],
                    [6, "Лекционные занятия Метрология и стандартизация в СПЦЗС ", "17:00:00", "18:35:00", " Дешина А. Е. ", "407/5", 0]
                ],
                "Wednesday": [
                    [1, "Лабораторные занятия Метрология и стандартизация в СПЦЗС ", "8:00:00", "9:35:00", " Петрова Е. С. ", "201/5", 1],
                    [1, "Лабораторные занятия Архитектура построения и средства защиты СПЦС ", "8:00:00", "9:35:00", " Дешина А. Е. ", "404/5", 2],
                    [2, "Лабораторные занятия Метрология и стандартизация в СПЦЗС ", "9:45:00", "11:20:00", " Петрова Е. С. ", "201/5", 1],
                    [2, "Лабораторные занятия Архитектура построения и средства защиты СПЦС ", "9:45:00", "11:20:00", " Дешина А. Е. ", "404/5", 2],
                    [3, "Лекционные занятия Системы позиционирования подвижных объектов ", "11:30:00", "13:05:00", " Дешина А. Е. ", "408/5", 0]
                ],
                "Thursday": [
                    [4, "Лекционные занятия Психология социального взаимодействия ", "13:30:00", "15:05:00", " Аристова И. В. ", "308/1", 0],
                    [5, "Лекционные занятия Техническая защита информации ", "15:15:00", "16:50:00", " Дешина А. Е. ", "406/5", 0],
                    [6, "Лабораторные занятия Техническая защита информации ", "17:00:00", "18:35:00", " Дешина А. Е. ", "402/5", 1],
                    [6, "Лабораторные занятия Системы позиционирования подвижных объектов ", "17:00:00", "18:35:00", " Петрова Е. С. ", "201/5", 2],
                    [7, "Лабораторные занятия Техническая защита информации ", "18:40:00", "20:05:00", " Дешина А. Е. ", "402/5", 1],
                    [7, "Лабораторные занятия Системы позиционирования подвижных объектов ", "18:40:00", "20:05:00", " Петрова Е. С. ", "201/5", 2]
                ],
                "Friday": [
                    [5, "Лекционные занятия Архитектура построения и средства защиты СПЦС ", "15:15:00", "16:50:00", " Дешина А. Е. ", "308/1", 0],
                    [6, "Практические занятия Криптографические методы защиты информации ", "17:00:00", "18:35:00", " Мокроусов А. Н. ", "407/5", 0],
                    [7, "Лекционные занятия Криптографические методы защиты информации ", "18:40:00", "20:05:00", " Радько Н. М. ", "407/5", 0]
                ],
                "Saturday": [
                    [3, "Лабораторные занятия Проектирование защищенных телекоммуникационных систем ", "11:30:00", "13:05:00", " Морозов В. О. ", "201/5", 0],
                    [4, "Лабораторные занятия Проектирование защищенных телекоммуникационных систем ", "13:30:00", "15:05:00", " Морозов В. О. ", "201/5", 0],
                    [5, "Лекционные занятия Проектирование защищенных телекоммуникационных систем ", "15:15:00", "16:50:00", " Исаев О. В. ", "406/5", 0]
                ]
            }
        },
        "BT_211": {
            "Numerator": {
                "Monday": [
                    [2, "Практические занятия Анализ данных телекоммуникационных систем ", "9:45:00", "11:20:00", " Батаронов И. Л. ", "407/5", 0],
                    [3, "Лекционные занятия Защита информации от утечки по техническим каналам ", "11:30:00", "13:05:00", " Дешина А. Е. ", "408/5", 0],
                    [4, "Практические занятия Проектная деятельность ", "13:30:00", "15:05:00", " Остапенко А. Г. ", "408/5", 0],
                    [5, "Лекционные занятия Безопасность телекоммуникационных систем и сетей интернета вещей ", "15:15:00", "16:50:00", " Ермаков С. А. ", "0000", 0]
                ],
                "Tuesday": [],
                "Wednesday": [
                    [3, "Лабораторные занятия Безопасность телекоммуникационных систем и сетей интернета вещей ", "11:30:00", "13:05:00", " Ермаков С. А. ", "0000", 1],
                    [4, "Лекционные занятия Сети и системы передачи информации ", "13:30:00", "15:05:00", " Куликов С. С. ", "408/5", 0],
                    [5, "Лекционные занятия Безопасность распределенных телекоммуникационных систем ", "15:15:00", "16:50:00", " Дешина А. Е. ", "407/5", 0],
                    [6, "Лабораторные занятия Защита информации от утечки по техническим каналам ", "17:00:00", "18:35:00", " Дешина А. Е. ", "404/5", 0],
                    [7, "Лабораторные занятия Защита информации от утечки по техническим каналам ", "18:40:00", "20:05:00", " Дешина А. Е. ", "404/5", 0]
                ],
                "Thursday": [
                    [1, "Лабораторные занятия Сети и системы передачи информации ", "8:00:00", "9:35:00", " Куликов С. С. ", "402/5", 0],
                    [2, "Лабораторные занятия Сети и системы передачи информации ", "9:45:00", "11:20:00", " Куликов С. С. ", "402/5", 1],
                    [2, "Лабораторные занятия Безопасность распределенных телекоммуникационных систем ", "9:45:00", "11:20:00", " Петрова Е. С. ", "407/5", 2],
                    [3, "Лекционные занятия Анализ данных телекоммуникационных систем ", "11:30:00", "13:05:00", " Батаронов И. Л. ", "408/5", 0],
                    [4, "Лекционные занятия Математические методы теории сигналов и систем ", "13:30:00", "15:05:00", " Батаронов И. Л. ", "408/5", 0]
                ],
                "Friday": [
                    [6, "Лабораторные занятия Сети и системы передачи информации ", "17:00:00", "18:35:00", " Куликов С. С. ", "201/5", 0],
                    [7, "Лабораторные занятия Сети и системы передачи информации ", "18:40:00", "20:05:00", " Куликов С. С. ", "201/5", 0]
                ],
                "Saturday": [
                    [4, "Лекционные занятия Аппаратные средства телекоммуникационных систем ", "13:30:00", "15:05:00", " Исаев О. В. ", "408/5", 0],
                    [5, "Лекционные занятия Организационное и правовое обеспечение информационной безопасности ", "15:15:00", "16:50:00", " Паринова Л. В. ", "408/5", 0],
                    [6, "Лабораторные занятия Аппаратные средства телекоммуникационных систем ", "17:00:00", "18:35:00", " Морозов В. О. ", "201/5", 0],
                    [7, "Лабораторные занятия Аппаратные средства телекоммуникационных систем ", "18:40:00", "20:05:00", " Морозов В. О. ", "201/5", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [2, "Практические занятия Математические методы теории сигналов и систем ", "9:45:00", "11:20:00", " Батаронов И. Л. ", "407/5", 0],
                    [3, "Лекционные занятия Защита информации от утечки по техническим каналам ", "11:30:00", "13:05:00", " Дешина А. Е. ", "408/5", 0],
                    [4, "Практические занятия Проектная деятельность ", "13:30:00", "15:05:00", " Остапенко А. Г. ", "408/5", 0]
                ],
                "Tuesday": [],
                "Wednesday": [
                    [3, "Лабораторные занятия Безопасность телекоммуникационных систем и сетей интернета вещей ", "11:30:00", "13:05:00", " Ермаков С. А. ", "0000", 1],
                    [4, "Лекционные занятия Сети и системы передачи информации ", "13:30:00", "15:05:00", " Куликов С. С. ", "408/5", 0],
                    [5, "Лекционные занятия Безопасность распределенных телекоммуникационных систем ", "15:15:00", "16:50:00", " Дешина А. Е. ", "407/5", 0],
                    [6, "Лабораторные занятия Защита информации от утечки по техническим каналам ", "17:00:00", "18:35:00", " Дешина А. Е. ", "404/5", 0],
                    [7, "Лабораторные занятия Защита информации от утечки по техническим каналам ", "18:40:00", "20:05:00", " Дешина А. Е. ", "404/5", 0]
                ],
                "Thursday": [
                    [1, "Лабораторные занятия Сети и системы передачи информации ", "8:00:00", "9:35:00", " Куликов С. С. ", "402/5", 0],
                    [2, "Лабораторные занятия Безопасность распределенных телекоммуникационных систем ", "9:45:00", "11:20:00", " Петрова Е. С. ", "407/5", 1],
                    [2, "Лабораторные занятия Сети и системы передачи информации ", "9:45:00", "11:20:00", " Куликов С. С. ", "402/5", 2],
                    [3, "Лекционные занятия Анализ данных телекоммуникационных систем ", "11:30:00", "13:05:00", " Батаронов И. Л. ", "408/5", 0],
                    [4, "Лекционные занятия Математические методы теории сигналов и систем ", "13:30:00", "15:05:00", " Батаронов И. Л. ", "408/5", 0]
                ],
                "Friday": [
                    [6, "Лабораторные занятия Сети и системы передачи информации ", "17:00:00", "18:35:00", " Куликов С. С. ", "201/5", 0],
                    [7, "Лабораторные занятия Сети и системы передачи информации ", "18:40:00", "20:05:00", " Куликов С. С. ", "201/5", 0]
                ],
                "Saturday": [
                    [4, "Лекционные занятия Аппаратные средства телекоммуникационных систем ", "13:30:00", "15:05:00", " Исаев О. В. ", "408/5", 0],
                    [5, "Практические занятия Организационное и правовое обеспечение информационной безопасности ", "15:15:00", "16:50:00", " Паринова Л. В. ", "408/5", 0],
                    [6, "Лабораторные занятия Аппаратные средства телекоммуникационных систем ", "17:00:00", "18:35:00", " Морозов В. О. ", "201/5", 0],
                    [7, "Лабораторные занятия Аппаратные средства телекоммуникационных систем ", "18:40:00", "20:05:00", " Морозов В. О. ", "201/5", 0]
                ]
            }
        },
        "BT_221": {
            "Numerator": {
                "Monday": [
                    [3, "Лекционные занятия Теория электросвязи ", "11:30:00", "13:05:00", " Гречишкин А. В. ", "0000", 0],
                    [4, "Лекционные занятия Цифровая обработка сигналов ", "13:30:00", "15:05:00", " Ермаков С. А. ", "0000", 0]
                ],
                "Tuesday": [
                    [1, "Лекционные занятия Теория вероятностей и математическая статистика ", "8:00:00", "9:35:00", " Шелковой А. Н. ", "410/5", 0],
                    [2, "Практические занятия Проектная деятельность ", "9:45:00", "11:20:00", " Остапенко А. Г. ", "410/5", 0],
                    [3, "Лабораторные занятия Цифровая обработка сигналов ", "11:30:00", "13:05:00", " Ермаков С. А. ", "0000", 0],
                    [4, "Лабораторные занятия Цифровая обработка сигналов ", "13:30:00", "15:05:00", " Ермаков С. А. ", "0000", 0]
                ],
                "Wednesday": [],
                "Thursday": [
                    [2, "Лабораторные занятия Теория электросвязи ", "9:45:00", "11:20:00", " Гречишкин А. В. ", "0000", 0],
                    [3, "Лабораторные занятия Теория электросвязи ", "11:30:00", "13:05:00", " Гречишкин А. В. ", "0000", 0],
                    [4, "с 14:20 -до 15:55  Лекционные занятия Антенны и распространение радиоволн ", "13:30:00", "15:05:00", " Зеленин И. А. ", "2245", 0]
                ],
                "Friday": [
                    [1, "Практические занятия Теория вероятностей и математическая статистика ", "8:00:00", "9:35:00", " Шелковой А. Н. ", "410/5", 0],
                    [2, "Лекционные занятия Физические основы защиты информации ", "9:45:00", "11:20:00", " Пахомова А. С. ", "410/5", 0],
                    [3, "с 12:00 -до 13:35  Лабораторные занятия Антенны и распространение радиоволн ", "11:30:00", "13:05:00", " Сафонов К. С. ", "7520", 0]
                ],
                "Saturday": [
                    [2, "Практические занятия Элективные дисциплины  по физической культуре и спорту ( Туманцев К. В. )", "9:45:00", "11:20:00", "модули", "0000", 0],
                    [3, "Практические занятия Профессиональная этика ", "11:30:00", "13:05:00", " Коваль Л. В. ", "311/1", 0],
                    [4, "Практические занятия Физические основы защиты информации ", "13:30:00", "15:05:00", " Пахомова А. С. ", "410/5", 0],
                    [5, "Лекционные занятия Профессиональная этика ", "15:15:00", "16:50:00", " Коваль Л. В. ", "327/1", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [2, "Практические занятия Элективные дисциплины  по физической культуре и спорту ( Туманцев К. В. )", "9:45:00", "11:20:00", "модули", "0000", 0],
                    [3, "Лекционные занятия Теория электросвязи ", "11:30:00", "13:05:00", " Гречишкин А. В. ", "0000", 0],
                    [4, "Лекционные занятия Цифровая обработка сигналов ", "13:30:00", "15:05:00", " Ермаков С. А. ", "0000", 0]
                ],
                "Tuesday": [
                    [1, "Лекционные занятия Теория вероятностей и математическая статистика ", "8:00:00", "9:35:00", " Шелковой А. Н. ", "410/5", 0],
                    [2, "Практические занятия Проектная деятельность ", "9:45:00", "11:20:00", " Остапенко А. Г. ", "410/5", 0],
                    [3, "Лабораторные занятия Теория электросвязи ", "11:30:00", "13:05:00", " Гречишкин А. В. ", "0000", 0],
                    [4, "Лабораторные занятия Теория электросвязи ", "13:30:00", "15:05:00", " Гречишкин А. В. ", "0000", 0]
                ],
                "Wednesday": [],
                "Thursday": [
                    [2, "Лабораторные занятия Цифровая обработка сигналов ", "9:45:00", "11:20:00", " Ермаков С. А. ", "0000", 0],
                    [3, "Лабораторные занятия Цифровая обработка сигналов ", "11:30:00", "13:05:00", " Ермаков С. А. ", "0000", 0],
                    [4, "с 14:20 -до 15:55  Лекционные занятия Антенны и распространение радиоволн ", "13:30:00", "15:05:00", " Зеленин И. А. ", "2245", 0]
                ],
                "Friday": [
                    [1, "Практические занятия Теория вероятностей и математическая статистика ", "8:00:00", "9:35:00", " Шелковой А. Н. ", "410/5", 0],
                    [2, "Лекционные занятия Физические основы защиты информации ", "9:45:00", "11:20:00", " Пахомова А. С. ", "410/5", 0],
                    [3, "с 12:00 -до 13:35  Лабораторные занятия Антенны и распространение радиоволн ", "11:30:00", "13:05:00", " Сафонов К. С. ", "7520", 0]
                ],
                "Saturday": [
                    [2, "Практические занятия Элективные дисциплины  по физической культуре и спорту ( Туманцев К. В. )", "9:45:00", "11:20:00", "модули", "0000", 0],
                    [3, "Практические занятия Профессиональная этика ", "11:30:00", "13:05:00", " Коваль Л. В. ", "311/1", 0],
                    [4, "Практические занятия Физические основы защиты информации ", "13:30:00", "15:05:00", " Пахомова А. С. ", "410/5", 0]
                ]
            }
        },
        "BT_231": {
            "Numerator": {
                "Monday": [
                    [1, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "8:00:00", "9:35:00", " Туманцев К. В. ", "0000", 0],
                    [2, "Лекционные занятия Физика ", "9:45:00", "11:20:00", " Тураева Т. Л. ", "327/1", 0],
                    [3, "Лекционные занятия Математический анализ ", "11:30:00", "13:05:00", " Кострюков С. А. ", "406/5", 0],
                    [4, "Лекционные занятия Дискретная математика ", "13:30:00", "15:05:00", " Ююкин Н. А. ", "308/1", 0]
                ],
                "Tuesday": [
                    [3, "Практические занятия Дискретная математика ", "11:30:00", "13:05:00", " Ююкин Н. А. ", "410/5", 0],
                    [4, "Лекционные занятия Дискретная математика ", "13:30:00", "15:05:00", " Ююкин Н. А. ", "220/1", 0],
                    [5, "Практические занятия Экономика ", "15:15:00", "16:50:00", " Голубь Н. Н. ", "111/2", 0]
                ],
                "Wednesday": [
                    [2, "Лабораторные занятия Языки программирования ", "9:45:00", "11:20:00", " Москалева Е. А. ", "402/5", 0],
                    [3, "Лабораторные занятия Информационные технологии ", "11:30:00", "13:05:00", " Пахомова А. С. ", "404/5", 1],
                    [3, "Лабораторные занятия Языки программирования ", "11:30:00", "13:05:00", " Москалева Е. А. ", "402/5", 2],
                    [4, "Лабораторные занятия Информационные технологии ", "13:30:00", "15:05:00", " Пахомова А. С. ", "404/5", 1],
                    [4, "Лабораторные занятия Языки программирования ", "13:30:00", "15:05:00", " Москалева Е. А. ", "402/5", 2]
                ],
                "Thursday": [
                    [2, "Практические занятия Философия ", "9:45:00", "11:20:00", " Назаренко К. С. ", "301/1", 0],
                    [3, "Лабораторные занятия Физика ", "11:30:00", "13:05:00", " Тураева Т. Л. ", "319/1", 0],
                    [3, "Лабораторные занятия Физика ", "11:30:00", "13:05:00", " Ремизова О. И. ", "0000", 0],
                    [4, "Лекционные занятия Дискретная математика ", "13:30:00", "15:05:00", " Ююкин Н. А. ", "407/5", 0]
                ],
                "Friday": [
                    [3, "Лекционные занятия Информационные технологии ", "11:30:00", "13:05:00", " Пахомова А. С. ", "407/5", 0],
                    [4, "Практические занятия Физика ", "13:30:00", "15:05:00", " Тураева Т. Л. ", "322/1", 0],
                    [5, "Лабораторные занятия Языки программирования ", "15:15:00", "16:50:00", " Москалева Е. А. ", "402/5", 0]
                ],
                "Saturday": [
                    [3, "Лекционные занятия Электроника и схемотехника ", "11:30:00", "13:05:00", " Исаев О. В. ", "410/5", 0],
                    [4, "Лекционные занятия Языки программирования ", "13:30:00", "15:05:00", " Кольцов А. С. ", "406/5", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [1, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "8:00:00", "9:35:00", " Туманцев К. В. ", "0000", 0],
                    [2, "Лекционные занятия Физика ", "9:45:00", "11:20:00", " Тураева Т. Л. ", "327/1", 0],
                    [3, "Лекционные занятия Математический анализ ", "11:30:00", "13:05:00", " Кострюков С. А. ", "406/5", 0],
                    [4, "Практические занятия Математический анализ ", "13:30:00", "15:05:00", " Кострюков С. А. ", "301/1", 0]
                ],
                "Tuesday": [
                    [3, "Практические занятия Дискретная математика ", "11:30:00", "13:05:00", " Ююкин Н. А. ", "410/5", 0],
                    [4, "Лекционные занятия Философия ", "13:30:00", "15:05:00", " Назаренко К. С. ", "311/2", 0],
                    [5, "Лекционные занятия Экономика ", "15:15:00", "16:50:00", " Голубь Н. Н. ", "206/2", 0]
                ],
                "Wednesday": [
                    [2, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "9:45:00", "11:20:00", " Туманцев К. В. ", "0000", 0],
                    [3, "Лабораторные занятия Электроника и схемотехника ", "11:30:00", "13:05:00", " Морозов В. О. ", "402/5", 1],
                    [3, "Лабораторные занятия Информационные технологии ", "11:30:00", "13:05:00", " Пахомова А. С. ", "404/5", 2],
                    [4, "Лабораторные занятия Электроника и схемотехника ", "13:30:00", "15:05:00", " Морозов В. О. ", "402/5", 1],
                    [4, "Лабораторные занятия Информационные технологии ", "13:30:00", "15:05:00", " Пахомова А. С. ", "404/5", 2]
                ],
                "Thursday": [],
                "Friday": [
                    [3, "Лекционные занятия Информационные технологии ", "11:30:00", "13:05:00", " Пахомова А. С. ", "407/5", 0],
                    [4, "Практические занятия Физика ", "13:30:00", "15:05:00", " Тураева Т. Л. ", "322/1", 0],
                    [5, "Лабораторные занятия Языки программирования ", "15:15:00", "16:50:00", " Москалева Е. А. ", "402/5", 0],
                    [6, "Лабораторные занятия Языки программирования ", "17:00:00", "18:35:00", " Москалева Е. А. ", "402/5", 0]
                ],
                "Saturday": [
                    [1, "Лабораторные занятия Электроника и схемотехника ", "8:00:00", "9:35:00", " Исаев О. В. ", "402/5", 0],
                    [2, "Лабораторные занятия Электроника и схемотехника ", "9:45:00", "11:20:00", " Исаев О. В. ", "402/5", 0],
                    [3, "Лекционные занятия Электроника и схемотехника ", "11:30:00", "13:05:00", " Исаев О. В. ", "410/5", 0],
                    [4, "Лекционные занятия Языки программирования ", "13:30:00", "15:05:00", " Кольцов А. С. ", "406/5", 0]
                ]
            }
        },
        "bVM_211": {
            "Numerator": {
                "Monday": [
                    [3, "Лекционные занятия Теория информационно-управляющих вычислительных систем ", "11:30:00", "13:05:00", " Нужный А. М. ", "415/2", 0],
                    [4, "Лекционные занятия Программирование в графических системах ", "13:30:00", "15:05:00", " Нужный А. М. ", "415/2", 0],
                    [5, "Лабораторные занятия Теория информационно-управляющих вычислительных систем ", "15:15:00", "16:50:00", " Нужный А. М. ", "415/2", 0],
                    [6, "Лабораторные занятия Теория информационно-управляющих вычислительных систем ", "17:00:00", "18:35:00", " Нужный А. М. ", "415/2", 0]
                ],
                "Tuesday": [
                    [1, "Лабораторные занятия Программирование в 1 С ", "8:00:00", "9:35:00", " Гребенникова Н. И. ", "419/2", 1],
                    [1, "Лабораторные занятия Программирование в графических системах ", "8:00:00", "9:35:00", " Нужный А. М. ", "415/2", 2],
                    [2, "Лабораторные занятия Программирование в 1 С ", "9:45:00", "11:20:00", " Гребенникова Н. И. ", "419/2", 1],
                    [2, "Лабораторные занятия Программирование в графических системах ", "9:45:00", "11:20:00", " Нужный А. М. ", "415/2", 2],
                    [3, "Лекционные занятия Автоматизация проектирования вычислительных систем ", "11:30:00", "13:05:00", " Барабанов В. Ф. ", "412/2", 0],
                    [4, "Лекционные занятия Программирование в 1 С ", "13:30:00", "15:05:00", " Гребенникова Н. И. ", "412/2", 0]
                ],
                "Wednesday": [],
                "Thursday": [
                    [2, "Лекционные занятия Микропроцессорные системы ", "9:45:00", "11:20:00", " Петрухнова Г. В. ", "412/2", 0],
                    [3, "Лабораторные занятия Микропроцессорные системы ", "11:30:00", "13:05:00", " Петрухнова Г. В. ", "412/2", 1],
                    [3, "Лабораторные занятия Защита информации ", "11:30:00", "13:05:00", " Сафронов В. В. ", "408/2", 2],
                    [4, "Лабораторные занятия Микропроцессорные системы ", "13:30:00", "15:05:00", " Петрухнова Г. В. ", "412/2", 1],
                    [4, "Лабораторные занятия Защита информации ", "13:30:00", "15:05:00", " Сафронов В. В. ", "408/2", 2]
                ],
                "Friday": [
                    [1, "Лабораторные занятия Проектирование и разработка веб-приложений ", "8:00:00", "9:35:00", " Сергеев М. Ю. ", "412/2", 0],
                    [2, "Лабораторные занятия Проектирование и разработка веб-приложений ", "9:45:00", "11:20:00", " Сергеев М. Ю. ", "412/2", 0],
                    [3, "Лекционные занятия Проектирование и разработка веб-приложений ", "11:30:00", "13:05:00", " Сергеев М. Ю. ", "412/2", 0],
                    [4, "Практические занятия Проектная деятельность ", "13:30:00", "15:05:00", " Сафронов В. В. ", "412/2", 0],
                    [5, "Лабораторные занятия Автоматизация проектирования вычислительных систем ", "15:15:00", "16:50:00", " Аралов М. Н. ", "415/2", 0],
                    [6, "Лабораторные занятия Автоматизация проектирования вычислительных систем ", "17:00:00", "18:35:00", " Аралов М. Н. ", "415/2", 0]
                ],
                "Saturday": []
            },
            "Denominator": {
                "Monday": [
                    [3, "Лекционные занятия Теория информационно-управляющих вычислительных систем ", "11:30:00", "13:05:00", " Нужный А. М. ", "415/2", 0],
                    [4, "Лекционные занятия Программирование в графических системах ", "13:30:00", "15:05:00", " Нужный А. М. ", "415/2", 0],
                    [5, "Лабораторные занятия Теория информационно-управляющих вычислительных систем ", "15:15:00", "16:50:00", " Нужный А. М. ", "415/2", 0],
                    [6, "Лабораторные занятия Теория информационно-управляющих вычислительных систем ", "17:00:00", "18:35:00", " Нужный А. М. ", "415/2", 0]
                ],
                "Tuesday": [
                    [1, "Лабораторные занятия Программирование в графических системах ", "8:00:00", "9:35:00", " Нужный А. М. ", "415/2", 1],
                    [1, "Лабораторные занятия Программирование в 1 С ", "8:00:00", "9:35:00", " Гребенникова Н. И. ", "419/2", 2],
                    [2, "Лабораторные занятия Программирование в графических системах ", "9:45:00", "11:20:00", " Нужный А. М. ", "415/2", 1],
                    [2, "Лабораторные занятия Программирование в 1 С ", "9:45:00", "11:20:00", " Гребенникова Н. И. ", "419/2", 2],
                    [3, "Лекционные занятия Автоматизация проектирования вычислительных систем ", "11:30:00", "13:05:00", " Барабанов В. Ф. ", "412/2", 0],
                    [4, "Лекционные занятия Защита информации ", "13:30:00", "15:05:00", " Сафронов В. В. ", "412/2", 0]
                ],
                "Wednesday": [],
                "Thursday": [
                    [2, "Лекционные занятия Микропроцессорные системы ", "9:45:00", "11:20:00", " Петрухнова Г. В. ", "412/2", 0],
                    [3, "Лабораторные занятия Защита информации ", "11:30:00", "13:05:00", " Сафронов В. В. ", "408/2", 1],
                    [3, "Лабораторные занятия Микропроцессорные системы ", "11:30:00", "13:05:00", " Петрухнова Г. В. ", "412/2", 2],
                    [4, "Лабораторные занятия Защита информации ", "13:30:00", "15:05:00", " Сафронов В. В. ", "408/2", 1],
                    [4, "Лабораторные занятия Микропроцессорные системы ", "13:30:00", "15:05:00", " Петрухнова Г. В. ", "412/2", 2]
                ],
                "Friday": [
                    [1, "Лабораторные занятия Проектирование и разработка веб-приложений ", "8:00:00", "9:35:00", " Сергеев М. Ю. ", "412/2", 0],
                    [2, "Лабораторные занятия Проектирование и разработка веб-приложений ", "9:45:00", "11:20:00", " Сергеев М. Ю. ", "412/2", 0],
                    [3, "Лекционные занятия Проектирование и разработка веб-приложений ", "11:30:00", "13:05:00", " Сергеев М. Ю. ", "412/2", 0],
                    [4, "Практические занятия Проектная деятельность ", "13:30:00", "15:05:00", " Сафронов В. В. ", "412/2", 0],
                    [5, "Лабораторные занятия Автоматизация проектирования вычислительных систем ", "15:15:00", "16:50:00", " Аралов М. Н. ", "415/2", 0],
                    [6, "Лабораторные занятия Автоматизация проектирования вычислительных систем ", "17:00:00", "18:35:00", " Аралов М. Н. ", "415/2", 0]
                ],
                "Saturday": []
            }
        },
        "bVM_221": {
            "Numerator": {
                "Monday": [
                    [4, "Лекционные занятия Технологическое предпринимательство ", "13:30:00", "15:05:00", " Наролина Т. С. ", "206/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Мужаровская М. Н. ", "0000", 0],
                    [6, "с 17:50 -до 19:25  Лекционные занятия Профессиональная этика ", "17:00:00", "18:35:00", " Слепцова А. О. ", "3113", 0]
                ],
                "Tuesday": [
                    [3, "Лекционные занятия Современные технологии программирования ", "11:30:00", "13:05:00", " Нужный А. М. ", "417/2", 0],
                    [4, "Лекционные занятия Моделирование ", "13:30:00", "15:05:00", " Олейникова С. А. ", "419/2", 0],
                    [5, "Практические занятия Проектная деятельность ", "15:15:00", "16:50:00", " Петрухнова Г. В. ", "412/2", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Профессиональная этика ", "17:00:00", "18:35:00", " Слепцова А. О. ", "5313", 0]
                ],
                "Wednesday": [
                    [1, "Лабораторные занятия Теория автоматов ", "8:00:00", "9:35:00", " Акинина Ю. С. ", "412/2", 0],
                    [2, "Лабораторные занятия Теория автоматов ", "9:45:00", "11:20:00", " Акинина Ю. С. ", "412/2", 0],
                    [3, "Лекционные занятия Теория автоматов ", "11:30:00", "13:05:00", " Акинина Ю. С. ", "412/2", 0],
                    [4, "Лекционные занятия Веб-дизайн ", "13:30:00", "15:05:00", " Сергеев М. Ю. ", "415/2", 0]
                ],
                "Thursday": [
                    [2, "Лабораторные занятия Веб-дизайн ", "9:45:00", "11:20:00", " Сергеев М. Ю. ", "415/2", 0],
                    [3, "Лабораторные занятия Веб-дизайн ", "11:30:00", "13:05:00", " Сергеев М. Ю. ", "415/2", 1],
                    [3, "Лабораторные занятия Моделирование ", "11:30:00", "13:05:00", " Олейникова С. А. ", "419/2", 2],
                    [4, "Лабораторные занятия Веб-дизайн ", "13:30:00", "15:05:00", " Сергеев М. Ю. ", "415/2", 1],
                    [4, "Лабораторные занятия Моделирование ", "13:30:00", "15:05:00", " Олейникова С. А. ", "419/2", 2],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Мужаровская М. Н. ", "0000", 0]
                ],
                "Friday": [],
                "Saturday": [
                    [3, "Лабораторные занятия Современные технологии программирования ", "11:30:00", "13:05:00", " Коваленко С. А. ", "419/2", 0],
                    [4, "Лабораторные занятия Современные технологии программирования ", "13:30:00", "15:05:00", " Коваленко С. А. ", "419/2", 0],
                    [5, "Лабораторные занятия Программирование мобильных платформ ", "15:15:00", "16:50:00", " Черников В. Н. ", "408/2", 1],
                    [5, "Лабораторные занятия Современные технологии программирования ", "15:15:00", "16:50:00", " Коваленко С. А. ", "419/2", 2]
                ]
            },
            "Denominator": {
                "Monday": [
                    [4, "Практические занятия Технологическое предпринимательство ", "13:30:00", "15:05:00", " Наролина Т. С. ", "206/2", 0],
                    [5, "с 16:05 -до 17:40  Практические занятия Элективные дисциплины по физической культуре и спорту ", "15:15:00", "16:50:00", " Мужаровская М. Н. ", "0000", 0]
                ],
                "Tuesday": [
                    [3, "Лекционные занятия Современные технологии программирования ", "11:30:00", "13:05:00", " Нужный А. М. ", "417/2", 0],
                    [4, "Лекционные занятия Моделирование ", "13:30:00", "15:05:00", " Олейникова С. А. ", "419/2", 0],
                    [5, "Практические занятия Проектная деятельность ", "15:15:00", "16:50:00", " Петрухнова Г. В. ", "412/2", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Профессиональная этика ", "17:00:00", "18:35:00", " Слепцова А. О. ", "5313", 0]
                ],
                "Wednesday": [
                    [1, "Лабораторные занятия Теория автоматов ", "8:00:00", "9:35:00", " Акинина Ю. С. ", "412/2", 0],
                    [2, "Лабораторные занятия Теория автоматов ", "9:45:00", "11:20:00", " Акинина Ю. С. ", "412/2", 0]
                ],
                "Thursday": [
                    [2, "Лабораторные занятия Веб-дизайн ", "9:45:00", "11:20:00", " Сергеев М. Ю. ", "415/2", 0],
                    [3, "Лабораторные занятия Моделирование ", "11:30:00", "13:05:00", " Олейникова С. А. ", "419/2", 1],
                    [3, "Лабораторные занятия Веб-дизайн ", "11:30:00", "13:05:00", " Сергеев М. Ю. ", "415/2", 2],
                    [4, "Лабораторные занятия Моделирование ", "13:30:00", "15:05:00", " Олейникова С. А. ", "419/2", 1],
                    [4, "Лабораторные занятия Веб-дизайн ", "13:30:00", "15:05:00", " Сергеев М. Ю. ", "415/2", 2],
                    [5, "Лекционные занятия Веб-дизайн ", "15:15:00", "16:50:00", " Сергеев М. Ю. ", "415/2", 0]
                ],
                "Friday": [],
                "Saturday": [
                    [2, "Лабораторные занятия Современные технологии программирования ", "9:45:00", "11:20:00", " Коваленко С. А. ", "419/2", 0],
                    [3, "Лабораторные занятия Современные технологии программирования ", "11:30:00", "13:05:00", " Коваленко С. А. ", "419/2", 0],
                    [4, "Лабораторные занятия Современные технологии программирования ", "13:30:00", "15:05:00", " Коваленко С. А. ", "419/2", 1],
                    [4, "Лабораторные занятия Программирование мобильных платформ ", "13:30:00", "15:05:00", " Черников В. Н. ", "408/2", 2],
                    [5, "Лекционные занятия Программирование мобильных платформ ", "15:15:00", "16:50:00", " Черников В. Н. ", "408/2", 0]
                ]
            }
        },
        "IB_201": {
            "Numerator": {
                "Monday": [
                    [1, "Лекционные занятия Техническая защита информации ", "8:00:00", "9:35:00", " Дешина А. Е. ", "407/5", 0],
                    [2, "Лекционные занятия Управление рисками в распределённых информационных системах ", "9:45:00", "11:20:00", " Дешина А. Е. ", "408/5", 0],
                    [3, "Лабораторные занятия Управление рисками в распределённых информационных системах ", "11:30:00", "13:05:00", " Петрова Е. С. ", "402/5", 0],
                    [4, "Лабораторные занятия Управление рисками в распределённых информационных системах ", "13:30:00", "15:05:00", " Петрова Е. С. ", "402/5", 0]
                ],
                "Tuesday": [
                    [4, "Лекционные занятия Технология построения защищённых распределённых приложений ", "13:30:00", "15:05:00", " Дешина А. Е. ", "410/5", 0],
                    [5, "Лабораторные занятия Техническая защита информации ", "15:15:00", "16:50:00", " Петрова Е. С. ", "201/5", 0],
                    [6, "Лабораторные занятия Техническая защита информации ", "17:00:00", "18:35:00", " Петрова Е. С. ", "201/5", 0]
                ],
                "Wednesday": [
                    [5, "Лабораторные занятия Техническая защита информации ", "15:15:00", "16:50:00", " Петрова Е. С. ", "402/5", 0],
                    [6, "Лабораторные занятия Технология построения защищённых распределённых приложений ", "17:00:00", "18:35:00", " Петрова Е. С. ", "402/5", 0]
                ],
                "Thursday": [],
                "Friday": [
                    [5, "Лекционные занятия Программно-аппаратные средства обеспечения информационной безопасности ", "15:15:00", "16:50:00", " Белоножкин В. И. ", "201/5", 0],
                    [6, "Лекционные занятия Информационное противоборство в мультисетевом пространстве ", "17:00:00", "18:35:00", " Дешина А. Е. ", "410/5", 0],
                    [7, "Лекционные занятия Разработка и эксплуатация защищенных автоматизированных систем ", "18:40:00", "20:05:00", " Чопоров О. Н. ", "410/5", 0]
                ],
                "Saturday": [
                    [3, "Лекционные занятия Разработка и эксплуатация защищенных автоматизированных систем ", "11:30:00", "13:05:00", " Чопоров О. Н. ", "308/1", 0],
                    [4, "Лекционные занятия Управление информационной безопасностью ", "13:30:00", "15:05:00", " Чопоров О. Н. ", "308/1", 0],
                    [5, "Лабораторные занятия Разработка и эксплуатация защищенных автоматизированных систем ", "15:15:00", "16:50:00", " Ярмонов М. И. ", "404/5", 1],
                    [5, "Лабораторные занятия Программно-аппаратные средства обеспечения информационной безопасности ", "15:15:00", "16:50:00", " Чапурин Е. Ю. ", "201/5", 2],
                    [6, "Лабораторные занятия Разработка и эксплуатация защищенных автоматизированных систем ", "17:00:00", "18:35:00", " Ярмонов М. И. ", "404/5", 0],
                    [7, "Лабораторные занятия Управление информационной безопасностью ", "18:40:00", "20:05:00", " Ярмонов М. И. ", "404/5", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [1, "Лекционные занятия Техническая защита информации ", "8:00:00", "9:35:00", " Дешина А. Е. ", "407/5", 0],
                    [2, "Лекционные занятия Управление рисками в распределённых информационных системах ", "9:45:00", "11:20:00", " Дешина А. Е. ", "408/5", 0],
                    [3, "Лабораторные занятия Управление рисками в распределённых информационных системах ", "11:30:00", "13:05:00", " Петрова Е. С. ", "402/5", 0],
                    [4, "Лабораторные занятия Управление рисками в распределённых информационных системах ", "13:30:00", "15:05:00", " Петрова Е. С. ", "402/5", 0]
                ],
                "Tuesday": [
                    [4, "Практические занятия Информационное противоборство в мультисетевом пространстве ", "13:30:00", "15:05:00", " Петрова Е. С. ", "410/5", 0],
                    [5, "Лабораторные занятия Техническая защита информации ", "15:15:00", "16:50:00", " Петрова Е. С. ", "201/5", 0],
                    [6, "Лабораторные занятия Техническая защита информации ", "17:00:00", "18:35:00", " Петрова Е. С. ", "201/5", 0]
                ],
                "Wednesday": [
                    [5, "Лабораторные занятия Техническая защита информации ", "15:15:00", "16:50:00", " Петрова Е. С. ", "402/5", 0],
                    [6, "Лабораторные занятия Технология построения защищённых распределённых приложений ", "17:00:00", "18:35:00", " Петрова Е. С. ", "402/5", 0]
                ],
                "Thursday": [
                    [3, "Лекционные занятия Программно-аппаратные средства обеспечения информационной безопасности ", "11:30:00", "13:05:00", " Белоножкин В. И. ", "301/1", 0],
                    [4, "Лекционные занятия Психология социального взаимодействия ", "13:30:00", "15:05:00", " Аристова И. В. ", "308/1", 0],
                    [5, "Практические занятия Психология социального взаимодействия ", "15:15:00", "16:50:00", " Аристова И. В. ", "308/1", 0]
                ],
                "Friday": [
                    [5, "Лекционные занятия Программно-аппаратные средства обеспечения информационной безопасности ", "15:15:00", "16:50:00", " Белоножкин В. И. ", "201/5", 0],
                    [6, "Лекционные занятия Информационное противоборство в мультисетевом пространстве ", "17:00:00", "18:35:00", " Дешина А. Е. ", "408/5", 0],
                    [7, "Практические занятия Программно-аппаратные средства обеспечения информационной безопасности ", "18:40:00", "20:05:00", " Чапурин Е. Ю. ", "410/5", 0]
                ],
                "Saturday": [
                    [3, "Лекционные занятия Разработка и эксплуатация защищенных автоматизированных систем ", "11:30:00", "13:05:00", " Чопоров О. Н. ", "308/1", 0],
                    [4, "Лекционные занятия Управление информационной безопасностью ", "13:30:00", "15:05:00", " Чопоров О. Н. ", "308/1", 0],
                    [5, "Лабораторные занятия Программно-аппаратные средства обеспечения информационной безопасности ", "15:15:00", "16:50:00", " Чапурин Е. Ю. ", "201/5", 1],
                    [5, "Лабораторные занятия Разработка и эксплуатация защищенных автоматизированных систем ", "15:15:00", "16:50:00", " Ярмонов М. И. ", "404/5", 2],
                    [6, "Лабораторные занятия Разработка и эксплуатация защищенных автоматизированных систем ", "17:00:00", "18:35:00", " Ярмонов М. И. ", "404/5", 0],
                    [7, "Лабораторные занятия Управление информационной безопасностью ", "18:40:00", "20:05:00", " Ярмонов М. И. ", "404/5", 0]
                ]
            }
        },
        "IB_231": {
            "Numerator": {
                "Monday": [
                    [2, "Лекционные занятия Физика ", "9:45:00", "11:20:00", " Тураева Т. Л. ", "327/1", 0],
                    [3, "Практические занятия Физика ", "11:30:00", "13:05:00", " Тураева Т. Л. ", "322/1", 0],
                    [4, "Лекционные занятия Организация ЭВМ и вычислительных систем ", "13:30:00", "15:05:00", " Щеголеватых А. С. ", "410/5", 0],
                    [5, "Практические занятия Математический анализ ", "15:15:00", "16:50:00", " Батаронов И. Л. ", "410/5", 0]
                ],
                "Tuesday": [
                    [2, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "9:45:00", "11:20:00", " Вялых Н. Н. ", "0000", 0],
                    [4, "Лекционные занятия Экономика ", "13:30:00", "15:05:00", " Голубь Н. Н. ", "301/2", 0],
                    [5, "Практические занятия Алгебра и геометрия ", "15:15:00", "16:50:00", " Дорохова О. А. ", "204/2", 0]
                ],
                "Wednesday": [
                    [2, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "9:45:00", "11:20:00", " Вялых Н. Н. ", "0000", 0],
                    [4, "Лекционные занятия Теория графов и ее приложения ", "13:30:00", "15:05:00", " Шелковой А. Н. ", "410/5", 0]
                ],
                "Thursday": [
                    [1, "Лабораторные занятия Электроника и схемотехника ", "8:00:00", "9:35:00", " Щеголеватых А. С. ", "404/5", 0],
                    [2, "Лабораторные занятия Электроника и схемотехника ", "9:45:00", "11:20:00", " Щеголеватых А. С. ", "404/5", 0]
                ],
                "Friday": [
                    [4, "Лекционные занятия Математический анализ ", "13:30:00", "15:05:00", " Батаронов И. Л. ", "301/1", 0],
                    [5, "Лекционные занятия Электроника и схемотехника ", "15:15:00", "16:50:00", " Щеголеватых А. С. ", "407/5", 0],
                    [6, "Лабораторные занятия Организация ЭВМ и вычислительных систем ", "17:00:00", "18:35:00", " Щеголеватых А. С. ", "404/5", 0]
                ],
                "Saturday": [
                    [1, "Лабораторные занятия Языки программирования ", "8:00:00", "9:35:00", " Кольцов А. С. ", "402/5", 1],
                    [1, "Лабораторные занятия Электроника и схемотехника ", "8:00:00", "9:35:00", " Щеголеватых А. С. ", "404/5", 2],
                    [2, "Лабораторные занятия Языки программирования ", "9:45:00", "11:20:00", " Кольцов А. С. ", "402/5", 1],
                    [2, "Лабораторные занятия Электроника и схемотехника ", "9:45:00", "11:20:00", " Щеголеватых А. С. ", "404/5", 2],
                    [3, "Лекционные занятия Языки программирования ", "11:30:00", "13:05:00", " Кольцов А. С. ", "406/5", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [2, "Лекционные занятия Физика ", "9:45:00", "11:20:00", " Тураева Т. Л. ", "327/1", 0],
                    [3, "Лекционные занятия Алгебра и геометрия ", "11:30:00", "13:05:00", " Батаронов И. Л. ", "101/1", 0],
                    [4, "Практические занятия Теория графов и ее приложения ", "13:30:00", "15:05:00", " Шелковой А. Н. ", "410/5", 0]
                ],
                "Tuesday": [
                    [2, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "9:45:00", "11:20:00", " Вялых Н. Н. ", "0000", 0],
                    [4, "Лекционные занятия Философия ", "13:30:00", "15:05:00", " Назаренко К. С. ", "311/2", 0],
                    [5, "Практические занятия Алгебра и геометрия ", "15:15:00", "16:50:00", " Дорохова О. А. ", "204/2", 0],
                    [6, "Практические занятия Экономика ", "17:00:00", "18:35:00", " Голубь Н. Н. ", "301/2", 0]
                ],
                "Wednesday": [
                    [3, "Практические занятия Математический анализ ", "11:30:00", "13:05:00", " Батаронов И. Л. ", "220/1", 0],
                    [4, "Лекционные занятия Теория графов и ее приложения ", "13:30:00", "15:05:00", " Шелковой А. Н. ", "410/5", 0]
                ],
                "Thursday": [
                    [2, "Практические занятия Философия ", "9:45:00", "11:20:00", " Назаренко К. С. ", "301/1", 0],
                    [3, "Лекционные занятия Организация ЭВМ и вычислительных систем ", "11:30:00", "13:05:00", " Щеголеватых А. С. ", "327/1", 0],
                    [4, "Лабораторные занятия Физика ", "13:30:00", "15:05:00", " Тураева Т. Л. ", "319/1", 0],
                    [4, "Лабораторные занятия Физика ", "13:30:00", "15:05:00", " Ремизова О. И. ", "0000", 0]
                ],
                "Friday": [
                    [4, "Лекционные занятия Математический анализ ", "13:30:00", "15:05:00", " Батаронов И. Л. ", "301/1", 0],
                    [5, "Лекционные занятия Электроника и схемотехника ", "15:15:00", "16:50:00", " Щеголеватых А. С. ", "407/5", 0],
                    [6, "Лабораторные занятия Организация ЭВМ и вычислительных систем ", "17:00:00", "18:35:00", " Щеголеватых А. С. ", "404/5", 0]
                ],
                "Saturday": [
                    [1, "Лабораторные занятия Языки программирования ", "8:00:00", "9:35:00", " Кольцов А. С. ", "404/5", 0],
                    [2, "Лабораторные занятия Языки программирования ", "9:45:00", "11:20:00", " Кольцов А. С. ", "404/5", 0],
                    [3, "Лекционные занятия Языки программирования ", "11:30:00", "13:05:00", " Кольцов А. С. ", "406/5", 0]
                ]
            }
        },
        "KB_201": {
            "Numerator": {
                "Monday": [],
                "Tuesday": [
                    [5, "Лабораторные занятия Модели безопасности компьютерных систем ", "15:15:00", "16:50:00", " Лопатин Р. С. ", "402/5", 1],
                    [5, "Лабораторные занятия Основы построения защищенных компьютерных сетей ", "15:15:00", "16:50:00", " Куликов С. С. ", "404/5", 2],
                    [6, "Лабораторные занятия Модели безопасности компьютерных систем ", "17:00:00", "18:35:00", " Лопатин Р. С. ", "402/5", 1],
                    [6, "Лабораторные занятия Основы построения защищенных компьютерных сетей ", "17:00:00", "18:35:00", " Куликов С. С. ", "404/5", 2],
                    [7, "Лабораторные занятия Теория управления информационной безопасностью распределённых компьютерных систем ", "18:40:00", "20:05:00", " Петрова Е. С. ", "402/5", 1],
                    [7, "Лабораторные занятия Удалённый и непосредственный несанкционированный доступ в распределённых компьютерных системах ", "18:40:00", "20:05:00", " Дешина А. Е. ", "404/5", 2]
                ],
                "Wednesday": [
                    [5, "Лекционные занятия Модели безопасности компьютерных систем ", "15:15:00", "16:50:00", " Лопатин Р. С. ", "410/5", 0],
                    [6, "Практические занятия Криптографические методы защиты информации ", "17:00:00", "18:35:00", " Мокроусов А. Н. ", "410/5", 0]
                ],
                "Thursday": [
                    [4, "Практические занятия Психология социального взаимодействия ", "13:30:00", "15:05:00", " Аристова И. В. ", "312/2", 0],
                    [5, "Лекционные занятия Теория управления информационной безопасностью распределённых компьютерных систем ", "15:15:00", "16:50:00", " Паринова Л. В. ", "404/5", 0]
                ],
                "Friday": [
                    [5, "Лекционные занятия Основы построения защищенных компьютерных сетей ", "15:15:00", "16:50:00", " Куликов С. С. ", "327/1", 0],
                    [6, "Лекционные занятия Криптографические методы защиты информации ", "17:00:00", "18:35:00", " Радько Н. М. ", "327/1", 0],
                    [7, "Лабораторные занятия Информационные операции и атаки в распределенных компьютерных системах ", "18:40:00", "20:05:00", " Дешина А. Е. ", "404/5", 0]
                ],
                "Saturday": [
                    [5, "Лекционные занятия Информационные операции и атаки в распределенных компьютерных системах ", "15:15:00", "16:50:00", " Дешина А. Е. ", "410/5", 0],
                    [6, "Лекционные занятия Компьютерные преступления в распределённых компьютерных системах ", "17:00:00", "18:35:00", " Сердечный А. Л. ", "407/5", 0],
                    [7, "Лабораторные занятия Компьютерные преступления в распределённых компьютерных системах ", "18:40:00", "20:05:00", " Сердечный А. Л. ", "402/5", 0]
                ]
            },
            "Denominator": {
                "Monday": [],
                "Tuesday": [
                    [4, "Лекционные занятия Удалённый и непосредственный несанкционированный доступ в распределённых компьютерных системах ", "13:30:00", "15:05:00", " Дешина А. Е. ", "404/5", 0],
                    [5, "Лабораторные занятия Основы построения защищенных компьютерных сетей ", "15:15:00", "16:50:00", " Куликов С. С. ", "404/5", 1],
                    [5, "Лабораторные занятия Модели безопасности компьютерных систем ", "15:15:00", "16:50:00", " Лопатин Р. С. ", "402/5", 2],
                    [6, "Лабораторные занятия Основы построения защищенных компьютерных сетей ", "17:00:00", "18:35:00", " Куликов С. С. ", "404/5", 1],
                    [6, "Лабораторные занятия Модели безопасности компьютерных систем ", "17:00:00", "18:35:00", " Лопатин Р. С. ", "402/5", 2],
                    [7, "Лабораторные занятия Удалённый и непосредственный несанкционированный доступ в распределённых компьютерных системах ", "18:40:00", "20:05:00", " Дешина А. Е. ", "404/5", 1],
                    [7, "Лабораторные занятия Теория управления информационной безопасностью распределённых компьютерных систем ", "18:40:00", "20:05:00", " Петрова Е. С. ", "402/5", 2]
                ],
                "Wednesday": [
                    [5, "Лекционные занятия Модели безопасности компьютерных систем ", "15:15:00", "16:50:00", " Лопатин Р. С. ", "410/5", 0],
                    [6, "Практические занятия Теоретико-числовые методы в криптографии ", "17:00:00", "18:35:00", " Мокроусов А. Н. ", "410/5", 0]
                ],
                "Thursday": [
                    [4, "Лекционные занятия Психология социального взаимодействия ", "13:30:00", "15:05:00", " Аристова И. В. ", "308/1", 0],
                    [5, "Лекционные занятия Теория управления информационной безопасностью распределённых компьютерных систем ", "15:15:00", "16:50:00", " Паринова Л. В. ", "404/5", 0]
                ],
                "Friday": [
                    [5, "Лекционные занятия Основы построения защищенных компьютерных сетей ", "15:15:00", "16:50:00", " Куликов С. С. ", "327/1", 0],
                    [6, "Лекционные занятия Теоретико-числовые методы в криптографии ", "17:00:00", "18:35:00", " Радько Н. М. ", "327/1", 0],
                    [7, "Лабораторные занятия Информационные операции и атаки в распределенных компьютерных системах ", "18:40:00", "20:05:00", " Дешина А. Е. ", "404/5", 0]
                ],
                "Saturday": [
                    [4, "Лекционные занятия Криптографические методы защиты информации ", "13:30:00", "15:05:00", " Радько Н. М. ", "301/1", 0],
                    [5, "Лекционные занятия Информационные операции и атаки в распределенных компьютерных системах ", "15:15:00", "16:50:00", " Дешина А. Е. ", "410/5", 0],
                    [6, "Лекционные занятия Компьютерные преступления в распределённых компьютерных системах ", "17:00:00", "18:35:00", " Сердечный А. Л. ", "407/5", 0],
                    [7, "Лабораторные занятия Компьютерные преступления в распределённых компьютерных системах ", "18:40:00", "20:05:00", " Сердечный А. Л. ", "402/5", 0]
                ]
            }
        },
        "KB_211": {
            "Numerator": {
                "Monday": [
                    [1, "Лабораторные занятия Защита информации от утечки по техническим каналам ", "8:00:00", "9:35:00", " Петрова Е. С. ", "402/5", 1],
                    [1, "Лабораторные занятия Разработка прикладного программного обеспечения для  компьютерных систем  ( Москалева Е. А. )", "8:00:00", "9:35:00", "связь, информационные и коммуникационные технологии", "404/5", 2],
                    [2, "Лабораторные занятия Защита информации от утечки по техническим каналам ", "9:45:00", "11:20:00", " Петрова Е. С. ", "402/5", 1],
                    [2, "Лабораторные занятия Разработка прикладного программного обеспечения для  компьютерных систем  ( Москалева Е. А. )", "9:45:00", "11:20:00", "связь, информационные и коммуникационные технологии", "404/5", 2],
                    [3, "Практические занятия Теоретико-числовые методы в криптографии ", "11:30:00", "13:05:00", " Радько Н. М. ", "311/1", 0]
                ],
                "Tuesday": [],
                "Wednesday": [
                    [1, "Лабораторные занятия Сети и системы передачи информации ", "8:00:00", "9:35:00", " Куликов С. С. ", "402/5", 0],
                    [2, "Лекционные занятия Сети и системы передачи информации ", "9:45:00", "11:20:00", " Куликов С. С. ", "406/5", 0],
                    [3, "Практические занятия Анализ данных компьютерных систем и сетей ", "11:30:00", "13:05:00", " Батаронов И. Л. ", "406/5", 0],
                    [4, "Лекционные занятия Защита информации от утечки по техническим каналам ", "13:30:00", "15:05:00", " Дешина А. Е. ", "406/5", 0],
                    [5, "Практические занятия Проектная деятельность ", "15:15:00", "16:50:00", " Остапенко А. Г. ", "406/5", 0]
                ],
                "Thursday": [
                    [1, "Практические занятия Защита в операционных системах ", "8:00:00", "9:35:00", " Белоножкин В. И. ", "410/5", 0],
                    [2, "Лекционные занятия Разработка прикладного программного обеспечения для  компьютерных систем  ( Москалева Е. А. )", "9:45:00", "11:20:00", "связь, информационные и коммуникационные технологии", "406/5", 0],
                    [3, "Лекционные занятия Теоретико-числовые методы в криптографии ", "11:30:00", "13:05:00", " Радько Н. М. ", "406/5", 0],
                    [4, "Практические занятия Теоретико-числовые методы в криптографии ", "13:30:00", "15:05:00", " Радько Н. М. ", "406/5", 0]
                ],
                "Friday": [
                    [3, "Лабораторные занятия Сети и системы передачи информации ", "11:30:00", "13:05:00", " Куликов С. С. ", "404/5", 1],
                    [3, "Лабораторные занятия Защита информации от утечки по техническим каналам ", "11:30:00", "13:05:00", " Петрова Е. С. ", "402/5", 2],
                    [4, "Лабораторные занятия Сети и системы передачи информации ", "13:30:00", "15:05:00", " Куликов С. С. ", "404/5", 1],
                    [4, "Лабораторные занятия Защита информации от утечки по техническим каналам ", "13:30:00", "15:05:00", " Петрова Е. С. ", "402/5", 2],
                    [5, "Лекционные занятия Анализ данных компьютерных систем и сетей ", "15:15:00", "16:50:00", " Батаронов И. Л. ", "304/1", 0]
                ],
                "Saturday": [
                    [3, "Лабораторные занятия Системы управления базами данных ", "11:30:00", "13:05:00", " Паринов А. В. ", "402/5", 0],
                    [4, "Лабораторные занятия Системы управления базами данных ", "13:30:00", "15:05:00", " Паринов А. В. ", "402/5", 0],
                    [5, "Лекционные занятия Защита в операционных системах ", "15:15:00", "16:50:00", " Белоножкин В. И. ", "407/5", 0],
                    [6, "Лекционные занятия Организационное и правовое обеспечение информационной безопасности ", "17:00:00", "18:35:00", " Паринова Л. В. ", "410/5", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [1, "Лабораторные занятия Разработка прикладного программного обеспечения для  компьютерных систем  ( Москалева Е. А. )", "8:00:00", "9:35:00", "связь, информационные и коммуникационные технологии", "404/5", 1],
                    [1, "Лабораторные занятия Защита информации от утечки по техническим каналам ", "8:00:00", "9:35:00", " Петрова Е. С. ", "402/5", 2],
                    [2, "Лабораторные занятия Разработка прикладного программного обеспечения для  компьютерных систем  ( Москалева Е. А. )", "9:45:00", "11:20:00", "связь, информационные и коммуникационные технологии", "404/5", 1],
                    [2, "Лабораторные занятия Защита информации от утечки по техническим каналам ", "9:45:00", "11:20:00", " Петрова Е. С. ", "402/5", 2]
                ],
                "Tuesday": [],
                "Wednesday": [
                    [1, "Лабораторные занятия Сети и системы передачи информации ", "8:00:00", "9:35:00", " Куликов С. С. ", "402/5", 0],
                    [2, "Лекционные занятия Сети и системы передачи информации ", "9:45:00", "11:20:00", " Куликов С. С. ", "406/5", 0],
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Остапенко А. Г. ", "406/5", 0],
                    [4, "Лекционные занятия Защита информации от утечки по техническим каналам ", "13:30:00", "15:05:00", " Дешина А. Е. ", "406/5", 0]
                ],
                "Thursday": [
                    [1, "Практические занятия Защита в операционных системах ", "8:00:00", "9:35:00", " Белоножкин В. И. ", "410/5", 0],
                    [2, "Лекционные занятия Разработка прикладного программного обеспечения для  компьютерных систем  ( Москалева Е. А. )", "9:45:00", "11:20:00", "связь, информационные и коммуникационные технологии", "406/5", 0],
                    [3, "Лекционные занятия Теоретико-числовые методы в криптографии ", "11:30:00", "13:05:00", " Радько Н. М. ", "406/5", 0],
                    [4, "Практические занятия Теоретико-числовые методы в криптографии ", "13:30:00", "15:05:00", " Радько Н. М. ", "406/5", 0]
                ],
                "Friday": [
                    [3, "Лабораторные занятия Защита информации от утечки по техническим каналам ", "11:30:00", "13:05:00", " Петрова Е. С. ", "402/5", 1],
                    [3, "Лабораторные занятия Сети и системы передачи информации ", "11:30:00", "13:05:00", " Куликов С. С. ", "404/5", 2],
                    [4, "Лабораторные занятия Защита информации от утечки по техническим каналам ", "13:30:00", "15:05:00", " Петрова Е. С. ", "402/5", 1],
                    [4, "Лабораторные занятия Сети и системы передачи информации ", "13:30:00", "15:05:00", " Куликов С. С. ", "404/5", 2],
                    [5, "Лекционные занятия Анализ данных компьютерных систем и сетей ", "15:15:00", "16:50:00", " Батаронов И. Л. ", "304/1", 0],
                    [6, "Лекционные занятия Системы управления базами данных ", "17:00:00", "18:35:00", " Паринов А. В. ", "410/5", 0]
                ],
                "Saturday": [
                    [3, "Лабораторные занятия Системы управления базами данных ", "11:30:00", "13:05:00", " Паринов А. В. ", "402/5", 0],
                    [4, "Лабораторные занятия Системы управления базами данных ", "13:30:00", "15:05:00", " Паринов А. В. ", "402/5", 0],
                    [5, "Практические занятия Теоретико-числовые методы в криптографии ", "15:15:00", "16:50:00", " Радько Н. М. ", "407/5", 0],
                    [6, "Практические занятия Организационное и правовое обеспечение информационной безопасности ", "17:00:00", "18:35:00", " Паринова Л. В. ", "410/5", 0]
                ]
            }
        },
        "KB_221": {
            "Numerator": {
                "Monday": [
                    [2, "Лекционные занятия Математическая логика и теория алгоритмов ", "9:45:00", "11:20:00", " Ююкин Н. А. ", "101/1", 0],
                    [3, "Лекционные занятия Физические основы защиты информации ", "11:30:00", "13:05:00", " Пахомова А. С. ", "404/5", 0],
                    [4, "Практические занятия Теория вероятностей и математическая статистика ", "13:30:00", "15:05:00", " Шелковой А. Н. ", "407/5", 0],
                    [5, "Практические занятия Проектная деятельность ", "15:15:00", "16:50:00", " Остапенко А. Г. ", "407/5", 0]
                ],
                "Tuesday": [
                    [2, "Лекционные занятия Теория вероятностей и математическая статистика ", "9:45:00", "11:20:00", " Шелковой А. Н. ", "407/5", 0],
                    [3, "Практические занятия Физические основы защиты информации ", "11:30:00", "13:05:00", " Пахомова А. С. ", "406/5", 0],
                    [4, "Лабораторные занятия Теория управления информационной безопасностью компьютерных систем  ( Петрова Е. С. )", "13:30:00", "15:05:00", "связь, информационные и коммуникационные технологии", "406/5", 0]
                ],
                "Wednesday": [],
                "Thursday": [
                    [1, "Лабораторные занятия Методы программирования ", "8:00:00", "9:35:00", " Мордовин А. И. ", "0000", 1],
                    [2, "Лабораторные занятия Методы программирования ", "9:45:00", "11:20:00", " Мордовин А. И. ", "0000", 1],
                    [3, "Лекционные занятия Методы программирования ", "11:30:00", "13:05:00", " Пахомова А. С. ", "0000", 0],
                    [4, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "13:30:00", "15:05:00", " Вялых Н. Н. ", "0000", 0]
                ],
                "Friday": [
                    [1, "Лабораторные занятия Математические основы управления рисками ", "8:00:00", "9:35:00", " Петрова Е. С. ", "402/5", 1],
                    [1, "Лабораторные занятия Операционные системы ", "8:00:00", "9:35:00", " Белоножкин В. И. ", "201/5", 2],
                    [2, "Лабораторные занятия Математические основы управления рисками ", "9:45:00", "11:20:00", " Петрова Е. С. ", "402/5", 1],
                    [2, "Лабораторные занятия Операционные системы ", "9:45:00", "11:20:00", " Белоножкин В. И. ", "201/5", 2],
                    [3, "Лекционные занятия Теория управления информационной безопасностью компьютерных систем  ( Паринова Л. В. )", "11:30:00", "13:05:00", "связь, информационные и коммуникационные технологии", "410/5", 0]
                ],
                "Saturday": [
                    [4, "Лекционные занятия Операционные системы ", "13:30:00", "15:05:00", " Белоножкин В. И. ", "407/5", 0],
                    [5, "Лекционные занятия Профессиональная этика ", "15:15:00", "16:50:00", " Коваль Л. В. ", "327/1", 0],
                    [6, "Практические занятия Профессиональная этика ", "17:00:00", "18:35:00", " Коваль Л. В. ", "311/1", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [1, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "8:00:00", "9:35:00", " Вялых Н. Н. ", "0000", 0],
                    [3, "Лекционные занятия Физические основы защиты информации ", "11:30:00", "13:05:00", " Пахомова А. С. ", "404/5", 0],
                    [4, "Практические занятия Математическая логика и теория алгоритмов ", "13:30:00", "15:05:00", " Ююкин Н. А. ", "407/5", 0],
                    [5, "Практические занятия Проектная деятельность ", "15:15:00", "16:50:00", " Остапенко А. Г. ", "407/5", 0]
                ],
                "Tuesday": [
                    [1, "Практические занятия Физические основы защиты информации ", "8:00:00", "9:35:00", " Пахомова А. С. ", "406/5", 0],
                    [2, "Лекционные занятия Теория вероятностей и математическая статистика ", "9:45:00", "11:20:00", " Шелковой А. Н. ", "407/5", 0],
                    [3, "Лабораторные занятия Теория управления информационной безопасностью компьютерных систем  ( Петрова Е. С. )", "11:30:00", "13:05:00", "связь, информационные и коммуникационные технологии", "406/5", 0]
                ],
                "Wednesday": [],
                "Thursday": [
                    [1, "Лабораторные занятия Методы программирования ", "8:00:00", "9:35:00", " Мордовин А. И. ", "0000", 1],
                    [2, "Лабораторные занятия Методы программирования ", "9:45:00", "11:20:00", " Мордовин А. И. ", "0000", 1],
                    [3, "Лекционные занятия Методы программирования ", "11:30:00", "13:05:00", " Пахомова А. С. ", "0000", 0],
                    [4, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "13:30:00", "15:05:00", " Вялых Н. Н. ", "0000", 0]
                ],
                "Friday": [
                    [1, "Лабораторные занятия Операционные системы ", "8:00:00", "9:35:00", " Белоножкин В. И. ", "201/5", 1],
                    [1, "Лабораторные занятия Математические основы управления рисками ", "8:00:00", "9:35:00", " Петрова Е. С. ", "402/5", 2],
                    [2, "Лабораторные занятия Операционные системы ", "9:45:00", "11:20:00", " Белоножкин В. И. ", "201/5", 1],
                    [2, "Лабораторные занятия Математические основы управления рисками ", "9:45:00", "11:20:00", " Петрова Е. С. ", "402/5", 2],
                    [3, "Лекционные занятия Теория управления информационной безопасностью компьютерных систем  ( Паринова Л. В. )", "11:30:00", "13:05:00", "связь, информационные и коммуникационные технологии", "410/5", 0]
                ],
                "Saturday": [
                    [4, "Лекционные занятия Операционные системы ", "13:30:00", "15:05:00", " Белоножкин В. И. ", "407/5", 0],
                    [5, "Практические занятия Профессиональная этика ", "15:15:00", "16:50:00", " Коваль Л. В. ", "311/1", 0],
                    [6, "Лекционные занятия Математические основы управления рисками ", "17:00:00", "18:35:00", " Четкин О. В. ", "406/5", 0]
                ]
            }
        },
        "KB_231": {
            "Numerator": {
                "Monday": [
                    [2, "Лекционные занятия Физика ", "9:45:00", "11:20:00", " Тураева Т. Л. ", "327/1", 0],
                    [3, "Лекционные занятия Дискретная математика ", "11:30:00", "13:05:00", " Ююкин Н. А. ", "101/1", 0],
                    [4, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "13:30:00", "15:05:00", " Груза М. С. ", "0000", 0]
                ],
                "Tuesday": [
                    [3, "Лабораторные занятия Языки программирования ", "11:30:00", "13:05:00", " Москалева Е. А. ", "402/5", 0],
                    [4, "Лабораторные занятия Аппаратные средства вычислительной техники ", "13:30:00", "15:05:00", " Пахомова А. С. ", "404/5", 1],
                    [4, "Лабораторные занятия Языки программирования ", "13:30:00", "15:05:00", " Москалева Е. А. ", "402/5", 2]
                ],
                "Wednesday": [
                    [3, "Лекционные занятия Электроника и схемотехника ", "11:30:00", "13:05:00", " Щеголеватых А. С. ", "407/5", 0],
                    [4, "Лекционные занятия Математический анализ ", "13:30:00", "15:05:00", " Кострюков С. А. ", "221/1", 0],
                    [5, "Практические занятия Математический анализ ", "15:15:00", "16:50:00", " Кострюков С. А. ", "304/1", 0]
                ],
                "Thursday": [
                    [1, "Практические занятия Алгебра ", "8:00:00", "9:35:00", " Дорохова О. А. ", "101/1", 0],
                    [2, "Лекционные занятия Экономика ", "9:45:00", "11:20:00", " Голубь Н. Н. ", "221/1", 0],
                    [3, "Лабораторные занятия Языки программирования ", "11:30:00", "13:05:00", " Москалева Е. А. ", "402/5", 1],
                    [3, "Лабораторные занятия Электроника и схемотехника ", "11:30:00", "13:05:00", " Щеголеватых А. С. ", "404/5", 2],
                    [4, "Лабораторные занятия Языки программирования ", "13:30:00", "15:05:00", " Москалева Е. А. ", "402/5", 1],
                    [4, "Лабораторные занятия Электроника и схемотехника ", "13:30:00", "15:05:00", " Щеголеватых А. С. ", "404/5", 2]
                ],
                "Friday": [
                    [3, "Лекционные занятия Алгебра ", "11:30:00", "13:05:00", " Батаронов И. Л. ", "301/1", 0],
                    [4, "Лекционные занятия Языки программирования ", "13:30:00", "15:05:00", " Москалева Е. А. ", "407/5", 0],
                    [5, "Практические занятия Физика ", "15:15:00", "16:50:00", " Тураева Т. Л. ", "322/1", 0]
                ],
                "Saturday": []
            },
            "Denominator": {
                "Monday": [
                    [1, "Практические занятия Алгебра ", "8:00:00", "9:35:00", " Дорохова О. А. ", "406/5", 0],
                    [2, "Лекционные занятия Физика ", "9:45:00", "11:20:00", " Тураева Т. Л. ", "327/1", 0],
                    [3, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "11:30:00", "13:05:00", " Груза М. С. ", "0000", 0]
                ],
                "Tuesday": [
                    [2, "Лабораторные занятия Электроника и схемотехника ", "9:45:00", "11:20:00", " Щеголеватых А. С. ", "404/5", 0],
                    [3, "Лабораторные занятия Электроника и схемотехника ", "11:30:00", "13:05:00", " Щеголеватых А. С. ", "404/5", 1],
                    [3, "Лабораторные занятия Аппаратные средства вычислительной техники ", "11:30:00", "13:05:00", " Пахомова А. С. ", "402/5", 2],
                    [4, "Лекционные занятия Философия ", "13:30:00", "15:05:00", " Назаренко К. С. ", "311/2", 0]
                ],
                "Wednesday": [
                    [2, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "9:45:00", "11:20:00", " Груза М. С. ", "0000", 0],
                    [4, "Лекционные занятия Математический анализ ", "13:30:00", "15:05:00", " Кострюков С. А. ", "301/1", 0],
                    [5, "Лекционные занятия Аппаратные средства вычислительной техники ", "15:15:00", "16:50:00", " Пахомова А. С. ", "201/5", 0]
                ],
                "Thursday": [
                    [1, "Практические занятия Философия ", "8:00:00", "9:35:00", " Назаренко К. С. ", "301/1", 0],
                    [2, "Практические занятия Дискретная математика ", "9:45:00", "11:20:00", " Ююкин Н. А. ", "221/1", 0],
                    [3, "Лабораторные занятия Физика ", "11:30:00", "13:05:00", " Тураева Т. Л. ", "319/1", 0],
                    [3, "Лабораторные занятия Физика ", "11:30:00", "13:05:00", " Ремизова О. И. ", "0000", 0]
                ],
                "Friday": [
                    [3, "Лекционные занятия Алгебра ", "11:30:00", "13:05:00", " Батаронов И. Л. ", "301/1", 0],
                    [4, "Лекционные занятия Языки программирования ", "13:30:00", "15:05:00", " Москалева Е. А. ", "407/5", 0],
                    [5, "Практические занятия Экономика ", "15:15:00", "16:50:00", " Голубь Н. Н. ", "220/1", 0]
                ],
                "Saturday": []
            }
        },
        "KB_232": {
            "Numerator": {
                "Monday": [
                    [2, "Лекционные занятия Физика ", "9:45:00", "11:20:00", " Тураева Т. Л. ", "327/1", 0],
                    [3, "Лекционные занятия Дискретная математика ", "11:30:00", "13:05:00", " Ююкин Н. А. ", "101/1", 0],
                    [4, "Лабораторные занятия Аппаратные средства вычислительной техники ", "13:30:00", "15:05:00", " Пахомова А. С. ", "404/5", 0]
                ],
                "Tuesday": [
                    [1, "Лабораторные занятия Языки программирования ", "8:00:00", "9:35:00", " Москалева Е. А. ", "402/5", 1],
                    [1, "Лабораторные занятия Электроника и схемотехника ", "8:00:00", "9:35:00", " Щеголеватых А. С. ", "404/5", 2],
                    [2, "Лабораторные занятия Языки программирования ", "9:45:00", "11:20:00", " Москалева Е. А. ", "402/5", 1],
                    [2, "Лабораторные занятия Электроника и схемотехника ", "9:45:00", "11:20:00", " Щеголеватых А. С. ", "404/5", 2]
                ],
                "Wednesday": [
                    [2, "Практические занятия Алгебра ", "9:45:00", "11:20:00", " Дорохова О. А. ", "311/1", 0],
                    [3, "Лекционные занятия Электроника и схемотехника ", "11:30:00", "13:05:00", " Щеголеватых А. С. ", "407/5", 0],
                    [4, "Лекционные занятия Математический анализ ", "13:30:00", "15:05:00", " Кострюков С. А. ", "221/1", 0]
                ],
                "Thursday": [
                    [1, "Практические занятия Экономика ", "8:00:00", "9:35:00", " Голубь Н. Н. ", "301/1", 0],
                    [2, "Лекционные занятия Экономика ", "9:45:00", "11:20:00", " Голубь Н. Н. ", "221/1", 0],
                    [3, "Практические занятия Философия ", "11:30:00", "13:05:00", " Назаренко К. С. ", "301/1", 0],
                    [4, "Лабораторные занятия Физика ", "13:30:00", "15:05:00", " Тураева Т. Л. ", "319/1", 0],
                    [4, "Лабораторные занятия Физика ", "13:30:00", "15:05:00", " Ремизова О. И. ", "0000", 0]
                ],
                "Friday": [
                    [1, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "8:00:00", "9:35:00", " Кутузова И. А. ", "0000", 0],
                    [3, "Лекционные занятия Алгебра ", "11:30:00", "13:05:00", " Батаронов И. Л. ", "301/1", 0],
                    [4, "Лекционные занятия Языки программирования ", "13:30:00", "15:05:00", " Москалева Е. А. ", "407/5", 0]
                ],
                "Saturday": []
            },
            "Denominator": {
                "Monday": [
                    [2, "Лекционные занятия Физика ", "9:45:00", "11:20:00", " Тураева Т. Л. ", "327/1", 0],
                    [3, "Практические занятия Дискретная математика ", "11:30:00", "13:05:00", " Ююкин Н. А. ", "407/5", 0],
                    [4, "Лабораторные занятия Аппаратные средства вычислительной техники ", "13:30:00", "15:05:00", " Пахомова А. С. ", "404/5", 0]
                ],
                "Tuesday": [
                    [4, "Лекционные занятия Философия ", "13:30:00", "15:05:00", " Назаренко К. С. ", "311/2", 0],
                    [5, "Практические занятия Математический анализ ", "15:15:00", "16:50:00", " Кострюков С. А. ", "310/2", 0],
                    [6, "Практические занятия Алгебра ", "17:00:00", "18:35:00", " Дорохова О. А. ", "206/2", 0]
                ],
                "Wednesday": [
                    [2, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "9:45:00", "11:20:00", " Кутузова И. А. ", "0000", 0],
                    [4, "Лекционные занятия Математический анализ ", "13:30:00", "15:05:00", " Кострюков С. А. ", "301/1", 0],
                    [5, "Лекционные занятия Аппаратные средства вычислительной техники ", "15:15:00", "16:50:00", " Пахомова А. С. ", "201/5", 0]
                ],
                "Thursday": [
                    [1, "Лабораторные занятия Электроника и схемотехника ", "8:00:00", "9:35:00", " Щеголеватых А. С. ", "404/5", 0],
                    [2, "Лабораторные занятия Электроника и схемотехника ", "9:45:00", "11:20:00", " Щеголеватых А. С. ", "404/5", 0],
                    [3, "Лабораторные занятия Языки программирования ", "11:30:00", "13:05:00", " Москалева Е. А. ", "402/5", 0],
                    [4, "Лабораторные занятия Языки программирования ", "13:30:00", "15:05:00", " Москалева Е. А. ", "402/5", 0]
                ],
                "Friday": [
                    [1, "Практические занятия Элективные дисциплины по физической культуре и спорту ", "8:00:00", "9:35:00", " Кутузова И. А. ", "0000", 0],
                    [3, "Лекционные занятия Алгебра ", "11:30:00", "13:05:00", " Батаронов И. Л. ", "301/1", 0],
                    [4, "Лекционные занятия Языки программирования ", "13:30:00", "15:05:00", " Москалева Е. А. ", "407/5", 0],
                    [5, "Практические занятия Физика ", "15:15:00", "16:50:00", " Тураева Т. Л. ", "322/1", 0]
                ],
                "Saturday": []
            }
        },
        "mID_231": {
            "Numerator": {
                "Monday": [
                    [6, "Практические занятия Проектная деятельность ", "17:00:00", "18:35:00", " Левин Д. Ю. ", "116/2", 0],
                    [7, "Лекционные занятия Теория познания и решения творческих задач ", "18:40:00", "20:05:00", " Норман А. В. ", "116/2", 0]
                ],
                "Tuesday": [
                    [5, "Лекционные занятия Аддитивные и традиционные технологии ", "15:15:00", "16:50:00", " Левин Д. Ю. ", "311/2", 0],
                    [6, "Лекционные занятия Аддитивные и традиционные технологии ", "17:00:00", "18:35:00", " Левин Д. Ю. ", "311/2", 0]
                ],
                "Wednesday": [
                    [5, "Лабораторные занятия Перспективные технологии интерактивного дизайна ", "15:15:00", "16:50:00", " Суворов А. П.  Никоноров А. В. ", "205а/2", 0],
                    [6, "Лабораторные занятия Перспективные технологии интерактивного дизайна ", "17:00:00", "18:35:00", " Суворов А. П.  Никоноров А. В. ", "205а/2", 0]
                ],
                "Thursday": [],
                "Friday": [
                    [5, "Лекционные занятия Дополненная реальность в дизайне ", "15:15:00", "16:50:00", " Норман А. В. ", "310/2", 0],
                    [6, "Лабораторные занятия Дополненная реальность в дизайне ", "17:00:00", "18:35:00", " Норман А. В. ", "204/2", 0],
                    [7, "Лекционные занятия Перспективные технологии интерактивного дизайна ", "18:40:00", "20:05:00", " Суворов А. П. ", "205а/2", 0]
                ],
                "Saturday": [
                    [6, "Лабораторные занятия Дизайн мультимедийных приложений ", "17:00:00", "18:35:00", " Суворов А. П. ", "205а/2", 0],
                    [7, "Лабораторные занятия Дизайн мультимедийных приложений ", "18:40:00", "20:05:00", " Суворов А. П. ", "205а/2", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [5, "Лабораторные занятия Теория познания и решения творческих задач ", "15:15:00", "16:50:00", " Норман А. В. ", "205б/2", 0],
                    [6, "Лабораторные занятия Теория познания и решения творческих задач ", "17:00:00", "18:35:00", " Норман А. В. ", "205б/2", 0],
                    [7, "Лекционные занятия Теория познания и решения творческих задач ", "18:40:00", "20:05:00", " Норман А. В. ", "116/2", 0]
                ],
                "Tuesday": [],
                "Wednesday": [
                    [5, "Лабораторные занятия Аддитивные и традиционные технологии ", "15:15:00", "16:50:00", " Левин Д. Ю. ", "205а/2", 0],
                    [6, "Лабораторные занятия Аддитивные и традиционные технологии ", "17:00:00", "18:35:00", " Левин Д. Ю. ", "205а/2", 0]
                ],
                "Thursday": [
                    [4, "Лабораторные занятия Методология формообразования объектов промышленного дизайна ", "13:30:00", "15:05:00", " Свиридов Д. А. ", "116а/2", 0],
                    [5, "Лекционные занятия Средства автоматизированного проектирования объектов промышленного дизайна ", "15:15:00", "16:50:00", " Норман А. В. ", "116а/2", 0],
                    [6, "Лабораторные занятия Средства автоматизированного проектирования объектов промышленного дизайна ", "17:00:00", "18:35:00", " Норман А. В. ", "204/2", 0],
                    [7, "Лабораторные занятия Средства автоматизированного проектирования объектов промышленного дизайна ", "18:40:00", "20:05:00", " Норман А. В. ", "204/2", 0]
                ],
                "Friday": [
                    [5, "Лекционные занятия Методология формообразования объектов промышленного дизайна ", "15:15:00", "16:50:00", " Свиридов Д. А. ", "310/2", 0],
                    [6, "Лекционные занятия Моделирование объектов дизайна ", "17:00:00", "18:35:00", " Свиридов Д. А. ", "310/2", 0],
                    [7, "Лекционные занятия Дизайн мультимедийных приложений ", "18:40:00", "20:05:00", " Суворов А. П. ", "205а/2", 0]
                ],
                "Saturday": [
                    [6, "Лабораторные занятия Моделирование объектов дизайна ", "17:00:00", "18:35:00", " Свиридов Д. А. ", "205а/2", 0],
                    [7, "Лабораторные занятия Моделирование объектов дизайна ", "18:40:00", "20:05:00", " Свиридов Д. А. ", "205а/2", 0]
                ]
            }
        },
        "mID_241": {
            "Numerator": {
                "Monday": [
                    [5, "Лабораторные занятия Методология научных исследований ", "15:15:00", "16:50:00", " Кострова В. Н. ", "409/2", 0],
                    [6, "Лабораторные занятия Методология научных исследований ", "17:00:00", "18:35:00", " Кострова В. Н. ", "409/2", 0],
                    [7, "Практические занятия Проектная деятельность ", "18:40:00", "20:05:00", " Левин Д. Ю. ", "111/2", 0]
                ],
                "Tuesday": [
                    [5, "Лекционные занятия Методология научных исследований ", "15:15:00", "16:50:00", " Кострова В. Н. ", "312/2", 0],
                    [6, "Лекционные занятия Математическое моделирование ", "17:00:00", "18:35:00", " Воробьев Э. И. ", "312/2", 0]
                ],
                "Wednesday": [],
                "Thursday": [],
                "Friday": [
                    [5, "с 16:05 -до 17:40  Практические занятия Деловой иностранный язык ", "15:15:00", "16:50:00", " Федоров В. А. ", "6346", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Деловой иностранный язык ", "17:00:00", "18:35:00", " Федоров В. А. ", "6346", 0]
                ],
                "Saturday": []
            },
            "Denominator": {
                "Monday": [],
                "Tuesday": [
                    [6, "Лекционные занятия Социальные коммуникации ", "17:00:00", "18:35:00", " Белоглазова Л. А. ", "312/2", 0],
                    [7, "Лекционные занятия Технологическое предпринимательство ", "18:40:00", "20:05:00", " Бредихин А. В. ", "312/2", 0]
                ],
                "Wednesday": [
                    [5, "Лабораторные занятия Математическое моделирование ", "15:15:00", "16:50:00", " Воробьев Э. И. ", "403/2", 0],
                    [6, "Лабораторные занятия Математическое моделирование ", "17:00:00", "18:35:00", " Воробьев Э. И. ", "403/2", 0]
                ],
                "Thursday": [],
                "Friday": [],
                "Saturday": [
                    [4, "Практические занятия Технологическое предпринимательство ", "13:30:00", "15:05:00", " Бредихин А. В. ", "116/2", 0],
                    [5, "Практические занятия Социальные коммуникации ", "15:15:00", "16:50:00", " Белоглазова Л. А. ", "111/2", 0]
                ]
            }
        },
        "mIIVT_231": {
            "Numerator": {
                "Monday": [
                    [5, "Лекционные занятия Проектирование интеллектуально-программных информационных систем ", "15:15:00", "16:50:00", " Пачевский Д. Е. ", "206/2", 0],
                    [6, "Лабораторные занятия Автоматизация подготовки управляющих программ для станков с ЧПУ ", "17:00:00", "18:35:00", " Ветохин В. В. ", "215/2", 1],
                    [6, "Лабораторные занятия Методы и алгоритмы разработки систем автоматизированного проектирования ", "17:00:00", "18:35:00", " Пачевский Д. Е. ", "213/2", 2],
                    [7, "Лабораторные занятия Автоматизация подготовки управляющих программ для станков с ЧПУ ", "18:40:00", "20:05:00", " Ветохин В. В. ", "215/2", 1],
                    [7, "Лабораторные занятия Методы и алгоритмы разработки систем автоматизированного проектирования ", "18:40:00", "20:05:00", " Пачевский Д. Е. ", "213/2", 2]
                ],
                "Tuesday": [
                    [6, "Лабораторные занятия Проектирование интеллектуально-программных информационных систем ", "17:00:00", "18:35:00", " Пачевский Д. Е. ", "202/2", 1],
                    [6, "Лабораторные занятия Специальные методы информационной безопасности ", "17:00:00", "18:35:00", " Паринов М. В. ", "215/2", 2],
                    [7, "Лабораторные занятия Проектирование интеллектуально-программных информационных систем ", "18:40:00", "20:05:00", " Пачевский Д. Е. ", "202/2", 1],
                    [7, "Лабораторные занятия Специальные методы информационной безопасности ", "18:40:00", "20:05:00", " Паринов М. В. ", "215/2", 2]
                ],
                "Wednesday": [
                    [6, "Лекционные занятия Специальные методы информационной безопасности ", "17:00:00", "18:35:00", " Паринов М. В. ", "208/2", 0],
                    [7, "Лекционные занятия Проектирование автоматизированных цифровых производств ", "18:40:00", "20:05:00", " Ветохин В. В. ", "202/2", 0]
                ],
                "Thursday": [
                    [6, "Лабораторные занятия Архитектура САПР ", "17:00:00", "18:35:00", " Горбунов В. Г. ", "213/2", 1],
                    [6, "Лабораторные занятия Проектирование автоматизированных цифровых производств ", "17:00:00", "18:35:00", " Ветохин В. В. ", "215/2", 2],
                    [7, "Лабораторные занятия Архитектура САПР ", "18:40:00", "20:05:00", " Горбунов В. Г. ", "213/2", 1],
                    [7, "Лабораторные занятия Проектирование автоматизированных цифровых производств ", "18:40:00", "20:05:00", " Ветохин В. В. ", "215/2", 2]
                ],
                "Friday": [
                    [6, "Лабораторные занятия Специальные методы информационной безопасности ", "17:00:00", "18:35:00", " Паринов М. В. ", "202/2", 1],
                    [6, "Лабораторные занятия Архитектура САПР ", "17:00:00", "18:35:00", " Горбунов В. Г. ", "208/2", 2],
                    [7, "Лабораторные занятия Специальные методы информационной безопасности ", "18:40:00", "20:05:00", " Паринов М. В. ", "202/2", 1],
                    [7, "Лабораторные занятия Архитектура САПР ", "18:40:00", "20:05:00", " Горбунов В. Г. ", "208/2", 2]
                ],
                "Saturday": []
            },
            "Denominator": {
                "Monday": [
                    [5, "Лекционные занятия Методы и алгоритмы разработки систем автоматизированного проектирования ", "15:15:00", "16:50:00", " Пачевский Д. Е. ", "206/2", 0],
                    [6, "Лабораторные занятия Методы и алгоритмы разработки систем автоматизированного проектирования ", "17:00:00", "18:35:00", " Пачевский Д. Е. ", "213/2", 1],
                    [6, "Лабораторные занятия Автоматизация подготовки управляющих программ для станков с ЧПУ ", "17:00:00", "18:35:00", " Ветохин В. В. ", "215/2", 2],
                    [7, "Лабораторные занятия Методы и алгоритмы разработки систем автоматизированного проектирования ", "18:40:00", "20:05:00", " Пачевский Д. Е. ", "213/2", 1],
                    [7, "Лабораторные занятия Автоматизация подготовки управляющих программ для станков с ЧПУ ", "18:40:00", "20:05:00", " Ветохин В. В. ", "215/2", 2]
                ],
                "Tuesday": [
                    [5, "Практические занятия Проектная деятельность ", "15:15:00", "16:50:00", " Бредихин А. В. ", "116/2", 0],
                    [6, "Практические занятия Проектная деятельность ", "17:00:00", "18:35:00", " Бредихин А. В. ", "111/2", 0]
                ],
                "Wednesday": [
                    [6, "Лекционные занятия Архитектура САПР ", "17:00:00", "18:35:00", " Горбунов В. Г. ", "208/2", 0],
                    [7, "Лекционные занятия Автоматизация подготовки управляющих программ для станков с ЧПУ ", "18:40:00", "20:05:00", " Ветохин В. В. ", "202/2", 0]
                ],
                "Thursday": [
                    [4, "Лабораторные занятия Проектирование автоматизированных цифровых производств ", "13:30:00", "15:05:00", " Ветохин В. В. ", "213/2", 0],
                    [5, "Лабораторные занятия Проектирование автоматизированных цифровых производств ", "15:15:00", "16:50:00", " Ветохин В. В. ", "213/2", 1],
                    [5, "Лабораторные занятия Проектирование интеллектуально-программных информационных систем ", "15:15:00", "16:50:00", " Пачевский Д. Е. ", "210/2", 2],
                    [6, "Лабораторные занятия Проектирование интеллектуально-программных информационных систем ", "17:00:00", "18:35:00", " Пачевский Д. Е. ", "210/2", 0]
                ],
                "Friday": [],
                "Saturday": []
            }
        },
        "mIIVT_241": {
            "Numerator": {
                "Monday": [
                    [5, "Лекционные занятия Адаптационный модуль ", "15:15:00", "16:50:00", " Пак А. А. ", "208/2", 0],
                    [6, "Практические занятия Основы личностного роста в инклюзивной образовательной среде ", "17:00:00", "18:35:00", " Пак А. А. ", "208/2", 0],
                    [7, "Лекционные занятия Основы личностного роста в инклюзивной образовательной среде ", "18:40:00", "20:05:00", " Пак А. А. ", "208/2", 0]
                ],
                "Tuesday": [
                    [5, "Лекционные занятия Системы хранения и обработки данных ", "15:15:00", "16:50:00", " Короленко В. В. ", "208/2", 0],
                    [6, "Практические занятия Адаптационный модуль ", "17:00:00", "18:35:00", " Пак А. А. ", "210/2", 0]
                ],
                "Wednesday": [
                    [6, "Практические занятия Системы хранения и обработки данных ", "17:00:00", "18:35:00", " Короленко В. В. ", "210/2", 0],
                    [7, "Практические занятия Проектная деятельность ", "18:40:00", "20:05:00", " Бредихин А. В. ", "210/2", 0]
                ],
                "Thursday": [],
                "Friday": [
                    [5, "Лекционные занятия Системный анализ и моделирование интеллектуальных систем ", "15:15:00", "16:50:00", " Собенина О. В. ", "210/2", 0],
                    [6, "Практические занятия Системный анализ и моделирование интеллектуальных систем ", "17:00:00", "18:35:00", " Собенина О. В. ", "210/2", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Иностранный язык в сфере профессиональных коммуникаций ", "18:40:00", "20:05:00", " Федоров В. А. ", "6346", 0]
                ],
                "Saturday": []
            },
            "Denominator": {
                "Monday": [
                    [5, "с 16:05 -до 17:40  Практические занятия Иностранный язык в сфере профессиональных коммуникаций ", "15:15:00", "16:50:00", " Федоров В. А. ", "6346", 0],
                    [6, "с 17:50 -до 19:25  Практические занятия Иностранный язык в сфере профессиональных коммуникаций ", "17:00:00", "18:35:00", " Федоров В. А. ", "6346", 0]
                ],
                "Tuesday": [
                    [5, "Лекционные занятия Системы хранения и обработки данных ", "15:15:00", "16:50:00", " Короленко В. В. ", "208/2", 0],
                    [6, "Практические занятия Адаптационный модуль ", "17:00:00", "18:35:00", " Пак А. А. ", "210/2", 0]
                ],
                "Wednesday": [
                    [6, "Лабораторные занятия Системы хранения и обработки данных ", "17:00:00", "18:35:00", " Короленко В. В. ", "210/2", 0],
                    [7, "Лабораторные занятия Системы хранения и обработки данных ", "18:40:00", "20:05:00", " Короленко В. В. ", "210/2", 0]
                ],
                "Thursday": [],
                "Friday": [
                    [5, "Лекционные занятия Системный анализ и моделирование интеллектуальных систем ", "15:15:00", "16:50:00", " Собенина О. В. ", "210/2", 0],
                    [6, "Практические занятия Системный анализ и моделирование интеллектуальных систем ", "17:00:00", "18:35:00", " Собенина О. В. ", "210/2", 0]
                ],
                "Saturday": []
            }
        },
        "mRIS_231": {
            "Numerator": {
                "Monday": [],
                "Tuesday": [
                    [5, "Лекционные занятия Back-end разработка на платформе Node.js ", "15:15:00", "16:50:00", " Рындин Н. А. ", "0000", 0],
                    [6, "Лекционные занятия Создание web-приложений с применением фрэймворка Vue.js ", "17:00:00", "18:35:00", " Рындин Н. А. ", "0000", 0]
                ],
                "Wednesday": [
                    [5, "Лабораторные занятия Back-end разработка на платформе Node.js ", "15:15:00", "16:50:00", " Рындин Н. А. ", "0000", 1],
                    [6, "Лабораторные занятия Back-end разработка на платформе Node.js ", "17:00:00", "18:35:00", " Рындин Н. А. ", "0000", 1],
                    [7, "Лабораторные занятия Архитектура информационных систем ", "18:40:00", "20:05:00", " Рындин Н. А. ", "0000", 1]
                ],
                "Thursday": [
                    [5, "Лабораторные занятия Технологии проектирования распределенных информационных систем ", "15:15:00", "16:50:00", " Веркин С. С. ", "407/2", 0],
                    [6, "Лекционные занятия Технологии проектирования распределенных информационных систем ", "17:00:00", "18:35:00", " Веркин С. С. ", "407/2", 0],
                    [7, "Лабораторные занятия Технологии проектирования распределенных информационных систем ", "18:40:00", "20:05:00", " Веркин С. С. ", "407/2", 0]
                ],
                "Friday": [
                    [5, "Лабораторные занятия Создание web-приложений с применением фрэймворка Vue.js ", "15:15:00", "16:50:00", " Рындин Н. А. ", "0000", 1],
                    [6, "Лабораторные занятия Создание web-приложений с применением фрэймворка Vue.js ", "17:00:00", "18:35:00", " Рындин Н. А. ", "0000", 1]
                ],
                "Saturday": []
            },
            "Denominator": {
                "Monday": [],
                "Tuesday": [
                    [5, "Лекционные занятия Архитектура информационных систем ", "15:15:00", "16:50:00", " Рындин Н. А. ", "0000", 0],
                    [6, "Практические занятия Проектная деятельность ", "17:00:00", "18:35:00", " Рындин Н. А. ", "0000", 0]
                ],
                "Wednesday": [
                    [5, "Лабораторные занятия Back-end разработка на платформе Node.js ", "15:15:00", "16:50:00", " Рындин Н. А. ", "0000", 1],
                    [6, "Лабораторные занятия Back-end разработка на платформе Node.js ", "17:00:00", "18:35:00", " Рындин Н. А. ", "0000", 1],
                    [7, "Лабораторные занятия Архитектура информационных систем ", "18:40:00", "20:05:00", " Рындин Н. А. ", "0000", 1]
                ],
                "Thursday": [],
                "Friday": [
                    [5, "Лабораторные занятия Создание web-приложений с применением фрэймворка Vue.js ", "15:15:00", "16:50:00", " Рындин Н. А. ", "0000", 1],
                    [6, "Лабораторные занятия Создание web-приложений с применением фрэймворка Vue.js ", "17:00:00", "18:35:00", " Рындин Н. А. ", "0000", 1]
                ],
                "Saturday": []
            }
        },
        "mRIS_241": {
            "Numerator": {
                "Monday": [
                    [5, "Лекционные занятия Модели представления и обработки данных ", "15:15:00", "16:50:00", " Белецкая С. Ю. ", "406/2", 0],
                    [6, "Лекционные занятия Принятие решений в условиях неопределенности ", "17:00:00", "18:35:00", " Пасмурнов С. М. ", "406/2", 0]
                ],
                "Tuesday": [
                    [5, "Лекционные занятия Методология научных исследований ", "15:15:00", "16:50:00", " Кострова В. Н. ", "312/2", 0],
                    [6, "Лекционные занятия Математическое моделирование ", "17:00:00", "18:35:00", " Воробьев Э. И. ", "312/2", 0]
                ],
                "Wednesday": [
                    [5, "Лабораторные занятия Математическое моделирование ", "15:15:00", "16:50:00", " Воробьев Э. И. ", "403/2", 0],
                    [6, "Лабораторные занятия Математическое моделирование ", "17:00:00", "18:35:00", " Воробьев Э. И. ", "403/2", 0]
                ],
                "Thursday": [],
                "Friday": [],
                "Saturday": [
                    [4, "Практические занятия Технологическое предпринимательство ", "13:30:00", "15:05:00", " Бредихин А. В. ", "105/2", 0],
                    [5, "Лабораторные занятия Методология научных исследований ", "15:15:00", "16:50:00", " Кострова В. Н. ", "407/2", 0],
                    [6, "Лабораторные занятия Методология научных исследований ", "17:00:00", "18:35:00", " Кострова В. Н. ", "407/2", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [5, "Лабораторные занятия Модели представления и обработки данных ", "15:15:00", "16:50:00", " Белецкая С. Ю. ", "406/2", 0],
                    [6, "Лабораторные занятия Принятие решений в условиях неопределенности ", "17:00:00", "18:35:00", " Пасмурнов С. М. ", "406/2", 0]
                ],
                "Tuesday": [
                    [6, "Лекционные занятия Социальные коммуникации ", "17:00:00", "18:35:00", " Белоглазова Л. А. ", "312/2", 0],
                    [7, "Лекционные занятия Технологическое предпринимательство ", "18:40:00", "20:05:00", " Бредихин А. В. ", "312/2", 0]
                ],
                "Wednesday": [
                    [5, "Практические занятия Деловой иностранный язык Деловой иностранный язык (Савицкайте Е.Р.)", "15:15:00", "16:50:00", " Падурец А. А. ", "112/2               323/1", 0],
                    [6, "Практические занятия Деловой иностранный язык Деловой иностранный язык (Савицкайте Е.Р.)", "17:00:00", "18:35:00", " Падурец А. А. ", "116/2               323/1", 0]
                ],
                "Thursday": [],
                "Friday": [],
                "Saturday": [
                    [3, "Практические занятия Проектная деятельность ", "11:30:00", "13:05:00", " Рындин Н. А. ", "0000", 1],
                    [4, "Практические занятия Социальные коммуникации ", "13:30:00", "15:05:00", " Белоглазова Л. А. ", "111/2", 0],
                    [5, "Практические занятия Иностранный язык ", "15:15:00", "16:50:00", " Савицкайте Е. Р. ", "116/2", 0]
                ]
            }
        },
        "mUPI_231": {
            "Numerator": {
                "Monday": [
                    [5, "Лабораторные занятия Оптимизация в программном инжиниринге ", "15:15:00", "16:50:00", " Олейникова С. А. ", "419/2", 0],
                    [6, "Лабораторные занятия Оптимизация в программном инжиниринге ", "17:00:00", "18:35:00", " Олейникова С. А. ", "419/2", 0],
                    [7, "Лекционные занятия Управление развитием информационно-коммуникационных систем ", "18:40:00", "20:05:00", " Кравец О. Я. ", "408/2", 0]
                ],
                "Tuesday": [
                    [4, "Лекционные занятия Разработка дизайна информационно-коммуникационной системы ", "13:30:00", "15:05:00", " Нужный А. М. ", "408/2", 0],
                    [5, "Лекционные занятия Оптимизация в программном инжиниринге ", "15:15:00", "16:50:00", " Олейникова С. А. ", "419/2", 0]
                ],
                "Wednesday": [
                    [5, "Практические занятия Проектная деятельность ", "15:15:00", "16:50:00", " Акинина Ю. С. ", "408/2", 0],
                    [6, "Лабораторные занятия Управление развитием информационно-коммуникационных систем ", "17:00:00", "18:35:00", " Кравец О. Я. ", "408/2", 0],
                    [7, "Лабораторные занятия Управление развитием информационно-коммуникационных систем ", "18:40:00", "20:05:00", " Кравец О. Я. ", "408/2", 0]
                ],
                "Thursday": [
                    [6, "Лабораторные занятия Разработка дизайна информационно-коммуникационной системы ", "17:00:00", "18:35:00", " Нужный А. М. ", "415/2", 0],
                    [7, "Лабораторные занятия Разработка дизайна информационно-коммуникационной системы ", "18:40:00", "20:05:00", " Нужный А. М. ", "415/2", 0]
                ],
                "Friday": [
                    [5, "Лекционные занятия Технологии работы с большими данными big data ", "15:15:00", "16:50:00", " Сафронов В. В. ", "419/2", 0],
                    [6, "Лекционные занятия Администрирование информационно-коммуникационных систем ", "17:00:00", "18:35:00", " Сафронов В. В. ", "419/2", 0]
                ],
                "Saturday": [
                    [1, "Лекционные занятия Разработка Интернет-приложений с использованием клиент-серверных СУБД ", "8:00:00", "9:35:00", " Акинин А. А. ", "415/2", 0],
                    [2, "Лекционные занятия Разработка Интернет-приложений с использованием клиент-серверных СУБД ", "9:45:00", "11:20:00", " Акинин А. А. ", "415/2", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [5, "Лабораторные занятия Технологии работы с большими данными big data ", "15:15:00", "16:50:00", " Сафронов В. В. ", "417/2", 0],
                    [6, "Лабораторные занятия Технологии работы с большими данными big data ", "17:00:00", "18:35:00", " Сафронов В. В. ", "417/2", 0]
                ],
                "Tuesday": [
                    [4, "Лекционные занятия Разработка дизайна информационно-коммуникационной системы ", "13:30:00", "15:05:00", " Нужный А. М. ", "408/2", 0],
                    [5, "Лекционные занятия Оптимизация в программном инжиниринге ", "15:15:00", "16:50:00", " Олейникова С. А. ", "419/2", 0]
                ],
                "Wednesday": [],
                "Thursday": [],
                "Friday": [
                    [5, "Лекционные занятия Технологии работы с большими данными big data ", "15:15:00", "16:50:00", " Сафронов В. В. ", "419/2", 0],
                    [6, "Лабораторные занятия Администрирование информационно-коммуникационных систем ", "17:00:00", "18:35:00", " Сафронов В. В. ", "419/2", 0]
                ],
                "Saturday": [
                    [1, "Лабораторные занятия Разработка Интернет-приложений с использованием клиент-серверных СУБД ", "8:00:00", "9:35:00", " Акинин А. А.  Акинина Ю. С. ", "412/2", 0],
                    [2, "Лабораторные занятия Разработка Интернет-приложений с использованием клиент-серверных СУБД ", "9:45:00", "11:20:00", " Акинин А. А.  Акинина Ю. С. ", "412/2", 0]
                ]
            }
        },
        "mUPI_241": {
            "Numerator": {
                "Monday": [
                    [5, "Лекционные занятия Мультиагентные системы и искусственный интеллект ", "15:15:00", "16:50:00", " Кравец О. Я. ", "408/2", 0],
                    [6, "Лабораторные занятия Мультиагентные системы и искусственный интеллект ", "17:00:00", "18:35:00", " Кравец О. Я. ", "408/2", 0]
                ],
                "Tuesday": [
                    [5, "Лекционные занятия Технологическое предпринимательство ", "15:15:00", "16:50:00", " Недикова Т. Н. ", "408/2", 0],
                    [6, "Практические занятия Социальные коммуникации ", "17:00:00", "18:35:00", " Белоглазова Л. А. ", "307/2", 0]
                ],
                "Wednesday": [
                    [4, "Практические занятия Проектная деятельность ", "13:30:00", "15:05:00", " Акинина Ю. С. ", "408/2", 0],
                    [5, "Лабораторные занятия Интеллектуальные системы ", "15:15:00", "16:50:00", " Олейникова С. А. ", "419/2", 0],
                    [6, "Лабораторные занятия Интеллектуальные системы ", "17:00:00", "18:35:00", " Олейникова С. А. ", "419/2", 0]
                ],
                "Thursday": [
                    [5, "Лекционные занятия Интеллектуальные системы ", "15:15:00", "16:50:00", " Олейникова С. А. ", "419/2", 0],
                    [6, "Лабораторные занятия Современные методы проектирования распределенных приложений ", "17:00:00", "18:35:00", " Олейникова С. А. ", "419/2", 0],
                    [7, "Лабораторные занятия Современные методы проектирования распределенных приложений ", "18:40:00", "20:05:00", " Олейникова С. А. ", "419/2", 0]
                ],
                "Friday": [
                    [5, "Практические занятия Деловой иностранный язык ", "15:15:00", "16:50:00", " Каширский С. Н. ", "105/2", 0],
                    [6, "Практические занятия Деловой иностранный язык ", "17:00:00", "18:35:00", " Каширский С. Н. ", "105/2", 0]
                ],
                "Saturday": [
                    [3, "Лекционные занятия Разработка программного обеспечения кроссплатформенных мобильных систем ", "11:30:00", "13:05:00", " Черников В. Н. ", "408/2", 0],
                    [4, "Лекционные занятия Разработка программного обеспечения кроссплатформенных мобильных систем ", "13:30:00", "15:05:00", " Черников В. Н. ", "408/2", 0]
                ]
            },
            "Denominator": {
                "Monday": [
                    [5, "Лекционные занятия Параллельные и распределенные вычисления ", "15:15:00", "16:50:00", " Кравец О. Я. ", "408/2", 0],
                    [6, "Лабораторные занятия Параллельные и распределенные вычисления ", "17:00:00", "18:35:00", " Кравец О. Я. ", "408/2", 0]
                ],
                "Tuesday": [
                    [5, "Практические занятия Технологическое предпринимательство ", "15:15:00", "16:50:00", " Недикова Т. Н. ", "408/2", 0],
                    [6, "Лекционные занятия Социальные коммуникации ", "17:00:00", "18:35:00", " Белоглазова Л. А. ", "312/2", 0]
                ],
                "Wednesday": [
                    [5, "Лабораторные занятия Интеллектуальные системы ", "15:15:00", "16:50:00", " Олейникова С. А. ", "419/2", 0],
                    [6, "Лабораторные занятия Интеллектуальные системы ", "17:00:00", "18:35:00", " Олейникова С. А. ", "419/2", 0]
                ],
                "Thursday": [
                    [5, "Лекционные занятия Интеллектуальные системы ", "15:15:00", "16:50:00", " Олейникова С. А. ", "419/2", 0],
                    [6, "Лекционные занятия Современные методы проектирования распределенных приложений ", "17:00:00", "18:35:00", " Олейникова С. А. ", "419/2", 0],
                    [7, "Лекционные занятия Современные методы проектирования распределенных приложений ", "18:40:00", "20:05:00", " Олейникова С. А. ", "419/2", 0]
                ],
                "Friday": [],
                "Saturday": [
                    [2, "Лабораторные занятия Разработка программного обеспечения кроссплатформенных мобильных систем ", "9:45:00", "11:20:00", " Черников В. Н.  Черников В. Н. ", "408/2", 0],
                    [3, "Лабораторные занятия Разработка программного обеспечения кроссплатформенных мобильных систем ", "11:30:00", "13:05:00", " Черников В. Н.  Черников В. Н. ", "408/2", 0]
                ]
            }
        },
        "vbID_241": {
            "Numerator": {
                "Monday": [
                    [6, "Практические занятия Иностранный язык ", "17:00:00", "18:35:00", " Нехаева О. Г. ", "116а/2", 0],
                    [7, "Практические занятия Иностранный язык ", "18:40:00", "20:05:00", " Нехаева О. Г. ", "116а/2", 0]
                ],
                "Tuesday": [],
                "Wednesday": [
                    [6, "Практические занятия Иностранный язык ", "17:00:00", "18:35:00", " Нехаева О. Г. ", "116а/2", 0],
                    [7, "Практические занятия Иностранный язык ", "18:40:00", "20:05:00", " Нехаева О. Г. ", "116а/2", 0]
                ],
                "Thursday": [],
                "Friday": [
                    [6, "с 17:50 -до 19:25  Лекционные занятия Русский язык и деловое общение ", "17:00:00", "18:35:00", " Денисова М. А. ", "6350", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия Русский язык и деловое общение ", "18:40:00", "20:05:00", " Денисова М. А. ", "6350", 0]
                ],
                "Saturday": [
                    [3, "Лекционные занятия Архитектура и организация ЭВМ ", "11:30:00", "13:05:00", " Рязанцев С. В. ", "307/2", 0],
                    [4, "Практические занятия Основы российской государственности ", "13:30:00", "15:05:00", " Дорош А. А. ", "313/1", 0],
                    [5, "Лекционные занятия Физическая культура и спорт ", "15:15:00", "16:50:00", " Литвинов Е. В. ", "301/1", 0]
                ]
            },
            "Denominator": {
                "Monday": [],
                "Tuesday": [
                    [6, "Лабораторные занятия Архитектура и организация ЭВМ ", "17:00:00", "18:35:00", " Рязанцев С. В. ", "204/2", 0],
                    [7, "Лабораторные занятия Архитектура и организация ЭВМ ", "18:40:00", "20:05:00", " Рязанцев С. В. ", "204/2", 0]
                ],
                "Wednesday": [
                    [6, "Лабораторные занятия Архитектура и организация ЭВМ ", "17:00:00", "18:35:00", " Рязанцев С. В. ", "205б/2", 0],
                    [7, "Лабораторные занятия Архитектура и организация ЭВМ ", "18:40:00", "20:05:00", " Рязанцев С. В. ", "205б/2", 0]
                ],
                "Thursday": [
                    [5, "Практические занятия Иностранный язык ", "15:15:00", "16:50:00", " Макарова А. А. ", "116/2", 0],
                    [6, "Практические занятия Иностранный язык ", "17:00:00", "18:35:00", " Макарова А. А. ", "116/2", 0]
                ],
                "Friday": [
                    [6, "с 17:50 -до 19:25  Лекционные занятия История России ", "17:00:00", "18:35:00", " Деревянко А. В. ", "5313", 0],
                    [7, "с 19:35 -до 21:10  Практические занятия История России ", "18:40:00", "20:05:00", " Деревянко А. В. ", "5313", 0]
                ],
                "Saturday": [
                    [3, "Лекционные занятия Математика ", "11:30:00", "13:05:00", " Соколова О. А. ", "301/1", 0],
                    [4, "Практические занятия Математика ", "13:30:00", "15:05:00", " Соколова О. А. ", "220/1", 0],
                    [5, "Лекционные занятия Основы российской государственности ", "15:15:00", "16:50:00", " Дорош А. А. ", "313/1", 0]
                ]
            }
        }
    }
}